<?php
class api_hisapiController extends controller {
	public function initAction(){
	}
	public function ws_hisapiAction(){
		require_once(__SITEROOT.'application/api/models/api_his_index.php');		
		$server = new SoapServer(__SITEROOT.'wsdl/api_his_index.wsdl');
		$server->setClass('api_his_index');		      
        $server->handle();
        /*$xml_string="<?xml version='1.0' encoding='UTF-8'?>
<tables><table name='examination_table' >
  <row>
    <staff_id>510824198308190834</staff_id>
    <serial_number>513101193809172121</serial_number>
    <examination_doctor>510824198308190834</examination_doctor>
    <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
    <identity_number>513101193301152525</identity_number>
    <org_id>511804201</org_id>
  </row>
  <row>
    <staff_id>510824198308190834</staff_id>
    <serial_number>513101195410172524</serial_number>
    <examination_doctor>511025198711202222</examination_doctor>
    <ext_uuid>B72F6E0E-23A0-4E7E-AEC0-E4C9A045361D</ext_uuid>
    <identity_number>513101196912282322</identity_number>
    <org_id>511804201</org_id>
    <created>1345454540</created>
  </row>
  <row>
    <staff_id>510103199901010001</staff_id>
    <serial_number>513101195001152127</serial_number>
    <examination_doctor>510824198308190834</examination_doctor>
    <ext_uuid>C097E5BB-26C3-4771-A3BD-A0B3F395D07D</ext_uuid>
    <identity_number>51312419811019341x</identity_number>
    <org_id>511804201</org_id>
  </row>
  <row>
    <staff_id>510103199901010001</staff_id>
    <serial_number>513101196604172519</serial_number>
    <examination_doctor>510824198308190834</examination_doctor>
    <ext_uuid>A81C39BA-C31D-4B26-AC6E-1AFB4F10355D</ext_uuid>
    <identity_number>513101197201053819</identity_number>
    <org_id>511804201</org_id>
  </row>
  </table>
  <table name='et_examination' >
  <row>
    <staff_id>510824198308190834</staff_id>
    <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
    <org_id>511804201</org_id>
    <identity_number>513101193301152525</identity_number>
  </row>
    <row>
    <staff_id>510824198308190834</staff_id>
    <ext_uuid>A81C39BA-C31D-4B26-AC6E-1AFB4F10355D</ext_uuid>
    <org_id>511804201</org_id>
    <identity_number>513101197201053819</identity_number>
  </row>
  <row>
    <staff_id>510824198308190834</staff_id>
    <ext_uuid>C097E5BB-26C3-4771-A3BD-A0B3F395D07D</ext_uuid>
    <org_id>511804201</org_id>
    <identity_number>51312419811019341x</identity_number>
  </row>
  </table>
  <table name='et_main_drug_use'>
  <row>
  <identity_number>513101193301152525</identity_number>
  <staff_id>510824198308190834</staff_id>
  <created>1325309749</created>
  <drug_name>青霉素</drug_name>
  <drug_usage>每天</drug_usage>
  <drug_dosage>0.1</drug_dosage>
  <drug_time>3</drug_time>
  <drug_compliance>1</drug_compliance>
  <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
  <org_id>511804201</org_id>
  </row>
  <row>
  <identity_number>513101193301152525</identity_number>
  <staff_id>510824198308190834</staff_id>
  <created>1325309749</created>
  <drug_name>土霉素</drug_name>
  <drug_usage>每天</drug_usage>
  <drug_dosage>0.3</drug_dosage>
  <drug_time>3</drug_time>
  <drug_compliance>2</drug_compliance>
  <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
  <org_id>511804201</org_id>
  </row>
  <row>
  <identity_number>513101193301152525</identity_number>
  <staff_id>510824198308190834</staff_id>
  <created>1325309749</created>
  <drug_name>依巴斯汀</drug_name>
  <drug_usage>每天</drug_usage>
  <drug_dosage>0.3</drug_dosage>
  <drug_time>4</drug_time>
  <drug_compliance>3</drug_compliance>
  <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
  <org_id>511804201</org_id>
  </row>
  </table>
  <table name='et_operation_history'>
     <row>
       <identity_number>513101193301152525</identity_number>
       <staff_id>510824198308190834</staff_id>
       <created>1325642233</created>
       <put_bed_time>1325548800</put_bed_time>
       <receive_bed_time>1325808000</receive_bed_time>
       <reason>xxx11111原因</reason>
       <organization>医院24</organization>
       <record_no>ccc9090</record_no>
       <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
       <org_id>511804201</org_id>
      </row>
      <row>
      <identity_number>513101193301152525</identity_number>
      <staff_id>510824198308190834</staff_id>
      <created>1325642233</created>
      <put_bed_time>1325721600</put_bed_time>
      <receive_bed_time>1326326400</receive_bed_time>
      <reason>xxx22222原因</reason>
      <organization>医院3</organization>
      <record_no>ccc9090</record_no>
      <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
      <org_id>511804201</org_id>
      </row>
  </table>
  <table name='et_health_guidance'>
      <row>
          <identity_number>513101193301152525</identity_number>
	      <staff_id>510824198308190834</staff_id>
	      <created>1325642233</created>
	      <ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid>
          <org_id>511804201</org_id>
      </row>
      <row>
	    <staff_id>510824198308190834</staff_id>
	    <ext_uuid>B72F6E0E-23A0-4E7E-AEC0-E4C9A045361D</ext_uuid>
	    <identity_number>513101196912282322</identity_number>
	    <org_id>511804201</org_id>
    </row>
  </table>
  </tables>
  ";*/
        /*
    $xml_string = '<EMR02.00.01>
	<ZLG02.00.01.065>
		<ZLE02.00.01.002 code="ZL51.99.004.01" name="体格检查结果">主要体征：T36.8℃，P78次/分，R20次/分，BP118/78mmHg。

</ZLE02.00.01.002>
	</ZLG02.00.01.065>
	<ZLG02.00.01.066>
		<ZLE02.00.01.001 code="ZL51.01.300.01" name="现病史描述">:头部外伤5+小时

</ZLE02.00.01.001>
	</ZLG02.00.01.066>
	<ZLG02.00.01.067>
		<ZLG02.00.01.068>
			<EMR02.00.01.217 code="HR51.01.001.90" name="既往史观察项目类目名称"/>
			<EMR02.00.01.218 code="HR51.01.001.91" name="既往史观察结果"/>
		</ZLG02.00.01.068>
	</ZLG02.00.01.067>
	<ZLG02.00.01.001>
		<EMR02.00.01.001 code="HR00.00.001.01" name="文档标识-名称">门(急)诊病历</EMR02.00.01.001>
		<EMR02.00.01.002 code="HR00.00.001.02" name="文档标识-类别代码">02</EMR02.00.01.002>
		<EMR02.00.01.003 code="HR00.00.001.03" name="文档标识-管理机构名称">石棉县区域医疗协同平台</EMR02.00.01.003>
		<EMR02.00.01.005 code="HR00.00.001.05" name="文档标识-号码">05E9D182DD0B44FF98802B439AE34801</EMR02.00.01.005>
		<EMR02.00.01.006 code="HR00.00.001.06" name="文档标识-生效日期">2013-02-08T00:40:37</EMR02.00.01.006>
		<EMR02.00.01.004 code="HR00.00.001.04" name="文档标识-管理机构组织机构代码（法人代码）">0000000005118249000009</EMR02.00.01.004>
	</ZLG02.00.01.001>
	<ZLG02.00.01.002>
		<EMR02.00.01.016 code="HR02.01.001.01" name="姓名-标识对象">本人姓名</EMR02.00.01.016>
		<EMR02.00.01.017 code="HR02.01.001.02" name="姓名-标识对象代码">01</EMR02.00.01.017>
		<EMR02.00.01.018 code="HR02.01.002" name="姓名">保吉以古子</EMR02.00.01.018>
		<EMR02.00.01.019 code="HR42.01.012" name="病人类型代码">01</EMR02.00.01.019>
		<ZLE02.00.01.195 code="ZL02.01.001.01" name="健康档案标识符">150065</ZLE02.00.01.195>
		<ZLG02.00.01.022>
			<EMR02.00.01.011 code="HR01.01.002.01" name="标识号-类别代码">16</EMR02.00.01.011>
			<EMR02.00.01.012 code="HR01.01.002.02" name="标识号-号码">1302070114</EMR02.00.01.012>
			<EMR02.00.01.013 code="HR01.01.002.03" name="标识号-生效日期">2013-02-08</EMR02.00.01.013>
			<EMR02.00.01.015 code="HR01.01.002.05" name="标识号-提供标识的机构名称">石棉县人民医院</EMR02.00.01.015>
		</ZLG02.00.01.022>
		<ZLG02.00.01.022>
			<EMR02.00.01.011 code="HR01.01.002.01" name="标识号-类别代码">99</EMR02.00.01.011>
			<EMR02.00.01.012 code="HR01.01.002.02" name="标识号-号码">N0021015</EMR02.00.01.012>
			<EMR02.00.01.013 code="HR01.01.002.03" name="标识号-生效日期">2013-02-08</EMR02.00.01.013>
			<EMR02.00.01.015 code="HR01.01.002.05" name="标识号-提供标识的机构名称">石棉县人民医院</EMR02.00.01.015>
		</ZLG02.00.01.022>
		<ZLG02.00.01.022>
			<EMR02.00.01.011 code="HR01.01.002.01" name="标识号-类别代码">01</EMR02.00.01.011>
			<EMR02.00.01.012 code="HR01.01.002.02" name="标识号-号码">513435198107234714</EMR02.00.01.012>
			<EMR02.00.01.013 code="HR01.01.002.03" name="标识号-生效日期">1981-07-23</EMR02.00.01.013>
		</ZLG02.00.01.022>
	</ZLG02.00.01.002>
	<ZLG02.00.01.003>
		<EMR02.00.01.021 code="HR02.02.001" name="性别代码">1</EMR02.00.01.021>
		<EMR02.00.01.022 code="HR02.03.001" name="年龄（岁）">31岁</EMR02.00.01.022>
		<EMR02.00.01.023 code="HR02.04.001" name="国籍代码">156</EMR02.00.01.023>
		<EMR02.00.01.024 code="HR02.05.001" name="民族代码">07</EMR02.00.01.024>
		<EMR02.00.01.025 code="HR02.06.001" name="婚姻状况类别代码">20</EMR02.00.01.025>
		<EMR02.00.01.028 code="HR02.08.001" name="文化程度代码">99</EMR02.00.01.028>
		<ZLG02.00.01.023>
			<EMR02.00.01.026 code="HR02.07.011.01" name="职业编码系统名称">GB/T6565-1999职业分类与代码</EMR02.00.01.026>
			<EMR02.00.01.027 code="HR02.07.011.02" name="职业代码">27</EMR02.00.01.027>
		</ZLG02.00.01.023>
		<EMR02.00.01.029 code="HR30.00.001" name="出生日期">1981-07-23</EMR02.00.01.029>
		<EMR02.00.01.030 code="HR30.00.005" name="出生地">四川甘洛县</EMR02.00.01.030>
	</ZLG02.00.01.003>
	<ZLG02.00.01.004>
		<EMR02.00.01.042 code="HR03.00.003" name="标识地址类别的代码">09</EMR02.00.01.042>
		<EMR02.00.01.043 code="HR03.00.004.01" name="地址-省（自治区、直辖市）">四川省</EMR02.00.01.043>
		<EMR02.00.01.044 code="HR03.00.004.02" name="地址-市（地区）"/>
		<EMR02.00.01.047 code="HR03.00.004.05" name="地址-村（街、路、弄等）">四川省甘洛县坪坝乡黄水塘村3组1号</EMR02.00.01.047>
		<EMR02.00.01.045 code="HR03.00.004.03" name="地址-县（区）"/>
	</ZLG02.00.01.004>
	<ZLG02.00.01.004>
		<EMR02.00.01.042 code="HR03.00.003" name="标识地址类别的代码">02</EMR02.00.01.042>
		<EMR02.00.01.043 code="HR03.00.004.01" name="地址-省（自治区、直辖市）">四川省</EMR02.00.01.043>
		<EMR02.00.01.044 code="HR03.00.004.02" name="地址-市（地区）"/>
		<EMR02.00.01.047 code="HR03.00.004.05" name="地址-村（街、路、弄等）">四川甘洛县</EMR02.00.01.047>
		<EMR02.00.01.049 code="HR03.00.005" name="邮政编码">0201</EMR02.00.01.049>
		<EMR02.00.01.045 code="HR03.00.004.03" name="地址-县（区）"/>
	</ZLG02.00.01.004>
	<ZLG02.00.01.004>
		<EMR02.00.01.042 code="HR03.00.003" name="标识地址类别的代码">98</EMR02.00.01.042>
		<EMR02.00.01.043 code="HR03.00.004.01" name="地址-省（自治区、直辖市）">四川省</EMR02.00.01.043>
		<EMR02.00.01.044 code="HR03.00.004.02" name="地址-市（地区）"/>
		<EMR02.00.01.047 code="HR03.00.004.05" name="地址-村（街、路、弄等）">四川甘洛县</EMR02.00.01.047>
		<EMR02.00.01.045 code="HR03.00.004.03" name="地址-县（区）"/>
	</ZLG02.00.01.004>
	<ZLG02.00.01.005>
		<EMR02.00.01.061 code="HR04.00.001.01" name="联系电话-类别">家庭电话</EMR02.00.01.061>
		<EMR02.00.01.063 code="HR04.00.001.03" name="联系电话-号码">13550451970</EMR02.00.01.063>
		<EMR02.00.01.062 code="HR04.00.001.02" name="联系电话-类别代码">04</EMR02.00.01.062>
	</ZLG02.00.01.005>
	<ZLG02.00.01.006>
		<EMR02.00.01.071 code="HR21.01.100.01" name="机构名称">石棉县人民医院</EMR02.00.01.071>
		<EMR02.00.01.072 code="HR21.01.100.02" name="机构组织机构代码">SM000001151182410A1001</EMR02.00.01.072>
		<EMR02.00.01.073 code="HR21.01.100.03" name="机构负责人（法人）"/>
		<EMR02.00.01.074 code="HR21.01.100.04" name="机构地址">四川雅安石棉</EMR02.00.01.074>
		<ZLG02.00.01.064>
			<EMR02.00.01.075 code="HR21.01.100.05" name="科室名称">外二科</EMR02.00.01.075>
			<ZLE02.00.01.199 code="ZL21.01.100.02" name="科室ID">SM0000011010208</ZLE02.00.01.199>
		</ZLG02.00.01.064>
	</ZLG02.00.01.006>
	<ZLG02.00.01.007>
		<EMR02.00.01.361 code="HR22.01.100" name="服务者姓名">陈文杰</EMR02.00.01.361>
		<EMR02.00.01.362 code="HR22.01.101.01" name="服务者职责（角色）"/>
		<EMR02.00.01.363 code="HR22.01.101.02" name="服务者职责（角色）代码">31</EMR02.00.01.363>
		<EMR02.00.01.364 code="HR22.01.102" name="服务者专业技术职务">副主任医师</EMR02.00.01.364>
		<EMR02.00.01.365 code="HR22.01.103" name="服务者学历">不详</EMR02.00.01.365>
		<EMR02.00.01.367 code="HR22.01.105" name="服务者专业技术职务等级">副高级</EMR02.00.01.367>
		<ZLG02.00.01.062>
			<EMR02.00.01.368 code="HR22.01.106" name="服务者职务"/>
		</ZLG02.00.01.062>
		<ZLE02.00.01.198 code="ZL22.01.101" name="服务者ID">159</ZLE02.00.01.198>
		<ZLG02.00.01.061>
			<EMR02.00.01.366 code="HR22.01.104" name="服务者所学专业"/>
		</ZLG02.00.01.061>
	</ZLG02.00.01.007>
	<ZLG02.00.01.008>
		<EMR02.00.01.371 code="HR42.01.001" name="卫生事件(动作)名称">门(急)诊就诊</EMR02.00.01.371>
		<EMR02.00.01.373 code="HR42.02.200" name="事件开始时间">2013-02-07T20:55:20</EMR02.00.01.373>
		<EMR02.00.01.374 code="HR42.02.201" name="事件结束时间">2013-02-08T00:40:37</EMR02.00.01.374>
		<ZLG02.00.01.059>
			<EMR02.00.01.377 code="HR42.99.001" name="事件参与方">首诊医师:陈文杰</EMR02.00.01.377>
		</ZLG02.00.01.059>
		<ZLG02.00.01.059>
			<EMR02.00.01.377 code="HR42.99.001" name="事件参与方">患者:保吉以古子</EMR02.00.01.377>
		</ZLG02.00.01.059>
		<ZLG02.00.01.060>
			<ZLE02.00.01.196 code="ZL42.03.100" name="事件发生地点-ID">SM0000011010208</ZLE02.00.01.196>
			<EMR02.00.01.375 code="HR42.03.100" name="事件发生地点">外二科</EMR02.00.01.375>
			<EMR02.00.01.376 code="HR42.03.101" name="事件发生场所">石棉县人民医院</EMR02.00.01.376>
			<ZLE02.00.01.197 code="ZL42.03.101" name="事件发生场所-ID">SM000001151182410A1001</ZLE02.00.01.197>
		</ZLG02.00.01.060>
	</ZLG02.00.01.008>
	<ZLG02.00.01.009>
		<EMR02.00.01.089 code="HR51.01.220.08" name="初诊标志">1</EMR02.00.01.089>
		<EMR02.00.01.081 code="HR51.01.037" name="主诉"> 头部外伤5+小时

</EMR02.00.01.081>
	</ZLG02.00.01.009>
	<ZLG02.00.01.014>
		<EMR02.00.01.321 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR02.00.01.321>
		<EMR02.00.01.322 code="HR42.02.012" name="诊断日期">2013-02-07T21:04:27</EMR02.00.01.322>
		<EMR02.00.01.323 code="HR55.02.057.01" name="诊断类别">门诊诊断</EMR02.00.01.323>
		<EMR02.00.01.324 code="HR55.02.057.02" name="诊断类别代码">2</EMR02.00.01.324>
		<ZLE02.00.01.203 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE02.00.01.204 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLE02.00.01.259 code="ZL55.02.057.01" name="诊断机构代码">SM000001151182410A1001</ZLE02.00.01.259>
		<ZLG02.00.01.031>
			<EMR02.00.01.325 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">11</EMR02.00.01.325>
			<EMR02.00.01.326 code="HR55.02.057.04" name="疾病名称">头皮裂伤</EMR02.00.01.326>
			<EMR02.00.01.327 code="HR55.02.057.05" name="疾病代码">S01.001</EMR02.00.01.327>
			<EMR02.00.01.328 code="HR55.02.057.06" name="诊断依据"/>
			<EMR02.00.01.329 code="HR55.02.057.07" name="诊断依据代码"/>
		</ZLG02.00.01.031>
	</ZLG02.00.01.014>
	<ZLG02.00.01.015>
		<ZLG02.00.01.025>
			<EMR02.00.01.331 code="HR54.01.050" name="拟做的检查"/>
		</ZLG02.00.01.025>
		<ZLG02.00.01.028>
			<EMR02.00.01.341 code="HR54.01.053" name="随访标志">0</EMR02.00.01.341>
		</ZLG02.00.01.028>
		<ZLG02.00.01.030>
			<EMR02.00.01.344 code="HR54.01.056" name="特别注意事项"/>
		</ZLG02.00.01.030>
		<ZLG02.00.01.029>
			<EMR02.00.01.343 code="HR54.01.055" name="医嘱"/>
		</ZLG02.00.01.029>
		<ZLG02.00.01.027>
			<EMR02.00.01.333 code="HR54.01.052" name="今后治疗方案">(S01.001)头皮裂伤  清创缝合、住院观察治疗                                      </EMR02.00.01.333>
		</ZLG02.00.01.027>
		<ZLG02.00.01.026>
			<EMR02.00.01.332 code="HR54.01.051" name="拟做的医学检验"/>
		</ZLG02.00.01.026>
	</ZLG02.00.01.015>
</EMR02.00.01>
';*/
     /* $xml_string = '<EMR08.00.01>
	<ZLG08.00.01.016>
		<EMR08.01.01.191 code="HR53.02.001.01" name="住院期间输血品种代码">01</EMR08.01.01.191>
		<EMR08.01.01.192 code="HR53.02.001.02" name="住院期间输血量"/>
		<EMR08.01.01.196 code="HR52.01.102" name="输血方法"/>
		<EMR08.01.01.194 code="HR55.02.050" name="住院患者输血反应标志">0</EMR08.01.01.194>
		<EMR08.01.01.195 code="HR42.02.200" name="输血日期时间"/>
		<EMR08.01.01.193 code="HR53.02.001.03" name="住院患者输血量计量单位">单位</EMR08.01.01.193>
	</ZLG08.00.01.016>
	<ZLG08.00.01.016>
		<EMR08.01.01.191 code="HR53.02.001.01" name="住院期间输血品种代码">99</EMR08.01.01.191>
		<EMR08.01.01.192 code="HR53.02.001.02" name="住院期间输血量"/>
		<EMR08.01.01.196 code="HR52.01.102" name="输血方法"/>
		<EMR08.01.01.194 code="HR55.02.050" name="住院患者输血反应标志">0</EMR08.01.01.194>
		<EMR08.01.01.195 code="HR42.02.200" name="输血日期时间"/>
		<EMR08.01.01.193 code="HR53.02.001.03" name="住院患者输血量计量单位">ml</EMR08.01.01.193>
	</ZLG08.00.01.016>
	<ZLG08.00.01.016>
		<EMR08.01.01.191 code="HR53.02.001.01" name="住院期间输血品种代码">04</EMR08.01.01.191>
		<EMR08.01.01.192 code="HR53.02.001.02" name="住院期间输血量"/>
		<EMR08.01.01.196 code="HR52.01.102" name="输血方法"/>
		<EMR08.01.01.194 code="HR55.02.050" name="住院患者输血反应标志">0</EMR08.01.01.194>
		<EMR08.01.01.195 code="HR42.02.200" name="输血日期时间"/>
		<EMR08.01.01.193 code="HR53.02.001.03" name="住院患者输血量计量单位">ml</EMR08.01.01.193>
	</ZLG08.00.01.016>
	<ZLG08.00.01.016>
		<EMR08.01.01.191 code="HR53.02.001.01" name="住院期间输血品种代码">03</EMR08.01.01.191>
		<EMR08.01.01.192 code="HR53.02.001.02" name="住院期间输血量"/>
		<EMR08.01.01.196 code="HR52.01.102" name="输血方法"/>
		<EMR08.01.01.194 code="HR55.02.050" name="住院患者输血反应标志">0</EMR08.01.01.194>
		<EMR08.01.01.195 code="HR42.02.200" name="输血日期时间"/>
		<EMR08.01.01.193 code="HR53.02.001.03" name="住院患者输血量计量单位">ml</EMR08.01.01.193>
	</ZLG08.00.01.016>
	<ZLG08.00.01.016>
		<EMR08.01.01.191 code="HR53.02.001.01" name="住院期间输血品种代码">02</EMR08.01.01.191>
		<EMR08.01.01.192 code="HR53.02.001.02" name="住院期间输血量"/>
		<EMR08.01.01.196 code="HR52.01.102" name="输血方法"/>
		<EMR08.01.01.194 code="HR55.02.050" name="住院患者输血反应标志">0</EMR08.01.01.194>
		<EMR08.01.01.195 code="HR42.02.200" name="输血日期时间"/>
		<EMR08.01.01.193 code="HR53.02.001.03" name="住院患者输血量计量单位">袋</EMR08.01.01.193>
	</ZLG08.00.01.016>
	<ZLG08.00.01.017>
		<ZLG08.00.01.035>
			<EMR08.01.01.201 code="HR54.01.050" name="拟做的检查"/>
		</ZLG08.00.01.035>
		<ZLG08.00.01.038>
			<EMR08.01.01.204 code="HR54.01.053" name="随访标志">1</EMR08.01.01.204>
			<EMR08.01.01.205 code="HR54.01.054" name="随访间隔（随诊期限）">7</EMR08.01.01.205>
		</ZLG08.00.01.038>
	</ZLG08.00.01.017>
	<ZLG08.00.01.018>
		<EMR08.01.01.212 code="HR55.01.047" name="住院患者抢救次数"/>
		<EMR08.01.01.216 code="HR55.01.055" name="患者去向代码">11</EMR08.01.01.216>
		<EMR08.01.01.215 code="HR55.01.056" name="抢救类别标识代码"/>
		<EMR08.01.01.213 code="HR55.01.048" name="住院患者抢救成功次数"/>
	</ZLG08.00.01.018>
	<ZLG08.00.01.019>
		<ZLG08.00.01.041>
			<EMR08.01.01.223 code="HR55.01.045.01" name="住院患者诊断符合情况-详细描述">符合</EMR08.01.01.223>
			<EMR08.01.01.222 code="HR55.02.048" name="住院患者疾病诊断对照代码">01</EMR08.01.01.222>
			<EMR08.01.01.224 code="HR55.01.045.02" name="住院患者诊断符合情况-代码">00</EMR08.01.01.224>
			<EMR08.01.01.221 code="HR55.02.047" name="患者疾病诊断对照">门诊诊断与出院诊断</EMR08.01.01.221>
		</ZLG08.00.01.041>
		<ZLG08.00.01.041>
			<EMR08.01.01.223 code="HR55.01.045.01" name="住院患者诊断符合情况-详细描述">符合</EMR08.01.01.223>
			<EMR08.01.01.222 code="HR55.02.048" name="住院患者疾病诊断对照代码">02</EMR08.01.01.222>
			<EMR08.01.01.224 code="HR55.01.045.02" name="住院患者诊断符合情况-代码">00</EMR08.01.01.224>
			<EMR08.01.01.221 code="HR55.02.047" name="患者疾病诊断对照">入院诊断与出院诊断</EMR08.01.01.221>
		</ZLG08.00.01.041>
		<ZLG08.00.01.041>
			<EMR08.01.01.223 code="HR55.01.045.01" name="住院患者诊断符合情况-详细描述">无对照</EMR08.01.01.223>
			<EMR08.01.01.222 code="HR55.02.048" name="住院患者疾病诊断对照代码">10</EMR08.01.01.222>
			<EMR08.01.01.224 code="HR55.01.045.02" name="住院患者诊断符合情况-代码">99</EMR08.01.01.224>
			<EMR08.01.01.221 code="HR55.02.047" name="患者疾病诊断对照">放射诊断与病理诊断</EMR08.01.01.221>
		</ZLG08.00.01.041>
		<ZLG08.00.01.041>
			<EMR08.01.01.223 code="HR55.01.045.01" name="住院患者诊断符合情况-详细描述">符合</EMR08.01.01.223>
			<EMR08.01.01.222 code="HR55.02.048" name="住院患者疾病诊断对照代码">09</EMR08.01.01.222>
			<EMR08.01.01.224 code="HR55.01.045.02" name="住院患者诊断符合情况-代码">00</EMR08.01.01.224>
			<EMR08.01.01.221 code="HR55.02.047" name="患者疾病诊断对照">出院诊断与病理诊断</EMR08.01.01.221>
		</ZLG08.00.01.041>
		<ZLG08.00.01.041>
			<EMR08.01.01.223 code="HR55.01.045.01" name="住院患者诊断符合情况-详细描述">无对照</EMR08.01.01.223>
			<EMR08.01.01.222 code="HR55.02.048" name="住院患者疾病诊断对照代码">03</EMR08.01.01.222>
			<EMR08.01.01.224 code="HR55.01.045.02" name="住院患者诊断符合情况-代码">99</EMR08.01.01.224>
			<EMR08.01.01.221 code="HR55.02.047" name="患者疾病诊断对照">术前诊断与术后诊断</EMR08.01.01.221>
		</ZLG08.00.01.041>
		<ZLG08.00.01.041>
			<EMR08.01.01.223 code="HR55.01.045.01" name="住院患者诊断符合情况-详细描述">符合</EMR08.01.01.223>
			<EMR08.01.01.222 code="HR55.02.048" name="住院患者疾病诊断对照代码">99</EMR08.01.01.222>
			<EMR08.01.01.224 code="HR55.01.045.02" name="住院患者诊断符合情况-代码">00</EMR08.01.01.224>
			<EMR08.01.01.221 code="HR55.02.047" name="患者疾病诊断对照">其他</EMR08.01.01.221>
		</ZLG08.00.01.041>
		<EMR08.01.01.226 code="HR42.02.202" name="入院后诊断时间（天）">1</EMR08.01.01.226>
		<EMR08.01.01.225 code="HR55.01.049" name="住院病例病案质量代码">01</EMR08.01.01.225>
	</ZLG08.00.01.019>
	<ZLG08.00.01.020>
		<EMR08.01.01.232 code="HR52.02.103" name="诊疗过程描述">门诊</EMR08.01.01.232>
		<EMR08.01.01.231 code="HR52.02.102" name="诊疗过程名称">入院方式</EMR08.01.01.231>
	</ZLG08.00.01.020>
	<ZLG08.00.01.020>
		<EMR08.01.01.232 code="HR52.02.103" name="诊疗过程描述">0</EMR08.01.01.232>
		<EMR08.01.01.231 code="HR52.02.102" name="诊疗过程名称">示教病案</EMR08.01.01.231>
	</ZLG08.00.01.020>
	<ZLG08.00.01.020>
		<EMR08.01.01.232 code="HR52.02.103" name="诊疗过程描述">一般</EMR08.01.01.232>
		<EMR08.01.01.231 code="HR52.02.102" name="诊疗过程名称">入院病况</EMR08.01.01.231>
	</ZLG08.00.01.020>
	<ZLG08.00.01.020>
		<EMR08.01.01.232 code="HR52.02.103" name="诊疗过程描述">6</EMR08.01.01.232>
		<EMR08.01.01.231 code="HR52.02.102" name="诊疗过程名称">住院天数</EMR08.01.01.231>
	</ZLG08.00.01.020>
	<ZLG08.00.01.020>
		<EMR08.01.01.232 code="HR52.02.103" name="诊疗过程描述">正常</EMR08.01.01.232>
		<EMR08.01.01.231 code="HR52.02.102" name="诊疗过程名称">出院方式</EMR08.01.01.231>
	</ZLG08.00.01.020>
	<ZLG08.00.01.020>
		<EMR08.01.01.232 code="HR52.02.103" name="诊疗过程描述">2013-02-01</EMR08.01.01.232>
		<EMR08.01.01.231 code="HR52.02.102" name="诊疗过程名称">确诊日期</EMR08.01.01.231>
	</ZLG08.00.01.020>
	<ZLG08.00.01.021>
		<EMR08.01.01.248 code="HR56.00.002.05" name="住院费用-医疗付款方式代码">03</EMR08.01.01.248>
		<EMR08.01.01.249 code="HR56.00.003" name="个人承担费用（元）">986.99</EMR08.01.01.249>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">检验</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">05</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">382.00</EMR08.01.01.247>
		</ZLG08.00.01.042>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">西药</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">01</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">755.59</EMR08.01.01.247>
		</ZLG08.00.01.042>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">治疗</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">07</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">158.00</EMR08.01.01.247>
		</ZLG08.00.01.042>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">床位</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">11</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">70.00</EMR08.01.01.247>
		</ZLG08.00.01.042>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">护理</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">12</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">56.00</EMR08.01.01.247>
		</ZLG08.00.01.042>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">特检</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">06</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">234.00</EMR08.01.01.247>
		</ZLG08.00.01.042>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">其他</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">99</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">106.26</EMR08.01.01.247>
		</ZLG08.00.01.042>
		<ZLG08.00.01.042>
			<EMR08.01.01.245 code="HR56.00.002.01" name="住院费用-分类">中成药</EMR08.01.01.245>
			<EMR08.01.01.246 code="HR56.00.002.02" name="住院费用-分类代码">03</EMR08.01.01.246>
			<EMR08.01.01.247 code="HR56.00.002.03" name="住院费用-金额（元/人民币）">242.20</EMR08.01.01.247>
		</ZLG08.00.01.042>
	</ZLG08.00.01.021>
	<ZLG08.00.01.022>
		<EMR08.01.01.022 code="HR51.03.004" name="RH血型">3</EMR08.01.01.022>
		<EMR08.01.01.021 code="HR51.03.003" name="ABO血型">5</EMR08.01.01.021>
	</ZLG08.00.01.022>
	<ZLG08.00.01.001>
		<EMR08.01.01.001 code="HR00.00.001.01" name="文档标识-名称">住院病案首页</EMR08.01.01.001>
		<EMR08.01.01.002 code="HR00.00.001.02" name="文档标识-类别代码">08</EMR08.01.01.002>
		<EMR08.01.01.003 code="HR00.00.001.03" name="文档标识-管理机构名称">石棉县区域医疗协同平台</EMR08.01.01.003>
		<EMR08.01.01.005 code="HR00.00.001.05" name="文档标识-号码">DEA10174ADEE4F2F89267250496C2C6A</EMR08.01.01.005>
		<EMR08.01.01.006 code="HR00.00.001.06" name="文档标识-生效日期">2013-02-01T12:29:00</EMR08.01.01.006>
		<EMR08.01.01.004 code="HR00.00.001.04" name="文档标识-管理机构组织机构代码（法人代码）">0000000005118249000009</EMR08.01.01.004>
	</ZLG08.00.01.001>
	<ZLG08.00.01.002>
		<EMR08.01.01.011 code="HR02.01.001.01" name="姓名-标识对象">本人姓名</EMR08.01.01.011>
		<EMR08.01.01.012 code="HR02.01.001.02" name="姓名-标识对象代码">28</EMR08.01.01.012>
		<EMR08.01.01.013 code="HR02.01.002" name="姓名">阿布阿姐</EMR08.01.01.013>
		<EMR08.01.01.014 code="HR42.01.012" name="病人类型代码">03</EMR08.01.01.014>
		<ZLE08.00.01.001 code="ZL02.01.001.01" name="健康档案标识符">372436</ZLE08.00.01.001>
		<ZLG08.00.01.023>
			<EMR08.01.01.015 code="HR01.01.002.01" name="标识号-类别代码">14</EMR08.01.01.015>
			<EMR08.01.01.016 code="HR01.01.002.02" name="标识号-号码">201302890</EMR08.01.01.016>
			<EMR08.01.01.017 code="HR01.01.002.03" name="标识号-生效日期">2013-02-01T12:29:00</EMR08.01.01.017>
			<EMR08.01.01.018 code="HR01.01.002.04" name="标识号-失效日期">2013-02-07T12:30:00</EMR08.01.01.018>
			<EMR08.01.01.019 code="HR01.01.002.05" name="标识号-提供标识的机构名称">石棉县人民医院</EMR08.01.01.019>
		</ZLG08.00.01.023>
		<ZLG08.00.01.023>
			<EMR08.01.01.015 code="HR01.01.002.01" name="标识号-类别代码">99</EMR08.01.01.015>
			<EMR08.01.01.016 code="HR01.01.002.02" name="标识号-号码">1</EMR08.01.01.016>
			<EMR08.01.01.017 code="HR01.01.002.03" name="标识号-生效日期">2013-02-01T12:29:00</EMR08.01.01.017>
			<EMR08.01.01.018 code="HR01.01.002.04" name="标识号-失效日期">2013-02-07T12:30:00</EMR08.01.01.018>
			<EMR08.01.01.019 code="HR01.01.002.05" name="标识号-提供标识的机构名称">石棉县人民医院</EMR08.01.01.019>
		</ZLG08.00.01.023>
		<ZLG08.00.01.023>
			<EMR08.01.01.015 code="HR01.01.002.01" name="标识号-类别代码">15</EMR08.01.01.015>
			<EMR08.01.01.016 code="HR01.01.002.02" name="标识号-号码">*82</EMR08.01.01.016>
			<EMR08.01.01.017 code="HR01.01.002.03" name="标识号-生效日期">2013-02-01T12:29:00</EMR08.01.01.017>
			<EMR08.01.01.018 code="HR01.01.002.04" name="标识号-失效日期">2013-02-07T12:30:00</EMR08.01.01.018>
			<EMR08.01.01.019 code="HR01.01.002.05" name="标识号-提供标识的机构名称">内二科</EMR08.01.01.019>
		</ZLG08.00.01.023>
		<ZLG08.00.01.023>
			<EMR08.01.01.015 code="HR01.01.002.01" name="标识号-类别代码">01</EMR08.01.01.015>
			<EMR08.01.01.016 code="HR01.01.002.02" name="标识号-号码">513435194412015042</EMR08.01.01.016>
			<EMR08.01.01.017 code="HR01.01.002.03" name="标识号-生效日期">1944-12-01T00:00:00</EMR08.01.01.017>
		</ZLG08.00.01.023>
	</ZLG08.00.01.002>
	<ZLG08.00.01.003>
		<EMR08.01.01.031 code="HR30.00.001" name="出生日期">1944-12-01</EMR08.01.01.031>
		<EMR08.01.01.032 code="HR30.00.005" name="出生地">四川</EMR08.01.01.032>
		<EMR08.01.01.033 code="HR02.02.001" name="性别代码">2</EMR08.01.01.033>
		<EMR08.01.01.034 code="HR02.03.001" name="年龄（岁）">68岁</EMR08.01.01.034>
		<EMR08.01.01.035 code="HR02.04.001" name="国籍代码">156</EMR08.01.01.035>
		<EMR08.01.01.036 code="HR02.05.001" name="民族代码">01</EMR08.01.01.036>
		<ZLG08.00.01.024>
			<EMR08.01.01.038 code="HR02.07.011.01" name="职业编码系统名称">GB/T6565-1999职业分类与代码</EMR08.01.01.038>
			<EMR08.01.01.039 code="HR02.07.011.02" name="职业代码">90</EMR08.01.01.039>
		</ZLG08.00.01.024>
		<EMR08.01.01.037 code="HR02.06.003" name="婚姻状况类别代码">20</EMR08.01.01.037>
		<EMR08.01.01.040 code="HR02.08.001" name="文化程度代码">99</EMR08.01.01.040>
	</ZLG08.00.01.003>
	<ZLG08.00.01.005>
		<EMR08.01.01.061 code="HR03.00.003" name="标识地址类别的代码">09</EMR08.01.01.061>
		<EMR08.01.01.062 code="HR03.00.004.01" name="地址-省（自治区、直辖市）">四川省</EMR08.01.01.062>
		<EMR08.01.01.063 code="HR03.00.004.02" name="地址-市（地区）"/>
		<EMR08.01.01.064 code="HR03.00.004.03" name="地址-县（区）"/>
		<EMR08.01.01.066 code="HR03.00.004.05" name="地址-村（街、路、弄等）">四川省甘洛县海棠镇正西村7组9号</EMR08.01.01.066>
	</ZLG08.00.01.005>
	<ZLG08.00.01.005>
		<EMR08.01.01.061 code="HR03.00.003" name="标识地址类别的代码">01</EMR08.01.01.061>
		<EMR08.01.01.062 code="HR03.00.004.01" name="地址-省（自治区、直辖市）">四川省</EMR08.01.01.062>
		<EMR08.01.01.063 code="HR03.00.004.02" name="地址-市（地区）"/>
		<EMR08.01.01.064 code="HR03.00.004.03" name="地址-县（区）"/>
		<EMR08.01.01.066 code="HR03.00.004.05" name="地址-村（街、路、弄等）">四川甘洛县</EMR08.01.01.066>
		<EMR08.01.01.068 code="HR03.00.005" name="邮政编码">0201</EMR08.01.01.068>
	</ZLG08.00.01.005>
	<ZLG08.00.01.005>
		<EMR08.01.01.061 code="HR03.00.003" name="标识地址类别的代码">98</EMR08.01.01.061>
		<EMR08.01.01.062 code="HR03.00.004.01" name="地址-省（自治区、直辖市）">四川省</EMR08.01.01.062>
		<EMR08.01.01.063 code="HR03.00.004.02" name="地址-市（地区）"/>
		<EMR08.01.01.064 code="HR03.00.004.03" name="地址-县（区）"/>
		<EMR08.01.01.066 code="HR03.00.004.05" name="地址-村（街、路、弄等）">四川甘洛县</EMR08.01.01.066>
	</ZLG08.00.01.005>
	<ZLG08.00.01.005>
		<EMR08.01.01.061 code="HR03.00.003" name="标识地址类别的代码">02</EMR08.01.01.061>
		<EMR08.01.01.062 code="HR03.00.004.01" name="地址-省（自治区、直辖市）">四川省</EMR08.01.01.062>
		<EMR08.01.01.063 code="HR03.00.004.02" name="地址-市（地区）"/>
		<EMR08.01.01.064 code="HR03.00.004.03" name="地址-县（区）"/>
		<EMR08.01.01.066 code="HR03.00.004.05" name="地址-村（街、路、弄等）">四川甘洛县</EMR08.01.01.066>
		<EMR08.01.01.068 code="HR03.00.005" name="邮政编码">0201</EMR08.01.01.068>
	</ZLG08.00.01.005>
	<ZLG08.00.01.006>
		<EMR08.01.01.081 code="HR04.00.001.01" name="联系电话-类别">家庭电话</EMR08.01.01.081>
		<EMR08.01.01.083 code="HR04.00.001.03" name="联系电话-号码">18383478875</EMR08.01.01.083>
		<EMR08.01.01.082 code="HR04.00.001.02" name="联系电话-类别代码">04</EMR08.01.01.082>
	</ZLG08.00.01.006>
	<ZLG08.00.01.007>
		<EMR08.01.01.092 code="HR02.09.001.02" name="医疗保险-类别代码"/>
		<EMR08.01.01.091 code="HR02.09.001.01" name="医疗保险-类别"/>
	</ZLG08.00.01.007>
	<ZLG08.00.01.009>
		<EMR08.01.01.101 code="HR21.01.100.01" name="机构名称">石棉县人民医院</EMR08.01.01.101>
		<EMR08.01.01.102 code="HR21.01.100.02" name="机构组织机构代码">56789-0</EMR08.01.01.102>
		<EMR08.01.01.103 code="HR21.01.100.03" name="机构负责人（法人）"/>
		<EMR08.01.01.104 code="HR21.01.100.04" name="机构地址">四川雅安石棉</EMR08.01.01.104>
		<ZLG08.00.01.025>
			<EMR08.01.01.107 code="HR21.01.100.07" name="机构角色代码">07</EMR08.01.01.107>
			<EMR08.01.01.106 code="HR21.01.100.06" name="机构角色">住院机构</EMR08.01.01.106>
		</ZLG08.00.01.025>
		<ZLG08.00.01.026>
			<EMR08.01.01.105 code="HR21.01.100.05" name="科室名称">内二科</EMR08.01.01.105>
			<ZLE08.00.01.002 code="ZL21.01.100.02" name="科室ID">SM0000011010212</ZLE08.00.01.002>
		</ZLG08.00.01.026>
	</ZLG08.00.01.009>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">孟定德</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">科主任</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">01</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务">副主任医师</EMR08.01.01.114>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">大学毕业</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级">副高级</EMR08.01.01.117>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务">科室主任</EMR08.01.01.118>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">250</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业">西医</EMR08.01.01.116>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">廖淑琼</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">质控护士</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">11</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务">主管护师</EMR08.01.01.114>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">不详</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级">中级</EMR08.01.01.117>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务"/>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">140</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业"/>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">钟旭升</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">质控医师</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">10</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务">主治医师</EMR08.01.01.114>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">大学毕业</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级">中级</EMR08.01.01.117>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务"/>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">142</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业">西医</EMR08.01.01.116>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">孟定德</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">主任医师</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">87</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务">副主任医师</EMR08.01.01.114>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">大学毕业</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级">副高级</EMR08.01.01.117>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务">科室主任</EMR08.01.01.118>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">250</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业">西医</EMR08.01.01.116>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">史秀珍</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">主治医师</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">03</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务">副主任医师</EMR08.01.01.114>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">大学毕业</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级">中级</EMR08.01.01.117>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务"/>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">144</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业">西医</EMR08.01.01.116>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">史秀珍</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">门诊医师</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">85</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务">副主任医师</EMR08.01.01.114>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">大学毕业</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级">中级</EMR08.01.01.117>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务"/>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">144</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业">西医</EMR08.01.01.116>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">李湲湲</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">责任护士</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">86</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务"/>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">不详</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级"/>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务"/>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">739</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业"/>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.010>
		<EMR08.01.01.111 code="HR22.01.100" name="服务者姓名">史秀珍</EMR08.01.01.111>
		<EMR08.01.01.112 code="HR22.01.101.01" name="服务者职责（角色）">住院医师</EMR08.01.01.112>
		<EMR08.01.01.113 code="HR22.01.101.02" name="服务者职责（角色）代码">05</EMR08.01.01.113>
		<EMR08.01.01.114 code="HR22.01.102" name="服务者专业技术职务">副主任医师</EMR08.01.01.114>
		<EMR08.01.01.115 code="HR22.01.103" name="服务者学历">大学毕业</EMR08.01.01.115>
		<EMR08.01.01.117 code="HR22.01.105" name="服务者专业技术职务等级">中级</EMR08.01.01.117>
		<ZLG08.00.01.028>
			<EMR08.01.01.118 code="HR22.01.106" name="服务者职务"/>
		</ZLG08.00.01.028>
		<ZLE08.00.01.003 code="ZL22.01.101" name="服务者ID">144</ZLE08.00.01.003>
		<ZLE08.00.01.011 code="HR52.01.009.02" name="手术/操作-代码"/>
		<ZLG08.00.01.027>
			<EMR08.01.01.116 code="HR22.01.104" name="服务者所学专业">西医</EMR08.01.01.116>
		</ZLG08.00.01.027>
	</ZLG08.00.01.010>
	<ZLG08.00.01.011>
		<EMR08.01.01.121 code="HR42.01.001" name="卫生事件(动作)名称">患者住院</EMR08.01.01.121>
		<EMR08.01.01.122 code="HR42.01.100" name="事件分类代码"/>
		<EMR08.01.01.123 code="HR42.02.200" name="事件开始时间">2013-02-01T12:29:00</EMR08.01.01.123>
		<EMR08.01.01.124 code="HR42.02.201" name="事件结束时间">2013-02-07T12:30:00</EMR08.01.01.124>
		<EMR08.01.01.125 code="HR42.03.100" name="事件发生地点">内二科</EMR08.01.01.125>
		<EMR08.01.01.126 code="HR42.03.101" name="事件发生场所">石棉县人民医院</EMR08.01.01.126>
		<EMR08.01.01.128 code="HR42.99.002" name="事件发生原因"/>
		<EMR08.01.01.129 code="HR42.99.003" name="事件结局"/>
		<ZLE08.00.01.004 code="ZL42.03.100" name="事件发生地点-ID">SM0000011010212</ZLE08.00.01.004>
		<ZLE08.00.01.005 code="ZL42.03.101" name="事件发生场所-ID">SM000001151182410A1001</ZLE08.00.01.005>
		<ZLG08.00.01.029>
			<EMR08.01.01.254 code="HR42.99.001" name="事件参与方">责任护士:李湲湲</EMR08.01.01.254>
		</ZLG08.00.01.029>
		<ZLG08.00.01.029>
			<EMR08.01.01.254 code="HR42.99.001" name="事件参与方">经治医师:史秀珍</EMR08.01.01.254>
		</ZLG08.00.01.029>
		<ZLG08.00.01.029>
			<EMR08.01.01.254 code="HR42.99.001" name="事件参与方">主治医师:史秀珍</EMR08.01.01.254>
		</ZLG08.00.01.029>
		<ZLG08.00.01.029>
			<EMR08.01.01.254 code="HR42.99.001" name="事件参与方">主任医师:</EMR08.01.01.254>
		</ZLG08.00.01.029>
	</ZLG08.00.01.011>
	<ZLG08.00.01.012>
		<EMR08.01.01.131 code="HR51.99.004.01" name="观察-类别">病案首页-检验</EMR08.01.01.131>
		<EMR08.01.01.132 code="HR51.99.004.02" name="观察-类别代码">3</EMR08.01.01.132>
		<ZLG08.00.01.030>
			<EMR08.01.01.133 code="HR51.99.004.03" name="观察项目名称">HBsAg</EMR08.01.01.133>
			<EMR08.01.01.134 code="HR51.99.004.04" name="观察-项目代码"/>
			<EMR08.01.01.135 code="HR51.99.004.05" name="观察-结果描述">未作</EMR08.01.01.135>
		</ZLG08.00.01.030>
		<ZLG08.00.01.030>
			<EMR08.01.01.133 code="HR51.99.004.03" name="观察项目名称">HCV-Ab</EMR08.01.01.133>
			<EMR08.01.01.134 code="HR51.99.004.04" name="观察-项目代码"/>
			<EMR08.01.01.135 code="HR51.99.004.05" name="观察-结果描述">未作</EMR08.01.01.135>
		</ZLG08.00.01.030>
		<ZLG08.00.01.030>
			<EMR08.01.01.133 code="HR51.99.004.03" name="观察项目名称">HIV-Ab</EMR08.01.01.133>
			<EMR08.01.01.134 code="HR51.99.004.04" name="观察-项目代码"/>
			<EMR08.01.01.135 code="HR51.99.004.05" name="观察-结果描述">未作</EMR08.01.01.135>
		</ZLG08.00.01.030>
	</ZLG08.00.01.012>
	<ZLG08.00.01.014>
		<EMR08.01.01.148 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR08.01.01.148>
		<EMR08.01.01.149 code="HR42.02.012" name="诊断日期">2013-02-16T11:37:48</EMR08.01.01.149>
		<EMR08.01.01.151 code="HR55.02.057.01" name="诊断类别">门诊诊断</EMR08.01.01.151>
		<EMR08.01.01.152 code="HR55.02.057.02" name="诊断类别代码">2</EMR08.01.01.152>
		<ZLE08.00.01.007 code="ZL55.02.057.01" name="诊断机构代码">56789-0</ZLE08.00.01.007>
		<ZLE08.00.01.008 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE08.00.01.009 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLG08.00.01.031>
			<EMR08.01.01.153 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">11</EMR08.01.01.153>
			<EMR08.01.01.154 code="HR55.02.057.04" name="疾病名称">慢性胃炎</EMR08.01.01.154>
			<EMR08.01.01.155 code="HR55.02.057.05" name="疾病代码">K29.502</EMR08.01.01.155>
			<EMR08.01.01.156 code="HR55.02.057.06" name="诊断依据"/>
			<EMR08.01.01.157 code="HR55.02.057.07" name="诊断依据代码"/>
			<ZLE08.00.01.013 code="HR55.01.043" name="住院患者治疗结果代码"/>
		</ZLG08.00.01.031>
	</ZLG08.00.01.014>
	<ZLG08.00.01.014>
		<EMR08.01.01.148 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR08.01.01.148>
		<EMR08.01.01.149 code="HR42.02.012" name="诊断日期">2013-02-16T11:37:48</EMR08.01.01.149>
		<EMR08.01.01.151 code="HR55.02.057.01" name="诊断类别">入院初步诊断</EMR08.01.01.151>
		<EMR08.01.01.152 code="HR55.02.057.02" name="诊断类别代码">3</EMR08.01.01.152>
		<ZLE08.00.01.007 code="ZL55.02.057.01" name="诊断机构代码">56789-0</ZLE08.00.01.007>
		<ZLE08.00.01.008 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE08.00.01.009 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLG08.00.01.031>
			<EMR08.01.01.153 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">11</EMR08.01.01.153>
			<EMR08.01.01.154 code="HR55.02.057.04" name="疾病名称">慢性胃炎</EMR08.01.01.154>
			<EMR08.01.01.155 code="HR55.02.057.05" name="疾病代码">K29.502</EMR08.01.01.155>
			<EMR08.01.01.156 code="HR55.02.057.06" name="诊断依据"/>
			<EMR08.01.01.157 code="HR55.02.057.07" name="诊断依据代码"/>
			<ZLE08.00.01.013 code="HR55.01.043" name="住院患者治疗结果代码"/>
		</ZLG08.00.01.031>
	</ZLG08.00.01.014>
	<ZLG08.00.01.014>
		<EMR08.01.01.148 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR08.01.01.148>
		<EMR08.01.01.149 code="HR42.02.012" name="诊断日期">2013-02-16T11:37:48</EMR08.01.01.149>
		<EMR08.01.01.151 code="HR55.02.057.01" name="诊断类别">入院初步诊断</EMR08.01.01.151>
		<EMR08.01.01.152 code="HR55.02.057.02" name="诊断类别代码">3</EMR08.01.01.152>
		<ZLE08.00.01.007 code="ZL55.02.057.01" name="诊断机构代码">56789-0</ZLE08.00.01.007>
		<ZLE08.00.01.008 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE08.00.01.009 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLG08.00.01.031>
			<EMR08.01.01.153 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">21</EMR08.01.01.153>
			<EMR08.01.01.154 code="HR55.02.057.04" name="疾病名称">慢性心肌缺血</EMR08.01.01.154>
			<EMR08.01.01.155 code="HR55.02.057.05" name="疾病代码">I25.551</EMR08.01.01.155>
			<EMR08.01.01.156 code="HR55.02.057.06" name="诊断依据"/>
			<EMR08.01.01.157 code="HR55.02.057.07" name="诊断依据代码"/>
			<ZLE08.00.01.013 code="HR55.01.043" name="住院患者治疗结果代码"/>
		</ZLG08.00.01.031>
	</ZLG08.00.01.014>
	<ZLG08.00.01.014>
		<EMR08.01.01.148 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR08.01.01.148>
		<EMR08.01.01.149 code="HR42.02.012" name="诊断日期">2013-02-16T11:37:48</EMR08.01.01.149>
		<EMR08.01.01.151 code="HR55.02.057.01" name="诊断类别">主要诊断</EMR08.01.01.151>
		<EMR08.01.01.152 code="HR55.02.057.02" name="诊断类别代码">12</EMR08.01.01.152>
		<ZLE08.00.01.007 code="ZL55.02.057.01" name="诊断机构代码">56789-0</ZLE08.00.01.007>
		<ZLE08.00.01.008 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE08.00.01.009 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLG08.00.01.031>
			<EMR08.01.01.153 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">11</EMR08.01.01.153>
			<EMR08.01.01.154 code="HR55.02.057.04" name="疾病名称">胃溃疡</EMR08.01.01.154>
			<EMR08.01.01.155 code="HR55.02.057.05" name="疾病代码">K25.903</EMR08.01.01.155>
			<EMR08.01.01.156 code="HR55.02.057.06" name="诊断依据"/>
			<EMR08.01.01.157 code="HR55.02.057.07" name="诊断依据代码"/>
			<ZLE08.00.01.013 code="HR55.01.043" name="住院患者治疗结果代码">02</ZLE08.00.01.013>
		</ZLG08.00.01.031>
	</ZLG08.00.01.014>
	<ZLG08.00.01.014>
		<EMR08.01.01.148 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR08.01.01.148>
		<EMR08.01.01.149 code="HR42.02.012" name="诊断日期">2013-02-16T11:37:48</EMR08.01.01.149>
		<EMR08.01.01.151 code="HR55.02.057.01" name="诊断类别">其他诊断</EMR08.01.01.151>
		<EMR08.01.01.152 code="HR55.02.057.02" name="诊断类别代码">13</EMR08.01.01.152>
		<ZLE08.00.01.007 code="ZL55.02.057.01" name="诊断机构代码">56789-0</ZLE08.00.01.007>
		<ZLE08.00.01.008 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE08.00.01.009 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLG08.00.01.031>
			<EMR08.01.01.153 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">21</EMR08.01.01.153>
			<EMR08.01.01.154 code="HR55.02.057.04" name="疾病名称">慢性胃炎</EMR08.01.01.154>
			<EMR08.01.01.155 code="HR55.02.057.05" name="疾病代码">K29.502</EMR08.01.01.155>
			<EMR08.01.01.156 code="HR55.02.057.06" name="诊断依据"/>
			<EMR08.01.01.157 code="HR55.02.057.07" name="诊断依据代码"/>
			<ZLE08.00.01.013 code="HR55.01.043" name="住院患者治疗结果代码">02</ZLE08.00.01.013>
		</ZLG08.00.01.031>
	</ZLG08.00.01.014>
	<ZLG08.00.01.014>
		<EMR08.01.01.148 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR08.01.01.148>
		<EMR08.01.01.149 code="HR42.02.012" name="诊断日期">2013-02-16T11:37:48</EMR08.01.01.149>
		<EMR08.01.01.151 code="HR55.02.057.01" name="诊断类别">其他诊断</EMR08.01.01.151>
		<EMR08.01.01.152 code="HR55.02.057.02" name="诊断类别代码">13</EMR08.01.01.152>
		<ZLE08.00.01.007 code="ZL55.02.057.01" name="诊断机构代码">56789-0</ZLE08.00.01.007>
		<ZLE08.00.01.008 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE08.00.01.009 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLG08.00.01.031>
			<EMR08.01.01.153 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">31</EMR08.01.01.153>
			<EMR08.01.01.154 code="HR55.02.057.04" name="疾病名称">慢性心肌缺血</EMR08.01.01.154>
			<EMR08.01.01.155 code="HR55.02.057.05" name="疾病代码">I25.551</EMR08.01.01.155>
			<EMR08.01.01.156 code="HR55.02.057.06" name="诊断依据"/>
			<EMR08.01.01.157 code="HR55.02.057.07" name="诊断依据代码"/>
			<ZLE08.00.01.013 code="HR55.01.043" name="住院患者治疗结果代码">02</ZLE08.00.01.013>
		</ZLG08.00.01.031>
	</ZLG08.00.01.014>
	<ZLG08.00.01.014>
		<EMR08.01.01.148 code="HR21.01.006" name="诊断机构名称">石棉县人民医院</EMR08.01.01.148>
		<EMR08.01.01.149 code="HR42.02.012" name="诊断日期">2013-02-16T11:37:48</EMR08.01.01.149>
		<EMR08.01.01.151 code="HR55.02.057.01" name="诊断类别">病理诊断</EMR08.01.01.151>
		<EMR08.01.01.152 code="HR55.02.057.02" name="诊断类别代码">9</EMR08.01.01.152>
		<ZLE08.00.01.007 code="ZL55.02.057.01" name="诊断机构代码">56789-0</ZLE08.00.01.007>
		<ZLE08.00.01.008 code="ZL55.02.057.02" name="诊断科室名称"/>
		<ZLE08.00.01.009 code="ZL55.02.057.03" name="诊断科室代码"/>
		<ZLG08.00.01.031>
			<EMR08.01.01.153 code="HR55.02.057.03" name="诊断顺位（从属关系）代码">11</EMR08.01.01.153>
			<EMR08.01.01.154 code="HR55.02.057.04" name="疾病名称">胃溃疡</EMR08.01.01.154>
			<EMR08.01.01.155 code="HR55.02.057.05" name="疾病代码">K25.903</EMR08.01.01.155>
			<EMR08.01.01.156 code="HR55.02.057.06" name="诊断依据"/>
			<EMR08.01.01.157 code="HR55.02.057.07" name="诊断依据代码"/>
			<ZLE08.00.01.013 code="HR55.01.043" name="住院患者治疗结果代码"/>
		</ZLG08.00.01.031>
	</ZLG08.00.01.014>
</EMR08.00.01>

';*/
      //$et = new api_his_index();
//      echo $et->ws_update('1',$xml_string);
     // echo $et->ws_select_single('1','513435194412015042','');
    // echo $et->ws_get_xml('1','DEA10174ADEE4F2F89267250496C2C6A');
      /*$xml_string1="<?xml version='1.0' encoding='UTF-8'?><where><org_id>511804201</org_id><identity_number>513101193301152525</identity_number><ext_uuid>8370E100-9220-42D9-8BB0-1AAD4DEBFE6A</ext_uuid></where>";
     echo $et->ws_select_single('1',$xml_string1);*/
	}
	public function ws_et_resultAction(){
		$soapclient = new SoapClient('http://'.$_SERVER['SERVER_NAME'].':'.$_SERVER['SERVER_PORT'].'/wsdl/api_his_index.wsdl');

	}
	/**
	 * 用于生成wsdl
	 *
	 */
	public function generate_wsdlAction(){
		$class_name='api_his_index';
		require_once(__SITEROOT."application/api/models/".$class_name.".php");
		require_once(__SITEROOT."library/custom/SoapDiscovery.class.php");
		$wsdl_object = new SoapDiscovery($class_name,$class_name,__BASEPATH."api/hisapi/ws_hisapi");
		$xml_file=$wsdl_object->getWSDL();
		$fp=fopen(__SITEROOT.'wsdl/'.$class_name.'.wsdl',"w+");
		fputs($fp,$xml_file);
		fclose($fp);
	}	
	
	
	public function test_whereAction()
	{
		$soapclient = new SoapClient(__SITEROOT.'wsdl/api_his_index.wsdl');
		//$token      = $soapclient->ws_login('511804201','1');
		$xml_string="<?xml version='1.0' encoding='UTF-8'?><where><org_id>511804201</org_id><identity_number>513101193301152525</identity_number><ext_uuid>5555</ext_uuid></where>";
		echo $soapclient->ws_select_single('1',$xml_string);
	}
	
}
?>