<?php
/**
电子病历基础模板：转院记录数据集EMR13.00电子病历基础模板：转院记录数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr13_00_01_001  文档标识-名称 
* @param string $emr13_00_01_002  文档标识-类别代码
* @param string $emr13_00_01_003  文档标识-管理机构名称
* @param string $emr13_00_01_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr13_00_01_005  文档标识-号码 
* @param date $emr13_00_01_006  文档标识-生效日期 
* @param date $emr13_00_01_007  文档标识-失效日期 
* @param string $emr13_00_01_011  标识号-类别代码 
* @param string $emr13_00_01_012  标识号-号码 
* @param date $emr13_00_01_013  标识号-生效日期 
* @param date $emr13_00_01_014  标识号-失效日期 
* @param string $emr13_00_01_015  标识号-提供标识的机构名称 
* @param string $emr13_00_01_016  姓名-标识对象*
* @param string $emr13_00_01_017  姓名-标识对象代码
* @param string $emr13_00_01_018  姓名* 
* @param string $emr13_00_01_021  性别代码 
* @param decimal $emr13_00_01_022  年龄（岁）*
* @param string $emr13_00_01_023  国籍代码 
* @param string $emr13_00_01_024  民族代码 
* @param string $emr13_00_01_025  婚姻状况类别代码
* @param string $emr13_00_01_026  职业编码系统名称 
* @param string $emr13_00_01_027  职业代码
* @param string $emr13_00_01_028  文化程度代码 
* @param date $emr13_00_01_029  出生日期* 
* @param string $emr13_00_01_030  出生地* 
* @param string $emr13_00_01_041  机构名称
* @param string $emr13_00_01_042  机构组织机构代码
* @param string $emr13_00_01_043  机构负责人（法人）
* @param string $emr13_00_01_044  机构地址
* @param string $emr13_00_01_045  科室名称
* @param string $emr13_00_01_046  机构角色
* @param string $emr13_00_01_047  机构角色代码
* @param string $emr13_00_01_051  服务者姓名*
* @param string $emr13_00_01_052  服务者职责（角色）*
* @param string $emr13_00_01_053  服务者职责（角色）代码
* @param string $emr13_00_01_054  服务者医师资格标志*
* @param string $emr13_00_01_055  服务者学历*
* @param string $emr13_00_01_056  服务者所学专业*
* @param string $emr13_00_01_057  服务者专业技术职称*
* @param string $emr13_00_01_058  服务者职务*
* @param string $emr13_00_01_061  诊断机构名称
* @param date $emr13_00_01_062  诊断日期
* @param string $emr13_00_01_063  诊断类别
* @param string $emr13_00_01_064  诊断类别代码
* @param string $emr13_00_01_065  诊断顺位（从属关系）代码
* @param string $emr13_00_01_066  疾病名称
* @param string $emr13_00_01_067  疾病代码
* @param string $emr13_00_01_068  诊断依据
* @param string $emr13_00_01_069  诊断依据代码
* @param string $emr13_00_01_071  诊疗过程名称
* @param string $emr13_00_01_072  诊疗过程描述
* @return boolean
*/
function update_emr13_00($ws_id,$org_id,$doctor_id,$identity_number,$emr13_00_01_001='',$emr13_00_01_002='',$emr13_00_01_003='',$emr13_00_01_004='',$emr13_00_01_005='',$emr13_00_01_006='',$emr13_00_01_007='',$emr13_00_01_011='',$emr13_00_01_012='',$emr13_00_01_013='',$emr13_00_01_014='',$emr13_00_01_015='',$emr13_00_01_016='',$emr13_00_01_017='',$emr13_00_01_018='',$emr13_00_01_021='',$emr13_00_01_022=0,$emr13_00_01_023='',$emr13_00_01_024='',$emr13_00_01_025='',$emr13_00_01_026='',$emr13_00_01_027='',$emr13_00_01_028='',$emr13_00_01_029='',$emr13_00_01_030='',$emr13_00_01_041='',$emr13_00_01_042='',$emr13_00_01_043='',$emr13_00_01_044='',$emr13_00_01_045='',$emr13_00_01_046='',$emr13_00_01_047='',$emr13_00_01_051='',$emr13_00_01_052='',$emr13_00_01_053='',$emr13_00_01_054='',$emr13_00_01_055='',$emr13_00_01_056='',$emr13_00_01_057='',$emr13_00_01_058='',$emr13_00_01_061='',$emr13_00_01_062='',$emr13_00_01_063='',$emr13_00_01_064='',$emr13_00_01_065='',$emr13_00_01_066='',$emr13_00_01_067='',$emr13_00_01_068='',$emr13_00_01_069='',$emr13_00_01_071='',$emr13_00_01_072=''){
require_once(__SITEROOT.'library/Models/ws_emr13_00.php');
$table_obj="Tws_emr13_00";
$ws_emr13_00=new $table_obj();
$ws_emr13_00 -> ws_id=$ws_id;
$ws_emr13_00 -> uuid=uniqid('',true);
$ws_emr13_00 -> created=time();
$ws_emr13_00 -> org_id=$org_id;
$ws_emr13_00 -> doctor_id=$doctor_id;
$ws_emr13_00 -> identity_number=$identity_number;//身份证号
$ws_emr13_00 -> action='insert';
$ws_emr13_00->emr13_00_01_001 = $emr13_00_01_001; //文档标识-名称  
$ws_emr13_00->emr13_00_01_002 = $emr13_00_01_002; //文档标识-类别代码 
$ws_emr13_00->emr13_00_01_003 = $emr13_00_01_003; //文档标识-管理机构名称 
$ws_emr13_00->emr13_00_01_004 = $emr13_00_01_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr13_00->emr13_00_01_005 = $emr13_00_01_005; //文档标识-号码  
$ws_emr13_00 ->emr13_00_01_006 = empty($emr13_00_01_006)?null : $ws_emr13_00 ->escape('emr13_00_01_006',to_date($emr13_00_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr13_00 ->emr13_00_01_007 = empty($emr13_00_01_007)?null : $ws_emr13_00 ->escape('emr13_00_01_007',to_date($emr13_00_01_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr13_00->emr13_00_01_011 = $emr13_00_01_011; //标识号-类别代码  
$ws_emr13_00->emr13_00_01_012 = $emr13_00_01_012; //标识号-号码  
$ws_emr13_00 ->emr13_00_01_013 = empty($emr13_00_01_013)?null : $ws_emr13_00 ->escape('emr13_00_01_013',to_date($emr13_00_01_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr13_00 ->emr13_00_01_014 = empty($emr13_00_01_014)?null : $ws_emr13_00 ->escape('emr13_00_01_014',to_date($emr13_00_01_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr13_00->emr13_00_01_015 = $emr13_00_01_015; //标识号-提供标识的机构名称  
$ws_emr13_00->emr13_00_01_016 = $emr13_00_01_016; //姓名-标识对象* 
$ws_emr13_00->emr13_00_01_017 = $emr13_00_01_017; //姓名-标识对象代码 
$ws_emr13_00->emr13_00_01_018 = $emr13_00_01_018; //姓名*  
$ws_emr13_00->emr13_00_01_021 = $emr13_00_01_021; //性别代码  
$ws_emr13_00->emr13_00_01_022 = $emr13_00_01_022; //年龄（岁）* 
$ws_emr13_00->emr13_00_01_023 = $emr13_00_01_023; //国籍代码  
$ws_emr13_00->emr13_00_01_024 = $emr13_00_01_024; //民族代码  
$ws_emr13_00->emr13_00_01_025 = $emr13_00_01_025; //婚姻状况类别代码 
$ws_emr13_00->emr13_00_01_026 = $emr13_00_01_026; //职业编码系统名称  
$ws_emr13_00->emr13_00_01_027 = $emr13_00_01_027; //职业代码 
$ws_emr13_00->emr13_00_01_028 = $emr13_00_01_028; //文化程度代码  
$ws_emr13_00 ->emr13_00_01_029 = empty($emr13_00_01_029)?null : $ws_emr13_00 ->escape('emr13_00_01_029',to_date($emr13_00_01_029,'YYYY-MM-DD')); //出生日期*  
$ws_emr13_00->emr13_00_01_030 = $emr13_00_01_030; //出生地*  
$ws_emr13_00->emr13_00_01_041 = $emr13_00_01_041; //机构名称 
$ws_emr13_00->emr13_00_01_042 = $emr13_00_01_042; //机构组织机构代码 
$ws_emr13_00->emr13_00_01_043 = $emr13_00_01_043; //机构负责人（法人） 
$ws_emr13_00->emr13_00_01_044 = $emr13_00_01_044; //机构地址 
$ws_emr13_00->emr13_00_01_045 = $emr13_00_01_045; //科室名称 
$ws_emr13_00->emr13_00_01_046 = $emr13_00_01_046; //机构角色 
$ws_emr13_00->emr13_00_01_047 = $emr13_00_01_047; //机构角色代码 
$ws_emr13_00->emr13_00_01_051 = $emr13_00_01_051; //服务者姓名* 
$ws_emr13_00->emr13_00_01_052 = $emr13_00_01_052; //服务者职责（角色）* 
$ws_emr13_00->emr13_00_01_053 = $emr13_00_01_053; //服务者职责（角色）代码 
$ws_emr13_00->emr13_00_01_054 = $emr13_00_01_054; //服务者医师资格标志* 
$ws_emr13_00->emr13_00_01_055 = $emr13_00_01_055; //服务者学历* 
$ws_emr13_00->emr13_00_01_056 = $emr13_00_01_056; //服务者所学专业* 
$ws_emr13_00->emr13_00_01_057 = $emr13_00_01_057; //服务者专业技术职称* 
$ws_emr13_00->emr13_00_01_058 = $emr13_00_01_058; //服务者职务* 
$ws_emr13_00->emr13_00_01_061 = $emr13_00_01_061; //诊断机构名称 
$ws_emr13_00 ->emr13_00_01_062 = empty($emr13_00_01_062)?null : $ws_emr13_00 ->escape('emr13_00_01_062',to_date($emr13_00_01_062,'YYYY-MM-DD')); //诊断日期 
$ws_emr13_00->emr13_00_01_063 = $emr13_00_01_063; //诊断类别 
$ws_emr13_00->emr13_00_01_064 = $emr13_00_01_064; //诊断类别代码 
$ws_emr13_00->emr13_00_01_065 = $emr13_00_01_065; //诊断顺位（从属关系）代码 
$ws_emr13_00->emr13_00_01_066 = $emr13_00_01_066; //疾病名称 
$ws_emr13_00->emr13_00_01_067 = $emr13_00_01_067; //疾病代码 
$ws_emr13_00->emr13_00_01_068 = $emr13_00_01_068; //诊断依据 
$ws_emr13_00->emr13_00_01_069 = $emr13_00_01_069; //诊断依据代码 
$ws_emr13_00->emr13_00_01_071 = $emr13_00_01_071; //诊疗过程名称 
$ws_emr13_00->emr13_00_01_072 = $emr13_00_01_072; //诊疗过程描述 
if($ws_emr13_00 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr13_00 ->free_statement();
}
