<?php
/**
电子病历基础模板：住院病程记录数据集（三）EMR10.03电子病历基础模板：住院病程记录数据集（三）
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr10_00_14_001  文档标识-名称 
* @param string $emr10_00_14_002  文档标识-类别代码
* @param string $emr10_00_14_003  文档标识-管理机构名称
* @param string $emr10_00_14_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr10_00_14_005  文档标识-号码 
* @param date $emr10_00_14_006  文档标识-生效日期 
* @param date $emr10_00_14_007  文档标识-失效日期 
* @param string $emr10_00_14_011  标识号-类别代码 
* @param string $emr10_00_14_012  标识号-号码 
* @param date $emr10_00_14_013  标识号-生效日期 
* @param date $emr10_00_14_014  标识号-失效日期 
* @param string $emr10_00_14_015  标识号-提供标识的机构名称 
* @param string $emr10_00_14_016  姓名-标识对象*
* @param string $emr10_00_14_017  姓名-标识对象代码
* @param string $emr10_00_14_018  姓名*
* @param string $emr10_00_14_021  性别代码 
* @param decimal $emr10_00_14_022  年龄（岁）*
* @param string $emr10_00_14_023  国籍代码 
* @param string $emr10_00_14_024  民族代码 
* @param string $emr10_00_14_025  婚姻状况类别代码
* @param string $emr10_00_14_026  职业编码系统名称 
* @param string $emr10_00_14_027  职业代码
* @param string $emr10_00_14_028  文化程度代码 
* @param date $emr10_00_14_029  出生日期*
* @param string $emr10_00_14_030  出生地*
* @param string $emr10_00_14_041  机构名称
* @param string $emr10_00_14_042  机构组织机构代码
* @param string $emr10_00_14_043  机构负责人（法人）
* @param string $emr10_00_14_044  机构地址
* @param string $emr10_00_14_045  科室名称
* @param string $emr10_00_14_046  机构角色
* @param string $emr10_00_14_047  机构角色代码
* @param string $emr10_00_14_051  服务者姓名*
* @param string $emr10_00_14_052  服务者职责（角色）*
* @param string $emr10_00_14_053  服务者职责（角色）代码
* @param string $emr10_00_14_054  服务者医师资格标志*
* @param string $emr10_00_14_055  服务者学历*
* @param string $emr10_00_14_056  服务者所学专业*
* @param string $emr10_00_14_057  服务者专业技术职称*
* @param string $emr10_00_14_058  服务者职务*
* @param string $emr10_00_14_061  卫生事件(动作)名称
* @param string $emr10_00_14_062  事件分类代码
* @param date $emr10_00_14_063  事件开始时间
* @param date $emr10_00_14_064  事件结束时间
* @param string $emr10_00_14_065  事件发生地点
* @param string $emr10_00_14_066  事件发生场所
* @param string $emr10_00_14_067  事件参与方
* @param string $emr10_00_14_068  事件发生原因
* @param string $emr10_00_14_069  事件结局
* @param string $emr10_00_14_070  观察-类别
* @param string $emr10_00_14_071  观察-类别代码
* @param string $emr10_00_14_072  观察项目名称
* @param string $emr10_00_14_073  观察-项目代码
* @param string $emr10_00_14_074  观察-结果描述
* @param decimal $emr10_00_14_075  观察-结果(数值)
* @param string $emr10_00_14_076  观察-计量单位
* @param string $emr10_00_14_077  观察-结果代码
* @param string $emr10_00_14_081  诊断机构名称
* @param date $emr10_00_14_082  诊断日期
* @param string $emr10_00_14_083  诊断类别
* @param string $emr10_00_14_084  诊断类别代码
* @param string $emr10_00_14_085  诊断顺位（从属关系）代码
* @param string $emr10_00_14_086  疾病名称
* @param string $emr10_00_14_087  疾病代码
* @param string $emr10_00_14_088  诊断依据
* @param string $emr10_00_14_089  诊断依据代码
* @param string $emr10_00_14_091  患者知情同意类目名称
* @param string $emr10_00_14_092  患者知情同意记录结果
* @param string $emr10_00_14_101  诊疗过程名称
* @param string $emr10_00_14_102  诊疗过程描述
* @return boolean
*/
function update_emr10_03($ws_id,$org_id,$doctor_id,$identity_number,$emr10_00_14_001='',$emr10_00_14_002='',$emr10_00_14_003='',$emr10_00_14_004='',$emr10_00_14_005='',$emr10_00_14_006='',$emr10_00_14_007='',$emr10_00_14_011='',$emr10_00_14_012='',$emr10_00_14_013='',$emr10_00_14_014='',$emr10_00_14_015='',$emr10_00_14_016='',$emr10_00_14_017='',$emr10_00_14_018='',$emr10_00_14_021='',$emr10_00_14_022=0,$emr10_00_14_023='',$emr10_00_14_024='',$emr10_00_14_025='',$emr10_00_14_026='',$emr10_00_14_027='',$emr10_00_14_028='',$emr10_00_14_029='',$emr10_00_14_030='',$emr10_00_14_041='',$emr10_00_14_042='',$emr10_00_14_043='',$emr10_00_14_044='',$emr10_00_14_045='',$emr10_00_14_046='',$emr10_00_14_047='',$emr10_00_14_051='',$emr10_00_14_052='',$emr10_00_14_053='',$emr10_00_14_054='',$emr10_00_14_055='',$emr10_00_14_056='',$emr10_00_14_057='',$emr10_00_14_058='',$emr10_00_14_061='',$emr10_00_14_062='',$emr10_00_14_063='',$emr10_00_14_064='',$emr10_00_14_065='',$emr10_00_14_066='',$emr10_00_14_067='',$emr10_00_14_068='',$emr10_00_14_069='',$emr10_00_14_070='',$emr10_00_14_071='',$emr10_00_14_072='',$emr10_00_14_073='',$emr10_00_14_074='',$emr10_00_14_075=0,$emr10_00_14_076='',$emr10_00_14_077='',$emr10_00_14_081='',$emr10_00_14_082='',$emr10_00_14_083='',$emr10_00_14_084='',$emr10_00_14_085='',$emr10_00_14_086='',$emr10_00_14_087='',$emr10_00_14_088='',$emr10_00_14_089='',$emr10_00_14_091='',$emr10_00_14_092='',$emr10_00_14_101='',$emr10_00_14_102=''){
require_once(__SITEROOT.'library/Models/ws_emr10_03.php');
$table_obj="Tws_emr10_03";
$ws_emr10_03=new $table_obj();
$ws_emr10_03 -> ws_id=$ws_id;
$ws_emr10_03 -> uuid=uniqid('',true);
$ws_emr10_03 -> created=time();
$ws_emr10_03 -> org_id=$org_id;
$ws_emr10_03 -> doctor_id=$doctor_id;
$ws_emr10_03 -> identity_number=$identity_number;//身份证号
$ws_emr10_03 -> action='insert';
$ws_emr10_03->emr10_00_14_001 = $emr10_00_14_001; //文档标识-名称  
$ws_emr10_03->emr10_00_14_002 = $emr10_00_14_002; //文档标识-类别代码 
$ws_emr10_03->emr10_00_14_003 = $emr10_00_14_003; //文档标识-管理机构名称 
$ws_emr10_03->emr10_00_14_004 = $emr10_00_14_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr10_03->emr10_00_14_005 = $emr10_00_14_005; //文档标识-号码  
$ws_emr10_03 ->emr10_00_14_006 = empty($emr10_00_14_006)?null : $ws_emr10_03 ->escape('emr10_00_14_006',to_date($emr10_00_14_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr10_03 ->emr10_00_14_007 = empty($emr10_00_14_007)?null : $ws_emr10_03 ->escape('emr10_00_14_007',to_date($emr10_00_14_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr10_03->emr10_00_14_011 = $emr10_00_14_011; //标识号-类别代码  
$ws_emr10_03->emr10_00_14_012 = $emr10_00_14_012; //标识号-号码  
$ws_emr10_03 ->emr10_00_14_013 = empty($emr10_00_14_013)?null : $ws_emr10_03 ->escape('emr10_00_14_013',to_date($emr10_00_14_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr10_03 ->emr10_00_14_014 = empty($emr10_00_14_014)?null : $ws_emr10_03 ->escape('emr10_00_14_014',to_date($emr10_00_14_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr10_03->emr10_00_14_015 = $emr10_00_14_015; //标识号-提供标识的机构名称  
$ws_emr10_03->emr10_00_14_016 = $emr10_00_14_016; //姓名-标识对象* 
$ws_emr10_03->emr10_00_14_017 = $emr10_00_14_017; //姓名-标识对象代码 
$ws_emr10_03->emr10_00_14_018 = $emr10_00_14_018; //姓名* 
$ws_emr10_03->emr10_00_14_021 = $emr10_00_14_021; //性别代码  
$ws_emr10_03->emr10_00_14_022 = $emr10_00_14_022; //年龄（岁）* 
$ws_emr10_03->emr10_00_14_023 = $emr10_00_14_023; //国籍代码  
$ws_emr10_03->emr10_00_14_024 = $emr10_00_14_024; //民族代码  
$ws_emr10_03->emr10_00_14_025 = $emr10_00_14_025; //婚姻状况类别代码 
$ws_emr10_03->emr10_00_14_026 = $emr10_00_14_026; //职业编码系统名称  
$ws_emr10_03->emr10_00_14_027 = $emr10_00_14_027; //职业代码 
$ws_emr10_03->emr10_00_14_028 = $emr10_00_14_028; //文化程度代码  
$ws_emr10_03 ->emr10_00_14_029 = empty($emr10_00_14_029)?null : $ws_emr10_03 ->escape('emr10_00_14_029',to_date($emr10_00_14_029,'YYYY-MM-DD')); //出生日期* 
$ws_emr10_03->emr10_00_14_030 = $emr10_00_14_030; //出生地* 
$ws_emr10_03->emr10_00_14_041 = $emr10_00_14_041; //机构名称 
$ws_emr10_03->emr10_00_14_042 = $emr10_00_14_042; //机构组织机构代码 
$ws_emr10_03->emr10_00_14_043 = $emr10_00_14_043; //机构负责人（法人） 
$ws_emr10_03->emr10_00_14_044 = $emr10_00_14_044; //机构地址 
$ws_emr10_03->emr10_00_14_045 = $emr10_00_14_045; //科室名称 
$ws_emr10_03->emr10_00_14_046 = $emr10_00_14_046; //机构角色 
$ws_emr10_03->emr10_00_14_047 = $emr10_00_14_047; //机构角色代码 
$ws_emr10_03->emr10_00_14_051 = $emr10_00_14_051; //服务者姓名* 
$ws_emr10_03->emr10_00_14_052 = $emr10_00_14_052; //服务者职责（角色）* 
$ws_emr10_03->emr10_00_14_053 = $emr10_00_14_053; //服务者职责（角色）代码 
$ws_emr10_03->emr10_00_14_054 = $emr10_00_14_054; //服务者医师资格标志* 
$ws_emr10_03->emr10_00_14_055 = $emr10_00_14_055; //服务者学历* 
$ws_emr10_03->emr10_00_14_056 = $emr10_00_14_056; //服务者所学专业* 
$ws_emr10_03->emr10_00_14_057 = $emr10_00_14_057; //服务者专业技术职称* 
$ws_emr10_03->emr10_00_14_058 = $emr10_00_14_058; //服务者职务* 
$ws_emr10_03->emr10_00_14_061 = $emr10_00_14_061; //卫生事件(动作)名称 
$ws_emr10_03->emr10_00_14_062 = $emr10_00_14_062; //事件分类代码 
$ws_emr10_03 ->emr10_00_14_063 = empty($emr10_00_14_063)?null : $ws_emr10_03 ->escape('emr10_00_14_063',to_date($emr10_00_14_063,'YYYY-MM-DD')); //事件开始时间 
$ws_emr10_03 ->emr10_00_14_064 = empty($emr10_00_14_064)?null : $ws_emr10_03 ->escape('emr10_00_14_064',to_date($emr10_00_14_064,'YYYY-MM-DD')); //事件结束时间 
$ws_emr10_03->emr10_00_14_065 = $emr10_00_14_065; //事件发生地点 
$ws_emr10_03->emr10_00_14_066 = $emr10_00_14_066; //事件发生场所 
$ws_emr10_03->emr10_00_14_067 = $emr10_00_14_067; //事件参与方 
$ws_emr10_03->emr10_00_14_068 = $emr10_00_14_068; //事件发生原因 
$ws_emr10_03->emr10_00_14_069 = $emr10_00_14_069; //事件结局 
$ws_emr10_03->emr10_00_14_070 = $emr10_00_14_070; //观察-类别 
$ws_emr10_03->emr10_00_14_071 = $emr10_00_14_071; //观察-类别代码 
$ws_emr10_03->emr10_00_14_072 = $emr10_00_14_072; //观察项目名称 
$ws_emr10_03->emr10_00_14_073 = $emr10_00_14_073; //观察-项目代码 
$ws_emr10_03->emr10_00_14_074 = $emr10_00_14_074; //观察-结果描述 
$ws_emr10_03->emr10_00_14_075 = $emr10_00_14_075; //观察-结果(数值) 
$ws_emr10_03->emr10_00_14_076 = $emr10_00_14_076; //观察-计量单位 
$ws_emr10_03->emr10_00_14_077 = $emr10_00_14_077; //观察-结果代码 
$ws_emr10_03->emr10_00_14_081 = $emr10_00_14_081; //诊断机构名称 
$ws_emr10_03 ->emr10_00_14_082 = empty($emr10_00_14_082)?null : $ws_emr10_03 ->escape('emr10_00_14_082',to_date($emr10_00_14_082,'YYYY-MM-DD')); //诊断日期 
$ws_emr10_03->emr10_00_14_083 = $emr10_00_14_083; //诊断类别 
$ws_emr10_03->emr10_00_14_084 = $emr10_00_14_084; //诊断类别代码 
$ws_emr10_03->emr10_00_14_085 = $emr10_00_14_085; //诊断顺位（从属关系）代码 
$ws_emr10_03->emr10_00_14_086 = $emr10_00_14_086; //疾病名称 
$ws_emr10_03->emr10_00_14_087 = $emr10_00_14_087; //疾病代码 
$ws_emr10_03->emr10_00_14_088 = $emr10_00_14_088; //诊断依据 
$ws_emr10_03->emr10_00_14_089 = $emr10_00_14_089; //诊断依据代码 
$ws_emr10_03->emr10_00_14_091 = $emr10_00_14_091; //患者知情同意类目名称 
$ws_emr10_03->emr10_00_14_092 = $emr10_00_14_092; //患者知情同意记录结果 
$ws_emr10_03->emr10_00_14_101 = $emr10_00_14_101; //诊疗过程名称 
$ws_emr10_03->emr10_00_14_102 = $emr10_00_14_102; //诊疗过程描述 
if($ws_emr10_03 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr10_03 ->free_statement();
}
