<?php
/**
电子病历基础模板：门(急)诊病历数据集EMR02.00电子病历基础模板：门(急)诊病历数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr02_00_01_001  文档标识-名称 
* @param string $emr02_00_01_002  文档标识-类别代码
* @param string $emr02_00_01_003  文档标识-管理机构名称
* @param string $emr02_00_01_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr02_00_01_005  文档标识-号码 
* @param date $emr02_00_01_006  文档标识-生效日期 
* @param date $emr02_00_01_007  文档标识-失效日期 
* @param string $emr02_00_01_011  标识号-类别代码 
* @param string $emr02_00_01_012  标识号-号码* 
* @param date $emr02_00_01_013  标识号-生效日期 
* @param date $emr02_00_01_014  标识号-失效日期 
* @param string $emr02_00_01_015  标识号-提供标识的机构名称 
* @param string $emr02_00_01_016  姓名-标识对象
* @param string $emr02_00_01_017  姓名-标识对象代码
* @param string $emr02_00_01_018  姓名* 
* @param string $emr02_00_01_021  性别代码 
* @param decimal $emr02_00_01_022  年龄（岁）*
* @param string $emr02_00_01_023  国籍代码 
* @param string $emr02_00_01_024  民族代码 
* @param string $emr02_00_01_025  婚姻状况类别代码
* @param string $emr02_00_01_026  职业编码系统名称 
* @param string $emr02_00_01_027  职业代码
* @param string $emr02_00_01_028  文化程度代码 
* @param date $emr02_00_01_029  出生日期* 
* @param string $emr02_00_01_030  出生地* 
* @param string $emr02_00_01_041  工作单位名称* 
* @param string $emr02_00_01_042  标识地址类别的代码 
* @param string $emr02_00_01_043  地址-省（自治区、直辖市）*
* @param string $emr02_00_01_044  地址-市（地区）*
* @param string $emr02_00_01_045  地址-县（区）*
* @param string $emr02_00_01_046  地址-乡（镇、街道办事处）*
* @param string $emr02_00_01_047  地址-村（街、路、弄等）*
* @param string $emr02_00_01_048  地址-门牌号码*
* @param string $emr02_00_01_049  邮政编码* 
* @param string $emr02_00_01_050  行政区划代码* 
* @param string $emr02_00_01_061  联系电话-类别*
* @param string $emr02_00_01_062  联系电话-类别代码*
* @param string $emr02_00_01_063  联系电话-号码*
* @param string $emr02_00_01_064  电子邮件地址*
* @param string $emr02_00_01_071  机构名称
* @param string $emr02_00_01_072  机构组织机构代码
* @param string $emr02_00_01_073  机构负责人（法人）
* @param string $emr02_00_01_074  机构地址
* @param string $emr02_00_01_075  科室名称
* @param string $emr02_00_01_076  机构角色
* @param string $emr02_00_01_077  机构角色代码
* @param string $emr02_00_01_361  服务者姓名*
* @param string $emr02_00_01_362  服务者职责（角色）*
* @param string $emr02_00_01_363  服务者职责（角色）代码
* @param string $emr02_00_01_364  服务者医师资格标志*
* @param string $emr02_00_01_365  服务者学历*
* @param string $emr02_00_01_366  服务者所学专业*
* @param string $emr02_00_01_367  服务者专业技术职称*
* @param string $emr02_00_01_368  服务者职务*
* @param string $emr02_00_01_371  卫生事件(动作)名称
* @param string $emr02_00_01_372  事件分类代码
* @param string $emr02_00_01_373  事件开始时间
* @param string $emr02_00_01_374  事件结束时间
* @param date $emr02_00_01_375  事件发生地点
* @param date $emr02_00_01_376  事件发生场所
* @param string $emr02_00_01_377  事件参与方
* @param string $emr02_00_01_378  事件发生原因
* @param string $emr02_00_01_379  事件结局
* @param string $emr02_00_01_081  主诉
* @param string $emr02_00_01_082  症状代码编码体系名称
* @param string $emr02_00_01_083  症状代码
* @param dateTime $emr02_00_01_084  症状开始日期时间
* @param dateTime $emr02_00_01_085  症状停止日期时间
* @param string $emr02_00_01_086  症状观察项目类目名称
* @param string $emr02_00_01_087  症状观察结果
* @param string $emr02_00_01_091  观察-类别
* @param string $emr02_00_01_092  观察-类别代码
* @param string $emr02_00_01_093  观察项目名称
* @param string $emr02_00_01_094  观察-项目代码
* @param string $emr02_00_01_095  观察-结果描述
* @param decimal $emr02_00_01_096  观察-结果(数值)
* @param string $emr02_00_01_097  观察-计量单位
* @param string $emr02_00_01_098  观察-结果代码
* @param string $emr02_00_01_099  体格检查项目类目名称
* @param string $emr02_00_01_100  体格检查观察结果
* @param dateTime $emr02_00_01_201  起病时间
* @param string $emr02_00_01_202  起病情况描述
* @param string $emr02_00_01_203  症状开始原因/诱因
* @param string $emr02_00_01_204  症状特点
* @param string $emr02_00_01_205  伴随症状
* @param string $emr02_00_01_206  本疾病既往诊疗经过
* @param string $emr02_00_01_207  起病后一般情况
* @param string $emr02_00_01_208  基础疾病诊疗情况
* @param string $emr02_00_01_211  既往观察-项目名称
* @param string $emr02_00_01_212  既往观察-项目分类代码
* @param string $emr02_00_01_213  既往观察-项目代码名称
* @param string $emr02_00_01_214  既往观察-项目代码
* @param string $emr02_00_01_215  既往观察-方法代码
* @param string $emr02_00_01_216  既往观察-结果
* @param string $emr02_00_01_217  既往史观察项目类目名称
* @param string $emr02_00_01_218  既往史观察结果
* @param string $emr02_00_01_221  过敏史
* @param string $emr02_00_01_222  过敏原
* @param string $emr02_00_01_223  过敏症状
* @param string $emr02_00_01_224  过敏症状代码
* @param string $emr02_00_01_225  过敏原代码
* @param string $emr02_00_01_226  过敏药物名称
* @param string $emr02_00_01_227  过敏病情状态代码
* @param string $emr02_00_01_228  过敏严重性代码
* @param string $emr02_00_01_229  过敏史标识代码
* @param string $emr02_00_01_231  检查申请单—机构（科室）
* @param string $emr02_00_01_232  检查申请单—编号
* @param string $emr02_00_01_233  检查申请检查原因
* @param date $emr02_00_01_234  检查申请日期
* @param string $emr02_00_01_241  检查报告单—机构（科室）
* @param string $emr02_00_01_242  检查报告单—编号
* @param string $emr02_00_01_243  检查报告结果-客观所见
* @param string $emr02_00_01_244  检查报告结果-主观提示
* @param date $emr02_00_01_245  检查日期
* @param date $emr02_00_01_246  检查报告日期
* @param string $emr02_00_01_251  影像检查报告单—机构（科室）
* @param string $emr02_00_01_252  影像检查报告单—编号
* @param string $emr02_00_01_253  影像检查报告结果-客观所见
* @param string $emr02_00_01_254  影像检查报告结果-主观提示
* @param string $emr02_00_01_255  影像号—机构（科室）
* @param string $emr02_00_01_256  影像号—编号类型
* @param string $emr02_00_01_257  影像号—编号
* @param date $emr02_00_01_258  影像检查报告日期
* @param date $emr02_00_01_259  影像检查日期
* @param string $emr02_00_01_261  观察-类别
* @param string $emr02_00_01_262  观察-类别代码
* @param string $emr02_00_01_263  观察项目名称
* @param string $emr02_00_01_264  观察-项目代码
* @param string $emr02_00_01_265  观察-结果描述
* @param decimal $emr02_00_01_266  观察-结果(数值)
* @param string $emr02_00_01_267  观察-计量单位
* @param string $emr02_00_01_268  观察-结果代码
* @param string $emr02_00_01_269  检查部位
* @param string $emr02_00_01_270  检查部位代码
* @param string $emr02_00_01_281  检验申请单—机构（科室）
* @param string $emr02_00_01_282  检验申请单—编号
* @param string $emr02_00_01_283  检验申请检验原因
* @param date $emr02_00_01_284  检验申请日期
* @param string $emr02_00_01_291  检验报告单—机构（科室）
* @param string $emr02_00_01_292  检验报告单—编号
* @param string $emr02_00_01_293  检验报告结果-客观所见
* @param string $emr02_00_01_294  检验报告结果-主观提示
* @param date $emr02_00_01_295  检验日期
* @param date $emr02_00_01_296  检验报告日期
* @param string $emr02_00_01_301  标本类别代码
* @param string $emr02_00_01_302  标本号-机构（科室）
* @param string $emr02_00_01_303  标本号-号码
* @param string $emr02_00_01_304  标本标本状态代码
* @param string $emr02_00_01_305  标本固定液
* @param date $emr02_00_01_306  标本采样时间
* @param string $emr02_00_01_311  观察-类别
* @param string $emr02_00_01_312  观察-类别代码
* @param string $emr02_00_01_313  观察项目名称
* @param string $emr02_00_01_314  观察-项目代码
* @param string $emr02_00_01_315  观察-结果描述
* @param decimal $emr02_00_01_316  观察-结果(数值)
* @param string $emr02_00_01_317  观察-计量单位
* @param string $emr02_00_01_318  观察-结果代码
* @param string $emr02_00_01_321  诊断机构名称
* @param date $emr02_00_01_322  诊断日期
* @param string $emr02_00_01_323  诊断类别
* @param string $emr02_00_01_324  诊断类别代码
* @param string $emr02_00_01_325  诊断顺位（从属关系）代码
* @param string $emr02_00_01_326  疾病名称
* @param string $emr02_00_01_327  疾病代码
* @param string $emr02_00_01_328  诊断依据
* @param string $emr02_00_01_329  诊断依据代码
* @param string $emr02_00_01_331  拟做的检查
* @param string $emr02_00_01_332  拟做的医学检验
* @param string $emr02_00_01_333  今后治疗方案
* @param string $emr02_00_01_341  诊疗过程名称
* @param string $emr02_00_01_342  诊疗过程描述
* @param dateTime $emr02_00_01_351  医嘱开嘱日期时间
* @param dateTime $emr02_00_01_352  长期医嘱停嘱日期时间
* @param dateTime $emr02_00_01_353  医嘱执行日期时间
* @param string $emr02_00_01_354  医嘱执行时间类别代码
* @param dateTime $emr02_00_01_355  医嘱取消日期时间
* @param string $emr02_00_01_356  医嘱类别
* @param string $emr02_00_01_357  医嘱内容
* @return boolean
*/
function update_emr02_00($ws_id,$org_id,$doctor_id,$identity_number,$emr02_00_01_001='',$emr02_00_01_002='',$emr02_00_01_003='',$emr02_00_01_004='',$emr02_00_01_005='',$emr02_00_01_006='',$emr02_00_01_007='',$emr02_00_01_011='',$emr02_00_01_012='',$emr02_00_01_013='',$emr02_00_01_014='',$emr02_00_01_015='',$emr02_00_01_016='',$emr02_00_01_017='',$emr02_00_01_018='',$emr02_00_01_021='',$emr02_00_01_022=0,$emr02_00_01_023='',$emr02_00_01_024='',$emr02_00_01_025='',$emr02_00_01_026='',$emr02_00_01_027='',$emr02_00_01_028='',$emr02_00_01_029='',$emr02_00_01_030='',$emr02_00_01_041='',$emr02_00_01_042='',$emr02_00_01_043='',$emr02_00_01_044='',$emr02_00_01_045='',$emr02_00_01_046='',$emr02_00_01_047='',$emr02_00_01_048='',$emr02_00_01_049='',$emr02_00_01_050='',$emr02_00_01_061='',$emr02_00_01_062='',$emr02_00_01_063='',$emr02_00_01_064='',$emr02_00_01_071='',$emr02_00_01_072='',$emr02_00_01_073='',$emr02_00_01_074='',$emr02_00_01_075='',$emr02_00_01_076='',$emr02_00_01_077='',$emr02_00_01_361='',$emr02_00_01_362='',$emr02_00_01_363='',$emr02_00_01_364='',$emr02_00_01_365='',$emr02_00_01_366='',$emr02_00_01_367='',$emr02_00_01_368='',$emr02_00_01_371='',$emr02_00_01_372='',$emr02_00_01_373='',$emr02_00_01_374='',$emr02_00_01_375='',$emr02_00_01_376='',$emr02_00_01_377='',$emr02_00_01_378='',$emr02_00_01_379='',$emr02_00_01_081='',$emr02_00_01_082='',$emr02_00_01_083='',$emr02_00_01_084='',$emr02_00_01_085='',$emr02_00_01_086='',$emr02_00_01_087='',$emr02_00_01_091='',$emr02_00_01_092='',$emr02_00_01_093='',$emr02_00_01_094='',$emr02_00_01_095='',$emr02_00_01_096=0,$emr02_00_01_097='',$emr02_00_01_098='',$emr02_00_01_099='',$emr02_00_01_100='',$emr02_00_01_201='',$emr02_00_01_202='',$emr02_00_01_203='',$emr02_00_01_204='',$emr02_00_01_205='',$emr02_00_01_206='',$emr02_00_01_207='',$emr02_00_01_208='',$emr02_00_01_211='',$emr02_00_01_212='',$emr02_00_01_213='',$emr02_00_01_214='',$emr02_00_01_215='',$emr02_00_01_216='',$emr02_00_01_217='',$emr02_00_01_218='',$emr02_00_01_221='',$emr02_00_01_222='',$emr02_00_01_223='',$emr02_00_01_224='',$emr02_00_01_225='',$emr02_00_01_226='',$emr02_00_01_227='',$emr02_00_01_228='',$emr02_00_01_229='',$emr02_00_01_231='',$emr02_00_01_232='',$emr02_00_01_233='',$emr02_00_01_234='',$emr02_00_01_241='',$emr02_00_01_242='',$emr02_00_01_243='',$emr02_00_01_244='',$emr02_00_01_245='',$emr02_00_01_246='',$emr02_00_01_251='',$emr02_00_01_252='',$emr02_00_01_253='',$emr02_00_01_254='',$emr02_00_01_255='',$emr02_00_01_256='',$emr02_00_01_257='',$emr02_00_01_258='',$emr02_00_01_259='',$emr02_00_01_261='',$emr02_00_01_262='',$emr02_00_01_263='',$emr02_00_01_264='',$emr02_00_01_265='',$emr02_00_01_266=0,$emr02_00_01_267='',$emr02_00_01_268='',$emr02_00_01_269='',$emr02_00_01_270='',$emr02_00_01_281='',$emr02_00_01_282='',$emr02_00_01_283='',$emr02_00_01_284='',$emr02_00_01_291='',$emr02_00_01_292='',$emr02_00_01_293='',$emr02_00_01_294='',$emr02_00_01_295='',$emr02_00_01_296='',$emr02_00_01_301='',$emr02_00_01_302='',$emr02_00_01_303='',$emr02_00_01_304='',$emr02_00_01_305='',$emr02_00_01_306='',$emr02_00_01_311='',$emr02_00_01_312='',$emr02_00_01_313='',$emr02_00_01_314='',$emr02_00_01_315='',$emr02_00_01_316=0,$emr02_00_01_317='',$emr02_00_01_318='',$emr02_00_01_321='',$emr02_00_01_322='',$emr02_00_01_323='',$emr02_00_01_324='',$emr02_00_01_325='',$emr02_00_01_326='',$emr02_00_01_327='',$emr02_00_01_328='',$emr02_00_01_329='',$emr02_00_01_331='',$emr02_00_01_332='',$emr02_00_01_333='',$emr02_00_01_341='',$emr02_00_01_342='',$emr02_00_01_351='',$emr02_00_01_352='',$emr02_00_01_353='',$emr02_00_01_354='',$emr02_00_01_355='',$emr02_00_01_356='',$emr02_00_01_357=''){
require_once(__SITEROOT.'library/Models/ws_emr02_00.php');
$table_obj="Tws_emr02_00";
$ws_emr02_00=new $table_obj();
$ws_emr02_00 -> ws_id=$ws_id;
$ws_emr02_00 -> uuid=uniqid('',true);
$ws_emr02_00 -> created=time();
$ws_emr02_00 -> org_id=$org_id;
$ws_emr02_00 -> doctor_id=$doctor_id;
$ws_emr02_00 -> identity_number=$identity_number;//身份证号
$ws_emr02_00 -> action='insert';
$ws_emr02_00->emr02_00_01_001 = $emr02_00_01_001; //文档标识-名称  
$ws_emr02_00->emr02_00_01_002 = $emr02_00_01_002; //文档标识-类别代码 
$ws_emr02_00->emr02_00_01_003 = $emr02_00_01_003; //文档标识-管理机构名称 
$ws_emr02_00->emr02_00_01_004 = $emr02_00_01_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr02_00->emr02_00_01_005 = $emr02_00_01_005; //文档标识-号码  
$ws_emr02_00 ->emr02_00_01_006 = empty($emr02_00_01_006)?null : $ws_emr02_00 ->escape('emr02_00_01_006',to_date($emr02_00_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr02_00 ->emr02_00_01_007 = empty($emr02_00_01_007)?null : $ws_emr02_00 ->escape('emr02_00_01_007',to_date($emr02_00_01_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr02_00->emr02_00_01_011 = $emr02_00_01_011; //标识号-类别代码  
$ws_emr02_00->emr02_00_01_012 = $emr02_00_01_012; //标识号-号码*  
$ws_emr02_00 ->emr02_00_01_013 = empty($emr02_00_01_013)?null : $ws_emr02_00 ->escape('emr02_00_01_013',to_date($emr02_00_01_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr02_00 ->emr02_00_01_014 = empty($emr02_00_01_014)?null : $ws_emr02_00 ->escape('emr02_00_01_014',to_date($emr02_00_01_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr02_00->emr02_00_01_015 = $emr02_00_01_015; //标识号-提供标识的机构名称  
$ws_emr02_00->emr02_00_01_016 = $emr02_00_01_016; //姓名-标识对象 
$ws_emr02_00->emr02_00_01_017 = $emr02_00_01_017; //姓名-标识对象代码 
$ws_emr02_00->emr02_00_01_018 = $emr02_00_01_018; //姓名*  
$ws_emr02_00->emr02_00_01_021 = $emr02_00_01_021; //性别代码  
$ws_emr02_00->emr02_00_01_022 = $emr02_00_01_022; //年龄（岁）* 
$ws_emr02_00->emr02_00_01_023 = $emr02_00_01_023; //国籍代码  
$ws_emr02_00->emr02_00_01_024 = $emr02_00_01_024; //民族代码  
$ws_emr02_00->emr02_00_01_025 = $emr02_00_01_025; //婚姻状况类别代码 
$ws_emr02_00->emr02_00_01_026 = $emr02_00_01_026; //职业编码系统名称  
$ws_emr02_00->emr02_00_01_027 = $emr02_00_01_027; //职业代码 
$ws_emr02_00->emr02_00_01_028 = $emr02_00_01_028; //文化程度代码  
$ws_emr02_00 ->emr02_00_01_029 = empty($emr02_00_01_029)?null : $ws_emr02_00 ->escape('emr02_00_01_029',to_date($emr02_00_01_029,'YYYY-MM-DD')); //出生日期*  
$ws_emr02_00->emr02_00_01_030 = $emr02_00_01_030; //出生地*  
$ws_emr02_00->emr02_00_01_041 = $emr02_00_01_041; //工作单位名称*  
$ws_emr02_00->emr02_00_01_042 = $emr02_00_01_042; //标识地址类别的代码  
$ws_emr02_00->emr02_00_01_043 = $emr02_00_01_043; //地址-省（自治区、直辖市）* 
$ws_emr02_00->emr02_00_01_044 = $emr02_00_01_044; //地址-市（地区）* 
$ws_emr02_00->emr02_00_01_045 = $emr02_00_01_045; //地址-县（区）* 
$ws_emr02_00->emr02_00_01_046 = $emr02_00_01_046; //地址-乡（镇、街道办事处）* 
$ws_emr02_00->emr02_00_01_047 = $emr02_00_01_047; //地址-村（街、路、弄等）* 
$ws_emr02_00->emr02_00_01_048 = $emr02_00_01_048; //地址-门牌号码* 
$ws_emr02_00->emr02_00_01_049 = $emr02_00_01_049; //邮政编码*  
$ws_emr02_00->emr02_00_01_050 = $emr02_00_01_050; //行政区划代码*  
$ws_emr02_00->emr02_00_01_061 = $emr02_00_01_061; //联系电话-类别* 
$ws_emr02_00->emr02_00_01_062 = $emr02_00_01_062; //联系电话-类别代码* 
$ws_emr02_00->emr02_00_01_063 = $emr02_00_01_063; //联系电话-号码* 
$ws_emr02_00->emr02_00_01_064 = $emr02_00_01_064; //电子邮件地址* 
$ws_emr02_00->emr02_00_01_071 = $emr02_00_01_071; //机构名称 
$ws_emr02_00->emr02_00_01_072 = $emr02_00_01_072; //机构组织机构代码 
$ws_emr02_00->emr02_00_01_073 = $emr02_00_01_073; //机构负责人（法人） 
$ws_emr02_00->emr02_00_01_074 = $emr02_00_01_074; //机构地址 
$ws_emr02_00->emr02_00_01_075 = $emr02_00_01_075; //科室名称 
$ws_emr02_00->emr02_00_01_076 = $emr02_00_01_076; //机构角色 
$ws_emr02_00->emr02_00_01_077 = $emr02_00_01_077; //机构角色代码 
$ws_emr02_00->emr02_00_01_361 = $emr02_00_01_361; //服务者姓名* 
$ws_emr02_00->emr02_00_01_362 = $emr02_00_01_362; //服务者职责（角色）* 
$ws_emr02_00->emr02_00_01_363 = $emr02_00_01_363; //服务者职责（角色）代码 
$ws_emr02_00->emr02_00_01_364 = $emr02_00_01_364; //服务者医师资格标志* 
$ws_emr02_00->emr02_00_01_365 = $emr02_00_01_365; //服务者学历* 
$ws_emr02_00->emr02_00_01_366 = $emr02_00_01_366; //服务者所学专业* 
$ws_emr02_00->emr02_00_01_367 = $emr02_00_01_367; //服务者专业技术职称* 
$ws_emr02_00->emr02_00_01_368 = $emr02_00_01_368; //服务者职务* 
$ws_emr02_00->emr02_00_01_371 = $emr02_00_01_371; //卫生事件(动作)名称 
$ws_emr02_00->emr02_00_01_372 = $emr02_00_01_372; //事件分类代码 
$ws_emr02_00->emr02_00_01_373 = $emr02_00_01_373; //事件开始时间 
$ws_emr02_00->emr02_00_01_374 = $emr02_00_01_374; //事件结束时间 
$ws_emr02_00 ->emr02_00_01_375 = empty($emr02_00_01_375)?null : $ws_emr02_00 ->escape('emr02_00_01_375',to_date($emr02_00_01_375,'YYYY-MM-DD')); //事件发生地点 
$ws_emr02_00 ->emr02_00_01_376 = empty($emr02_00_01_376)?null : $ws_emr02_00 ->escape('emr02_00_01_376',to_date($emr02_00_01_376,'YYYY-MM-DD')); //事件发生场所 
$ws_emr02_00->emr02_00_01_377 = $emr02_00_01_377; //事件参与方 
$ws_emr02_00->emr02_00_01_378 = $emr02_00_01_378; //事件发生原因 
$ws_emr02_00->emr02_00_01_379 = $emr02_00_01_379; //事件结局 
$ws_emr02_00->emr02_00_01_081 = $emr02_00_01_081; //主诉 
$ws_emr02_00->emr02_00_01_082 = $emr02_00_01_082; //症状代码编码体系名称 
$ws_emr02_00->emr02_00_01_083 = $emr02_00_01_083; //症状代码 
$ws_emr02_00 ->emr02_00_01_084 = empty($emr02_00_01_084)?null : $ws_emr02_00 ->escape('emr02_00_01_084',to_date($emr02_00_01_084,'YYYY-MM-DD')); //症状开始日期时间 
$ws_emr02_00 ->emr02_00_01_085 = empty($emr02_00_01_085)?null : $ws_emr02_00 ->escape('emr02_00_01_085',to_date($emr02_00_01_085,'YYYY-MM-DD')); //症状停止日期时间 
$ws_emr02_00->emr02_00_01_086 = $emr02_00_01_086; //症状观察项目类目名称 
$ws_emr02_00->emr02_00_01_087 = $emr02_00_01_087; //症状观察结果 
$ws_emr02_00->emr02_00_01_091 = $emr02_00_01_091; //观察-类别 
$ws_emr02_00->emr02_00_01_092 = $emr02_00_01_092; //观察-类别代码 
$ws_emr02_00->emr02_00_01_093 = $emr02_00_01_093; //观察项目名称 
$ws_emr02_00->emr02_00_01_094 = $emr02_00_01_094; //观察-项目代码 
$ws_emr02_00->emr02_00_01_095 = $emr02_00_01_095; //观察-结果描述 
$ws_emr02_00->emr02_00_01_096 = $emr02_00_01_096; //观察-结果(数值) 
$ws_emr02_00->emr02_00_01_097 = $emr02_00_01_097; //观察-计量单位 
$ws_emr02_00->emr02_00_01_098 = $emr02_00_01_098; //观察-结果代码 
$ws_emr02_00->emr02_00_01_099 = $emr02_00_01_099; //体格检查项目类目名称 
$ws_emr02_00->emr02_00_01_100 = $emr02_00_01_100; //体格检查观察结果 
$ws_emr02_00 ->emr02_00_01_201 = empty($emr02_00_01_201)?null : $ws_emr02_00 ->escape('emr02_00_01_201',to_date($emr02_00_01_201,'YYYY-MM-DD')); //起病时间 
$ws_emr02_00->emr02_00_01_202 = $emr02_00_01_202; //起病情况描述 
$ws_emr02_00->emr02_00_01_203 = $emr02_00_01_203; //症状开始原因/诱因 
$ws_emr02_00->emr02_00_01_204 = $emr02_00_01_204; //症状特点 
$ws_emr02_00->emr02_00_01_205 = $emr02_00_01_205; //伴随症状 
$ws_emr02_00->emr02_00_01_206 = $emr02_00_01_206; //本疾病既往诊疗经过 
$ws_emr02_00->emr02_00_01_207 = $emr02_00_01_207; //起病后一般情况 
$ws_emr02_00->emr02_00_01_208 = $emr02_00_01_208; //基础疾病诊疗情况 
$ws_emr02_00->emr02_00_01_211 = $emr02_00_01_211; //既往观察-项目名称 
$ws_emr02_00->emr02_00_01_212 = $emr02_00_01_212; //既往观察-项目分类代码 
$ws_emr02_00->emr02_00_01_213 = $emr02_00_01_213; //既往观察-项目代码名称 
$ws_emr02_00->emr02_00_01_214 = $emr02_00_01_214; //既往观察-项目代码 
$ws_emr02_00->emr02_00_01_215 = $emr02_00_01_215; //既往观察-方法代码 
$ws_emr02_00->emr02_00_01_216 = $emr02_00_01_216; //既往观察-结果 
$ws_emr02_00->emr02_00_01_217 = $emr02_00_01_217; //既往史观察项目类目名称 
$ws_emr02_00->emr02_00_01_218 = $emr02_00_01_218; //既往史观察结果 
$ws_emr02_00->emr02_00_01_221 = $emr02_00_01_221; //过敏史 
$ws_emr02_00->emr02_00_01_222 = $emr02_00_01_222; //过敏原 
$ws_emr02_00->emr02_00_01_223 = $emr02_00_01_223; //过敏症状 
$ws_emr02_00->emr02_00_01_224 = $emr02_00_01_224; //过敏症状代码 
$ws_emr02_00->emr02_00_01_225 = $emr02_00_01_225; //过敏原代码 
$ws_emr02_00->emr02_00_01_226 = $emr02_00_01_226; //过敏药物名称 
$ws_emr02_00->emr02_00_01_227 = $emr02_00_01_227; //过敏病情状态代码 
$ws_emr02_00->emr02_00_01_228 = $emr02_00_01_228; //过敏严重性代码 
$ws_emr02_00->emr02_00_01_229 = $emr02_00_01_229; //过敏史标识代码 
$ws_emr02_00->emr02_00_01_231 = $emr02_00_01_231; //检查申请单—机构（科室） 
$ws_emr02_00->emr02_00_01_232 = $emr02_00_01_232; //检查申请单—编号 
$ws_emr02_00->emr02_00_01_233 = $emr02_00_01_233; //检查申请检查原因 
$ws_emr02_00 ->emr02_00_01_234 = empty($emr02_00_01_234)?null : $ws_emr02_00 ->escape('emr02_00_01_234',to_date($emr02_00_01_234,'YYYY-MM-DD')); //检查申请日期 
$ws_emr02_00->emr02_00_01_241 = $emr02_00_01_241; //检查报告单—机构（科室） 
$ws_emr02_00->emr02_00_01_242 = $emr02_00_01_242; //检查报告单—编号 
$ws_emr02_00->emr02_00_01_243 = $emr02_00_01_243; //检查报告结果-客观所见 
$ws_emr02_00->emr02_00_01_244 = $emr02_00_01_244; //检查报告结果-主观提示 
$ws_emr02_00 ->emr02_00_01_245 = empty($emr02_00_01_245)?null : $ws_emr02_00 ->escape('emr02_00_01_245',to_date($emr02_00_01_245,'YYYY-MM-DD')); //检查日期 
$ws_emr02_00 ->emr02_00_01_246 = empty($emr02_00_01_246)?null : $ws_emr02_00 ->escape('emr02_00_01_246',to_date($emr02_00_01_246,'YYYY-MM-DD')); //检查报告日期 
$ws_emr02_00->emr02_00_01_251 = $emr02_00_01_251; //影像检查报告单—机构（科室） 
$ws_emr02_00->emr02_00_01_252 = $emr02_00_01_252; //影像检查报告单—编号 
$ws_emr02_00->emr02_00_01_253 = $emr02_00_01_253; //影像检查报告结果-客观所见 
$ws_emr02_00->emr02_00_01_254 = $emr02_00_01_254; //影像检查报告结果-主观提示 
$ws_emr02_00->emr02_00_01_255 = $emr02_00_01_255; //影像号—机构（科室） 
$ws_emr02_00->emr02_00_01_256 = $emr02_00_01_256; //影像号—编号类型 
$ws_emr02_00->emr02_00_01_257 = $emr02_00_01_257; //影像号—编号 
$ws_emr02_00 ->emr02_00_01_258 = empty($emr02_00_01_258)?null : $ws_emr02_00 ->escape('emr02_00_01_258',to_date($emr02_00_01_258,'YYYY-MM-DD')); //影像检查报告日期 
$ws_emr02_00 ->emr02_00_01_259 = empty($emr02_00_01_259)?null : $ws_emr02_00 ->escape('emr02_00_01_259',to_date($emr02_00_01_259,'YYYY-MM-DD')); //影像检查日期 
$ws_emr02_00->emr02_00_01_261 = $emr02_00_01_261; //观察-类别 
$ws_emr02_00->emr02_00_01_262 = $emr02_00_01_262; //观察-类别代码 
$ws_emr02_00->emr02_00_01_263 = $emr02_00_01_263; //观察项目名称 
$ws_emr02_00->emr02_00_01_264 = $emr02_00_01_264; //观察-项目代码 
$ws_emr02_00->emr02_00_01_265 = $emr02_00_01_265; //观察-结果描述 
$ws_emr02_00->emr02_00_01_266 = $emr02_00_01_266; //观察-结果(数值) 
$ws_emr02_00->emr02_00_01_267 = $emr02_00_01_267; //观察-计量单位 
$ws_emr02_00->emr02_00_01_268 = $emr02_00_01_268; //观察-结果代码 
$ws_emr02_00->emr02_00_01_269 = $emr02_00_01_269; //检查部位 
$ws_emr02_00->emr02_00_01_270 = $emr02_00_01_270; //检查部位代码 
$ws_emr02_00->emr02_00_01_281 = $emr02_00_01_281; //检验申请单—机构（科室） 
$ws_emr02_00->emr02_00_01_282 = $emr02_00_01_282; //检验申请单—编号 
$ws_emr02_00->emr02_00_01_283 = $emr02_00_01_283; //检验申请检验原因 
$ws_emr02_00 ->emr02_00_01_284 = empty($emr02_00_01_284)?null : $ws_emr02_00 ->escape('emr02_00_01_284',to_date($emr02_00_01_284,'YYYY-MM-DD')); //检验申请日期 
$ws_emr02_00->emr02_00_01_291 = $emr02_00_01_291; //检验报告单—机构（科室） 
$ws_emr02_00->emr02_00_01_292 = $emr02_00_01_292; //检验报告单—编号 
$ws_emr02_00->emr02_00_01_293 = $emr02_00_01_293; //检验报告结果-客观所见 
$ws_emr02_00->emr02_00_01_294 = $emr02_00_01_294; //检验报告结果-主观提示 
$ws_emr02_00 ->emr02_00_01_295 = empty($emr02_00_01_295)?null : $ws_emr02_00 ->escape('emr02_00_01_295',to_date($emr02_00_01_295,'YYYY-MM-DD')); //检验日期 
$ws_emr02_00 ->emr02_00_01_296 = empty($emr02_00_01_296)?null : $ws_emr02_00 ->escape('emr02_00_01_296',to_date($emr02_00_01_296,'YYYY-MM-DD')); //检验报告日期 
$ws_emr02_00->emr02_00_01_301 = $emr02_00_01_301; //标本类别代码 
$ws_emr02_00->emr02_00_01_302 = $emr02_00_01_302; //标本号-机构（科室） 
$ws_emr02_00->emr02_00_01_303 = $emr02_00_01_303; //标本号-号码 
$ws_emr02_00->emr02_00_01_304 = $emr02_00_01_304; //标本标本状态代码 
$ws_emr02_00->emr02_00_01_305 = $emr02_00_01_305; //标本固定液 
$ws_emr02_00 ->emr02_00_01_306 = empty($emr02_00_01_306)?null : $ws_emr02_00 ->escape('emr02_00_01_306',to_date($emr02_00_01_306,'YYYY-MM-DD')); //标本采样时间 
$ws_emr02_00->emr02_00_01_311 = $emr02_00_01_311; //观察-类别 
$ws_emr02_00->emr02_00_01_312 = $emr02_00_01_312; //观察-类别代码 
$ws_emr02_00->emr02_00_01_313 = $emr02_00_01_313; //观察项目名称 
$ws_emr02_00->emr02_00_01_314 = $emr02_00_01_314; //观察-项目代码 
$ws_emr02_00->emr02_00_01_315 = $emr02_00_01_315; //观察-结果描述 
$ws_emr02_00->emr02_00_01_316 = $emr02_00_01_316; //观察-结果(数值) 
$ws_emr02_00->emr02_00_01_317 = $emr02_00_01_317; //观察-计量单位 
$ws_emr02_00->emr02_00_01_318 = $emr02_00_01_318; //观察-结果代码 
$ws_emr02_00->emr02_00_01_321 = $emr02_00_01_321; //诊断机构名称 
$ws_emr02_00 ->emr02_00_01_322 = empty($emr02_00_01_322)?null : $ws_emr02_00 ->escape('emr02_00_01_322',to_date($emr02_00_01_322,'YYYY-MM-DD')); //诊断日期 
$ws_emr02_00->emr02_00_01_323 = $emr02_00_01_323; //诊断类别 
$ws_emr02_00->emr02_00_01_324 = $emr02_00_01_324; //诊断类别代码 
$ws_emr02_00->emr02_00_01_325 = $emr02_00_01_325; //诊断顺位（从属关系）代码 
$ws_emr02_00->emr02_00_01_326 = $emr02_00_01_326; //疾病名称 
$ws_emr02_00->emr02_00_01_327 = $emr02_00_01_327; //疾病代码 
$ws_emr02_00->emr02_00_01_328 = $emr02_00_01_328; //诊断依据 
$ws_emr02_00->emr02_00_01_329 = $emr02_00_01_329; //诊断依据代码 
$ws_emr02_00->emr02_00_01_331 = $emr02_00_01_331; //拟做的检查 
$ws_emr02_00->emr02_00_01_332 = $emr02_00_01_332; //拟做的医学检验 
$ws_emr02_00->emr02_00_01_333 = $emr02_00_01_333; //今后治疗方案 
$ws_emr02_00->emr02_00_01_341 = $emr02_00_01_341; //诊疗过程名称 
$ws_emr02_00->emr02_00_01_342 = $emr02_00_01_342; //诊疗过程描述 
$ws_emr02_00 ->emr02_00_01_351 = empty($emr02_00_01_351)?null : $ws_emr02_00 ->escape('emr02_00_01_351',to_date($emr02_00_01_351,'YYYY-MM-DD')); //医嘱开嘱日期时间 
$ws_emr02_00 ->emr02_00_01_352 = empty($emr02_00_01_352)?null : $ws_emr02_00 ->escape('emr02_00_01_352',to_date($emr02_00_01_352,'YYYY-MM-DD')); //长期医嘱停嘱日期时间 
$ws_emr02_00 ->emr02_00_01_353 = empty($emr02_00_01_353)?null : $ws_emr02_00 ->escape('emr02_00_01_353',to_date($emr02_00_01_353,'YYYY-MM-DD')); //医嘱执行日期时间 
$ws_emr02_00->emr02_00_01_354 = $emr02_00_01_354; //医嘱执行时间类别代码 
$ws_emr02_00 ->emr02_00_01_355 = empty($emr02_00_01_355)?null : $ws_emr02_00 ->escape('emr02_00_01_355',to_date($emr02_00_01_355,'YYYY-MM-DD')); //医嘱取消日期时间 
$ws_emr02_00->emr02_00_01_356 = $emr02_00_01_356; //医嘱类别 
$ws_emr02_00->emr02_00_01_357 = $emr02_00_01_357; //医嘱内容 
if($ws_emr02_00 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr02_00 ->free_statement();
}
