<?php
/**
电子病历基础模板：检查检验记录数据集EMR04.00电子病历基础模板：检查检验记录数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr04_00_01_064  机构地址
* @param string $emr04_00_01_065  科室名称
* @param string $emr04_00_01_066  机构角色
* @param string $emr04_00_01_067  机构角色代码
* @param string $emr04_00_01_068  服务者姓名*
* @param string $emr04_00_01_069  服务者职责（角色）
* @param string $emr04_00_01_070  服务者职责（角色）代码
* @param string $emr04_00_01_071  服务者医师资格标志*
* @param string $emr04_00_01_072  服务者学历*
* @param string $emr04_00_01_073  服务者所学专业*
* @param string $emr04_00_01_074  服务者专业技术职称
* @param string $emr04_00_01_075  服务者职务*
* @param string $emr04_00_01_081  卫生事件(动作)名称 
* @param string $emr04_00_01_082  事件分类代码
* @param date $emr04_00_01_083  事件开始时间
* @param date $emr04_00_01_084  事件结束时间
* @param string $emr04_00_01_085  事件发生地点
* @param string $emr04_00_01_086  事件发生场所
* @param string $emr04_00_01_087  事件参与方
* @param string $emr04_00_01_088  事件发生原因
* @param string $emr04_00_01_089  事件结局
* @param string $emr04_00_01_091  主诉
* @param string $emr04_00_01_092  症状代码编码体系名称
* @param string $emr04_00_01_093  症状代码
* @param dateTime $emr04_00_01_094  症状开始日期时间
* @param dateTime $emr04_00_01_095  症状停止日期时间
* @param string $emr04_00_01_096  症状观察项目数据组
* @param string $emr04_00_01_097  症状观察结果
* @param string $emr04_00_01_101  手术史标识
* @param string $emr04_00_01_102  手术方式代码
* @param string $emr04_00_01_103  手术体位代码
* @param string $emr04_00_01_104  手术过程描述
* @param string $emr04_00_01_  当前用药史标识代码
* @param string $emr04_00_01_121  个人史危险因素代码
* @param string $emr04_00_01_122  个人史观察项目类目名称
* @param string $emr04_00_01_123  个人史观察结果
* @param string $emr04_00_01_131  观察-类别 
* @param string $emr04_00_01_132  观察-类别代码 
* @param string $emr04_00_01_133  观察项目名称
* @param string $emr04_00_01_134  观察-项目代码 
* @param string $emr04_00_01_135  检查方法代码
* @param string $emr04_00_01_136  观察-结果描述 
* @param decimal $emr04_00_01_137  观察-结果(数值) 
* @param string $emr04_00_01_138  观察-计量单位 
* @param string $emr04_00_01_139  观察-结果代码 
* @param string $emr04_00_01_140  检查部位
* @param string $emr04_00_01_141  检查部位代码
* @param string $emr04_00_01_151  检查申请单—机构（科室） 
* @param string $emr04_00_01_152  检查申请单—编号 
* @param string $emr04_00_01_153  检查申请检查原因
* @param date $emr04_00_01_154  检查申请日期
* @param string $emr04_00_01_155  检验申请检验注意事项
* @param string $emr04_00_01_161  检查报告单—机构（科室）
* @param string $emr04_00_01_162  检查报告单—编号
* @param string $emr04_00_01_163  检查报告结果-客观所见
* @param string $emr04_00_01_164  检查报告结果-主观提示
* @param date $emr04_00_01_165  检查日期
* @param date $emr04_00_01_166  检查报告日期
* @param string $emr04_00_01_167  检查报告备注
* @param string $emr04_00_01_171  标本类别代码
* @param string $emr04_00_01_172  标本号-机构（科室）
* @param string $emr04_00_01_173  标本号-号码
* @param string $emr04_00_01_174  标本标本状态代码
* @param string $emr04_00_01_175  标本固定液
* @param date $emr04_00_01_176  标本采样时间
* @param string $emr04_00_01_181  诊断类别
* @param string $emr04_00_01_182  诊断类别代码
* @param string $emr04_00_01_183  诊断顺位（从属关系）代码
* @param string $emr04_00_01_184  疾病名称
* @param string $emr04_00_01_185  疾病代码
* @param string $emr04_00_01_186  诊断依据
* @param string $emr04_00_01_187  诊断依据代码
* @param string $emr04_00_01_188  诊断机构
* @param date $emr04_00_01_189  诊断日期
* @param string $emr04_00_01_201  操作名称
* @param string $emr04_00_01_202  操作编码体系名称
* @param string $emr04_00_01_203  操作编码
* @param string $emr04_00_01_204  操作部位名称
* @param string $emr04_00_01_205  操作部位编码体系名称
* @param string $emr04_00_01_206  操作部位编码
* @param string $emr04_00_01_207  介入物名称
* @param string $emr04_00_01_208  操作方法
* @param decimal $emr04_00_01_209  操作次数
* @param dateTime $emr04_00_01_210  操作日期/时间 
* @param string $emr04_00_01_221  麻醉观察项目类目名称
* @param string $emr04_00_01_222  麻醉观察结果
* @param string $emr04_00_01_231  诊疗过程名称
* @param string $emr04_00_01_232  诊疗过程描述
* @param decimal $emr04_00_01_241  身高
* @param decimal $emr04_00_01_242  体重
* @param string $emr04_00_01_001  文档标识-名称 
* @param string $emr04_00_01_002  文档标识-类别代码 
* @param string $emr04_00_01_003  文档标识-管理机构名称 
* @param string $emr04_00_01_004  文档标识-管理机构组织机构代码（法人代码） 
* @param string $emr04_00_01_005  文档标识-号码 
* @param date $emr04_00_01_006  文档标识-生效日期 
* @param date $emr04_00_01_007  文档标识-失效日期  
* @param string $emr04_00_01_011  姓名-标识对象  
* @param string $emr04_00_01_012  姓名-标识对象代码  
* @param string $emr04_00_01_013  姓名  
* @param string $emr04_00_01_014  标识号-类别代码* 
* @param string $emr04_00_01_015  标识号-号码* 
* @param date $emr04_00_01_016  标识号-生效日期* 
* @param date $emr04_00_01_017  标识号-失效日期* 
* @param string $emr04_00_01_018  标识号-提供标识的机构名称* 
* @param string $emr04_00_01_019  病人类型代码
* @param string $emr04_00_01_021  性别代码  
* @param decimal $emr04_00_01_022  年龄（岁）
* @param string $emr04_00_01_023  国籍代码  
* @param string $emr04_00_01_024  民族代码  
* @param string $emr04_00_01_025  婚姻状况类别代码
* @param string $emr04_00_01_026  职业编码系统名称  
* @param string $emr04_00_01_027  职业代码
* @param string $emr04_00_01_028  文化程度代码  
* @param string $emr04_00_01_031  标识地址类别的代码  
* @param string $emr04_00_01_032  地址-省（自治区、直辖市）
* @param string $emr04_00_01_033  地址-市（地区）
* @param string $emr04_00_01_034  地址-县（区）
* @param string $emr04_00_01_035  地址-乡（镇、街道办事处）
* @param string $emr04_00_01_036  地址-村（街、路、弄等）
* @param string $emr04_00_01_037  地址-门牌号码
* @param string $emr04_00_01_038  邮政编码  
* @param string $emr04_00_01_039  行政区划代码  
* @param string $emr04_00_01_040  工作单位名称* 
* @param string $emr04_00_01_051  联系电话-类别 
* @param string $emr04_00_01_052  联系电话-类别代码 
* @param string $emr04_00_01_053  联系电话-号码 
* @param string $emr04_00_01_054  电子邮件地址
* @param string $emr04_00_01_061  机构名称
* @param string $emr04_00_01_062  机构组织机构代码
* @param string $emr04_00_01_063  机构负责人（法人）
* @return boolean
*/
function update_emr04_00($ws_id,$org_id,$doctor_id,$identity_number,$emr04_00_01_064='',$emr04_00_01_065='',$emr04_00_01_066='',$emr04_00_01_067='',$emr04_00_01_068='',$emr04_00_01_069='',$emr04_00_01_070='',$emr04_00_01_071='',$emr04_00_01_072='',$emr04_00_01_073='',$emr04_00_01_074='',$emr04_00_01_075='',$emr04_00_01_081='',$emr04_00_01_082='',$emr04_00_01_083='',$emr04_00_01_084='',$emr04_00_01_085='',$emr04_00_01_086='',$emr04_00_01_087='',$emr04_00_01_088='',$emr04_00_01_089='',$emr04_00_01_091='',$emr04_00_01_092='',$emr04_00_01_093='',$emr04_00_01_094='',$emr04_00_01_095='',$emr04_00_01_096='',$emr04_00_01_097='',$emr04_00_01_101='',$emr04_00_01_102='',$emr04_00_01_103='',$emr04_00_01_104='',$emr04_00_01_='',$emr04_00_01_121='',$emr04_00_01_122='',$emr04_00_01_123='',$emr04_00_01_131='',$emr04_00_01_132='',$emr04_00_01_133='',$emr04_00_01_134='',$emr04_00_01_135='',$emr04_00_01_136='',$emr04_00_01_137=0,$emr04_00_01_138='',$emr04_00_01_139='',$emr04_00_01_140='',$emr04_00_01_141='',$emr04_00_01_151='',$emr04_00_01_152='',$emr04_00_01_153='',$emr04_00_01_154='',$emr04_00_01_155='',$emr04_00_01_161='',$emr04_00_01_162='',$emr04_00_01_163='',$emr04_00_01_164='',$emr04_00_01_165='',$emr04_00_01_166='',$emr04_00_01_167='',$emr04_00_01_171='',$emr04_00_01_172='',$emr04_00_01_173='',$emr04_00_01_174='',$emr04_00_01_175='',$emr04_00_01_176='',$emr04_00_01_181='',$emr04_00_01_182='',$emr04_00_01_183='',$emr04_00_01_184='',$emr04_00_01_185='',$emr04_00_01_186='',$emr04_00_01_187='',$emr04_00_01_188='',$emr04_00_01_189='',$emr04_00_01_201='',$emr04_00_01_202='',$emr04_00_01_203='',$emr04_00_01_204='',$emr04_00_01_205='',$emr04_00_01_206='',$emr04_00_01_207='',$emr04_00_01_208='',$emr04_00_01_209=0,$emr04_00_01_210='',$emr04_00_01_221='',$emr04_00_01_222='',$emr04_00_01_231='',$emr04_00_01_232='',$emr04_00_01_241=0,$emr04_00_01_242=0,$emr04_00_01_001='',$emr04_00_01_002='',$emr04_00_01_003='',$emr04_00_01_004='',$emr04_00_01_005='',$emr04_00_01_006='',$emr04_00_01_007='',$emr04_00_01_011='',$emr04_00_01_012='',$emr04_00_01_013='',$emr04_00_01_014='',$emr04_00_01_015='',$emr04_00_01_016='',$emr04_00_01_017='',$emr04_00_01_018='',$emr04_00_01_019='',$emr04_00_01_021='',$emr04_00_01_022=0,$emr04_00_01_023='',$emr04_00_01_024='',$emr04_00_01_025='',$emr04_00_01_026='',$emr04_00_01_027='',$emr04_00_01_028='',$emr04_00_01_031='',$emr04_00_01_032='',$emr04_00_01_033='',$emr04_00_01_034='',$emr04_00_01_035='',$emr04_00_01_036='',$emr04_00_01_037='',$emr04_00_01_038='',$emr04_00_01_039='',$emr04_00_01_040='',$emr04_00_01_051='',$emr04_00_01_052='',$emr04_00_01_053='',$emr04_00_01_054='',$emr04_00_01_061='',$emr04_00_01_062='',$emr04_00_01_063=''){
require_once(__SITEROOT.'library/Models/ws_emr04_00.php');
$table_obj="Tws_emr04_00";
$ws_emr04_00=new $table_obj();
$ws_emr04_00 -> ws_id=$ws_id;
$ws_emr04_00 -> uuid=uniqid('',true);
$ws_emr04_00 -> created=time();
$ws_emr04_00 -> org_id=$org_id;
$ws_emr04_00 -> doctor_id=$doctor_id;
$ws_emr04_00 -> identity_number=$identity_number;//身份证号
$ws_emr04_00 -> action='insert';
$ws_emr04_00->emr04_00_01_064 = $emr04_00_01_064; //机构地址 
$ws_emr04_00->emr04_00_01_065 = $emr04_00_01_065; //科室名称 
$ws_emr04_00->emr04_00_01_066 = $emr04_00_01_066; //机构角色 
$ws_emr04_00->emr04_00_01_067 = $emr04_00_01_067; //机构角色代码 
$ws_emr04_00->emr04_00_01_068 = $emr04_00_01_068; //服务者姓名* 
$ws_emr04_00->emr04_00_01_069 = $emr04_00_01_069; //服务者职责（角色） 
$ws_emr04_00->emr04_00_01_070 = $emr04_00_01_070; //服务者职责（角色）代码 
$ws_emr04_00->emr04_00_01_071 = $emr04_00_01_071; //服务者医师资格标志* 
$ws_emr04_00->emr04_00_01_072 = $emr04_00_01_072; //服务者学历* 
$ws_emr04_00->emr04_00_01_073 = $emr04_00_01_073; //服务者所学专业* 
$ws_emr04_00->emr04_00_01_074 = $emr04_00_01_074; //服务者专业技术职称 
$ws_emr04_00->emr04_00_01_075 = $emr04_00_01_075; //服务者职务* 
$ws_emr04_00->emr04_00_01_081 = $emr04_00_01_081; //卫生事件(动作)名称  
$ws_emr04_00->emr04_00_01_082 = $emr04_00_01_082; //事件分类代码 
$ws_emr04_00 ->emr04_00_01_083 = empty($emr04_00_01_083)?null : $ws_emr04_00 ->escape('emr04_00_01_083',to_date($emr04_00_01_083,'YYYY-MM-DD')); //事件开始时间 
$ws_emr04_00 ->emr04_00_01_084 = empty($emr04_00_01_084)?null : $ws_emr04_00 ->escape('emr04_00_01_084',to_date($emr04_00_01_084,'YYYY-MM-DD')); //事件结束时间 
$ws_emr04_00->emr04_00_01_085 = $emr04_00_01_085; //事件发生地点 
$ws_emr04_00->emr04_00_01_086 = $emr04_00_01_086; //事件发生场所 
$ws_emr04_00->emr04_00_01_087 = $emr04_00_01_087; //事件参与方 
$ws_emr04_00->emr04_00_01_088 = $emr04_00_01_088; //事件发生原因 
$ws_emr04_00->emr04_00_01_089 = $emr04_00_01_089; //事件结局 
$ws_emr04_00->emr04_00_01_091 = $emr04_00_01_091; //主诉 
$ws_emr04_00->emr04_00_01_092 = $emr04_00_01_092; //症状代码编码体系名称 
$ws_emr04_00->emr04_00_01_093 = $emr04_00_01_093; //症状代码 
$ws_emr04_00 ->emr04_00_01_094 = empty($emr04_00_01_094)?null : $ws_emr04_00 ->escape('emr04_00_01_094',to_date($emr04_00_01_094,'YYYY-MM-DD')); //症状开始日期时间 
$ws_emr04_00 ->emr04_00_01_095 = empty($emr04_00_01_095)?null : $ws_emr04_00 ->escape('emr04_00_01_095',to_date($emr04_00_01_095,'YYYY-MM-DD')); //症状停止日期时间 
$ws_emr04_00->emr04_00_01_096 = $emr04_00_01_096; //症状观察项目数据组 
$ws_emr04_00->emr04_00_01_097 = $emr04_00_01_097; //症状观察结果 
$ws_emr04_00->emr04_00_01_101 = $emr04_00_01_101; //手术史标识 
$ws_emr04_00->emr04_00_01_102 = $emr04_00_01_102; //手术方式代码 
$ws_emr04_00->emr04_00_01_103 = $emr04_00_01_103; //手术体位代码 
$ws_emr04_00->emr04_00_01_104 = $emr04_00_01_104; //手术过程描述 
$ws_emr04_00->emr04_00_01_ = $emr04_00_01_; //当前用药史标识代码 
$ws_emr04_00->emr04_00_01_121 = $emr04_00_01_121; //个人史危险因素代码 
$ws_emr04_00->emr04_00_01_122 = $emr04_00_01_122; //个人史观察项目类目名称 
$ws_emr04_00->emr04_00_01_123 = $emr04_00_01_123; //个人史观察结果 
$ws_emr04_00->emr04_00_01_131 = $emr04_00_01_131; //观察-类别  
$ws_emr04_00->emr04_00_01_132 = $emr04_00_01_132; //观察-类别代码  
$ws_emr04_00->emr04_00_01_133 = $emr04_00_01_133; //观察项目名称 
$ws_emr04_00->emr04_00_01_134 = $emr04_00_01_134; //观察-项目代码  
$ws_emr04_00->emr04_00_01_135 = $emr04_00_01_135; //检查方法代码 
$ws_emr04_00->emr04_00_01_136 = $emr04_00_01_136; //观察-结果描述  
$ws_emr04_00->emr04_00_01_137 = $emr04_00_01_137; //观察-结果(数值)  
$ws_emr04_00->emr04_00_01_138 = $emr04_00_01_138; //观察-计量单位  
$ws_emr04_00->emr04_00_01_139 = $emr04_00_01_139; //观察-结果代码  
$ws_emr04_00->emr04_00_01_140 = $emr04_00_01_140; //检查部位 
$ws_emr04_00->emr04_00_01_141 = $emr04_00_01_141; //检查部位代码 
$ws_emr04_00->emr04_00_01_151 = $emr04_00_01_151; //检查申请单—机构（科室）  
$ws_emr04_00->emr04_00_01_152 = $emr04_00_01_152; //检查申请单—编号  
$ws_emr04_00->emr04_00_01_153 = $emr04_00_01_153; //检查申请检查原因 
$ws_emr04_00 ->emr04_00_01_154 = empty($emr04_00_01_154)?null : $ws_emr04_00 ->escape('emr04_00_01_154',to_date($emr04_00_01_154,'YYYY-MM-DD')); //检查申请日期 
$ws_emr04_00->emr04_00_01_155 = $emr04_00_01_155; //检验申请检验注意事项 
$ws_emr04_00->emr04_00_01_161 = $emr04_00_01_161; //检查报告单—机构（科室） 
$ws_emr04_00->emr04_00_01_162 = $emr04_00_01_162; //检查报告单—编号 
$ws_emr04_00->emr04_00_01_163 = $emr04_00_01_163; //检查报告结果-客观所见 
$ws_emr04_00->emr04_00_01_164 = $emr04_00_01_164; //检查报告结果-主观提示 
$ws_emr04_00 ->emr04_00_01_165 = empty($emr04_00_01_165)?null : $ws_emr04_00 ->escape('emr04_00_01_165',to_date($emr04_00_01_165,'YYYY-MM-DD')); //检查日期 
$ws_emr04_00 ->emr04_00_01_166 = empty($emr04_00_01_166)?null : $ws_emr04_00 ->escape('emr04_00_01_166',to_date($emr04_00_01_166,'YYYY-MM-DD')); //检查报告日期 
$ws_emr04_00->emr04_00_01_167 = $emr04_00_01_167; //检查报告备注 
$ws_emr04_00->emr04_00_01_171 = $emr04_00_01_171; //标本类别代码 
$ws_emr04_00->emr04_00_01_172 = $emr04_00_01_172; //标本号-机构（科室） 
$ws_emr04_00->emr04_00_01_173 = $emr04_00_01_173; //标本号-号码 
$ws_emr04_00->emr04_00_01_174 = $emr04_00_01_174; //标本标本状态代码 
$ws_emr04_00->emr04_00_01_175 = $emr04_00_01_175; //标本固定液 
$ws_emr04_00 ->emr04_00_01_176 = empty($emr04_00_01_176)?null : $ws_emr04_00 ->escape('emr04_00_01_176',to_date($emr04_00_01_176,'YYYY-MM-DD')); //标本采样时间 
$ws_emr04_00->emr04_00_01_181 = $emr04_00_01_181; //诊断类别 
$ws_emr04_00->emr04_00_01_182 = $emr04_00_01_182; //诊断类别代码 
$ws_emr04_00->emr04_00_01_183 = $emr04_00_01_183; //诊断顺位（从属关系）代码 
$ws_emr04_00->emr04_00_01_184 = $emr04_00_01_184; //疾病名称 
$ws_emr04_00->emr04_00_01_185 = $emr04_00_01_185; //疾病代码 
$ws_emr04_00->emr04_00_01_186 = $emr04_00_01_186; //诊断依据 
$ws_emr04_00->emr04_00_01_187 = $emr04_00_01_187; //诊断依据代码 
$ws_emr04_00->emr04_00_01_188 = $emr04_00_01_188; //诊断机构 
$ws_emr04_00 ->emr04_00_01_189 = empty($emr04_00_01_189)?null : $ws_emr04_00 ->escape('emr04_00_01_189',to_date($emr04_00_01_189,'YYYY-MM-DD')); //诊断日期 
$ws_emr04_00->emr04_00_01_201 = $emr04_00_01_201; //操作名称 
$ws_emr04_00->emr04_00_01_202 = $emr04_00_01_202; //操作编码体系名称 
$ws_emr04_00->emr04_00_01_203 = $emr04_00_01_203; //操作编码 
$ws_emr04_00->emr04_00_01_204 = $emr04_00_01_204; //操作部位名称 
$ws_emr04_00->emr04_00_01_205 = $emr04_00_01_205; //操作部位编码体系名称 
$ws_emr04_00->emr04_00_01_206 = $emr04_00_01_206; //操作部位编码 
$ws_emr04_00->emr04_00_01_207 = $emr04_00_01_207; //介入物名称 
$ws_emr04_00->emr04_00_01_208 = $emr04_00_01_208; //操作方法 
$ws_emr04_00->emr04_00_01_209 = $emr04_00_01_209; //操作次数 
$ws_emr04_00 ->emr04_00_01_210 = empty($emr04_00_01_210)?null : $ws_emr04_00 ->escape('emr04_00_01_210',to_date($emr04_00_01_210,'YYYY-MM-DD')); //操作日期/时间  
$ws_emr04_00->emr04_00_01_221 = $emr04_00_01_221; //麻醉观察项目类目名称 
$ws_emr04_00->emr04_00_01_222 = $emr04_00_01_222; //麻醉观察结果 
$ws_emr04_00->emr04_00_01_231 = $emr04_00_01_231; //诊疗过程名称 
$ws_emr04_00->emr04_00_01_232 = $emr04_00_01_232; //诊疗过程描述 
$ws_emr04_00->emr04_00_01_241 = $emr04_00_01_241; //身高 
$ws_emr04_00->emr04_00_01_242 = $emr04_00_01_242; //体重 
$ws_emr04_00->emr04_00_01_001 = $emr04_00_01_001; //文档标识-名称  
$ws_emr04_00->emr04_00_01_002 = $emr04_00_01_002; //文档标识-类别代码  
$ws_emr04_00->emr04_00_01_003 = $emr04_00_01_003; //文档标识-管理机构名称  
$ws_emr04_00->emr04_00_01_004 = $emr04_00_01_004; //文档标识-管理机构组织机构代码（法人代码）  
$ws_emr04_00->emr04_00_01_005 = $emr04_00_01_005; //文档标识-号码  
$ws_emr04_00 ->emr04_00_01_006 = empty($emr04_00_01_006)?null : $ws_emr04_00 ->escape('emr04_00_01_006',to_date($emr04_00_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr04_00 ->emr04_00_01_007 = empty($emr04_00_01_007)?null : $ws_emr04_00 ->escape('emr04_00_01_007',to_date($emr04_00_01_007,'YYYY-MM-DD')); //文档标识-失效日期   
$ws_emr04_00->emr04_00_01_011 = $emr04_00_01_011; //姓名-标识对象   
$ws_emr04_00->emr04_00_01_012 = $emr04_00_01_012; //姓名-标识对象代码   
$ws_emr04_00->emr04_00_01_013 = $emr04_00_01_013; //姓名   
$ws_emr04_00->emr04_00_01_014 = $emr04_00_01_014; //标识号-类别代码*  
$ws_emr04_00->emr04_00_01_015 = $emr04_00_01_015; //标识号-号码*  
$ws_emr04_00 ->emr04_00_01_016 = empty($emr04_00_01_016)?null : $ws_emr04_00 ->escape('emr04_00_01_016',to_date($emr04_00_01_016,'YYYY-MM-DD')); //标识号-生效日期*  
$ws_emr04_00 ->emr04_00_01_017 = empty($emr04_00_01_017)?null : $ws_emr04_00 ->escape('emr04_00_01_017',to_date($emr04_00_01_017,'YYYY-MM-DD')); //标识号-失效日期*  
$ws_emr04_00->emr04_00_01_018 = $emr04_00_01_018; //标识号-提供标识的机构名称*  
$ws_emr04_00->emr04_00_01_019 = $emr04_00_01_019; //病人类型代码 
$ws_emr04_00->emr04_00_01_021 = $emr04_00_01_021; //性别代码   
$ws_emr04_00->emr04_00_01_022 = $emr04_00_01_022; //年龄（岁） 
$ws_emr04_00->emr04_00_01_023 = $emr04_00_01_023; //国籍代码   
$ws_emr04_00->emr04_00_01_024 = $emr04_00_01_024; //民族代码   
$ws_emr04_00->emr04_00_01_025 = $emr04_00_01_025; //婚姻状况类别代码 
$ws_emr04_00->emr04_00_01_026 = $emr04_00_01_026; //职业编码系统名称   
$ws_emr04_00->emr04_00_01_027 = $emr04_00_01_027; //职业代码 
$ws_emr04_00->emr04_00_01_028 = $emr04_00_01_028; //文化程度代码   
$ws_emr04_00->emr04_00_01_031 = $emr04_00_01_031; //标识地址类别的代码   
$ws_emr04_00->emr04_00_01_032 = $emr04_00_01_032; //地址-省（自治区、直辖市） 
$ws_emr04_00->emr04_00_01_033 = $emr04_00_01_033; //地址-市（地区） 
$ws_emr04_00->emr04_00_01_034 = $emr04_00_01_034; //地址-县（区） 
$ws_emr04_00->emr04_00_01_035 = $emr04_00_01_035; //地址-乡（镇、街道办事处） 
$ws_emr04_00->emr04_00_01_036 = $emr04_00_01_036; //地址-村（街、路、弄等） 
$ws_emr04_00->emr04_00_01_037 = $emr04_00_01_037; //地址-门牌号码 
$ws_emr04_00->emr04_00_01_038 = $emr04_00_01_038; //邮政编码   
$ws_emr04_00->emr04_00_01_039 = $emr04_00_01_039; //行政区划代码   
$ws_emr04_00->emr04_00_01_040 = $emr04_00_01_040; //工作单位名称*  
$ws_emr04_00->emr04_00_01_051 = $emr04_00_01_051; //联系电话-类别  
$ws_emr04_00->emr04_00_01_052 = $emr04_00_01_052; //联系电话-类别代码  
$ws_emr04_00->emr04_00_01_053 = $emr04_00_01_053; //联系电话-号码  
$ws_emr04_00->emr04_00_01_054 = $emr04_00_01_054; //电子邮件地址 
$ws_emr04_00->emr04_00_01_061 = $emr04_00_01_061; //机构名称 
$ws_emr04_00->emr04_00_01_062 = $emr04_00_01_062; //机构组织机构代码 
$ws_emr04_00->emr04_00_01_063 = $emr04_00_01_063; //机构负责人（法人） 
if($ws_emr04_00 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr04_00 ->free_statement();
}
