<?php
/**
电子病历基础模板：护理-护理评估与计划数据集EMR06.02电子病历基础模板：护理-护理评估与计划数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr06_02_02_001  文档标识-名称 
* @param string $emr06_02_02_002  文档标识-类别代码
* @param string $emr06_02_02_003  文档标识-管理机构名称
* @param string $emr06_02_02_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr06_02_02_005  文档标识-号码 
* @param date $emr06_02_02_006  文档标识-生效日期 
* @param date $emr06_02_02_007  文档标识-失效日期 
* @param string $emr06_02_02_011  标识号-类别代码 
* @param string $emr06_02_02_012  标识号-号码* 
* @param date $emr06_02_02_013  标识号-生效日期 
* @param date $emr06_02_02_014  标识号-失效日期 
* @param string $emr06_02_02_015  标识号-提供标识的机构名称 
* @param string $emr06_02_02_016  姓名-标识对象
* @param string $emr06_02_02_017  姓名-标识对象代码
* @param string $emr06_02_02_018  姓名* 
* @param string $emr06_02_02_021  性别代码 
* @param decimal $emr06_02_02_022  年龄（岁）*
* @param string $emr06_02_02_023  国籍代码 
* @param string $emr06_02_02_024  民族代码 
* @param string $emr06_02_02_025  婚姻状况类别代码
* @param string $emr06_02_02_026  职业编码系统名称 
* @param string $emr06_02_02_027  职业代码
* @param string $emr06_02_02_028  文化程度代码 
* @param date $emr06_02_02_029  出生日期* 
* @param string $emr06_02_02_030  出生地* 
* @param string $emr06_02_02_041  机构名称
* @param string $emr06_02_02_042  机构组织机构代码
* @param string $emr06_02_02_043  机构负责人（法人）
* @param string $emr06_02_02_044  机构地址
* @param string $emr06_02_02_045  科室名称
* @param string $emr06_02_02_046  机构角色
* @param string $emr06_02_02_047  机构角色代码
* @param string $emr06_02_02_051  服务者姓名*
* @param string $emr06_02_02_052  服务者职责（角色）
* @param string $emr06_02_02_053  服务者职责（角色）代码
* @param string $emr06_02_02_054  服务者医师资格标志*
* @param string $emr06_02_02_055  服务者学历
* @param string $emr06_02_02_056  服务者所学专业*
* @param string $emr06_02_02_057  服务者专业技术职称*
* @param string $emr06_02_02_058  服务者职务*
* @param string $emr06_02_02_061  诊断机构名称
* @param date $emr06_02_02_062  诊断日期
* @param string $emr06_02_02_063  诊断类别
* @param string $emr06_02_02_064  诊断类别代码
* @param string $emr06_02_02_065  诊断顺位（从属关系）代码
* @param string $emr06_02_02_066  疾病名称
* @param string $emr06_02_02_067  疾病代码
* @param string $emr06_02_02_068  诊断依据
* @param string $emr06_02_02_069  诊断依据代码
* @param string $emr06_02_02_071  护理等级
* @param string $emr06_02_02_072  护理类型代码
* @param string $emr06_02_02_073  护理操作名称
* @param string $emr06_02_02_074  护理操作项目类目名称
* @param string $emr06_02_02_075  护理操作结果
* @return boolean
*/
function update_emr06_02($ws_id,$org_id,$doctor_id,$identity_number,$emr06_02_02_001='',$emr06_02_02_002='',$emr06_02_02_003='',$emr06_02_02_004='',$emr06_02_02_005='',$emr06_02_02_006='',$emr06_02_02_007='',$emr06_02_02_011='',$emr06_02_02_012='',$emr06_02_02_013='',$emr06_02_02_014='',$emr06_02_02_015='',$emr06_02_02_016='',$emr06_02_02_017='',$emr06_02_02_018='',$emr06_02_02_021='',$emr06_02_02_022=0,$emr06_02_02_023='',$emr06_02_02_024='',$emr06_02_02_025='',$emr06_02_02_026='',$emr06_02_02_027='',$emr06_02_02_028='',$emr06_02_02_029='',$emr06_02_02_030='',$emr06_02_02_041='',$emr06_02_02_042='',$emr06_02_02_043='',$emr06_02_02_044='',$emr06_02_02_045='',$emr06_02_02_046='',$emr06_02_02_047='',$emr06_02_02_051='',$emr06_02_02_052='',$emr06_02_02_053='',$emr06_02_02_054='',$emr06_02_02_055='',$emr06_02_02_056='',$emr06_02_02_057='',$emr06_02_02_058='',$emr06_02_02_061='',$emr06_02_02_062='',$emr06_02_02_063='',$emr06_02_02_064='',$emr06_02_02_065='',$emr06_02_02_066='',$emr06_02_02_067='',$emr06_02_02_068='',$emr06_02_02_069='',$emr06_02_02_071='',$emr06_02_02_072='',$emr06_02_02_073='',$emr06_02_02_074='',$emr06_02_02_075=''){
require_once(__SITEROOT.'library/Models/ws_emr06_02.php');
$table_obj="Tws_emr06_02";
$ws_emr06_02=new $table_obj();
$ws_emr06_02 -> ws_id=$ws_id;
$ws_emr06_02 -> uuid=uniqid('',true);
$ws_emr06_02 -> created=time();
$ws_emr06_02 -> org_id=$org_id;
$ws_emr06_02 -> doctor_id=$doctor_id;
$ws_emr06_02 -> identity_number=$identity_number;//身份证号
$ws_emr06_02 -> action='insert';
$ws_emr06_02->emr06_02_02_001 = $emr06_02_02_001; //文档标识-名称  
$ws_emr06_02->emr06_02_02_002 = $emr06_02_02_002; //文档标识-类别代码 
$ws_emr06_02->emr06_02_02_003 = $emr06_02_02_003; //文档标识-管理机构名称 
$ws_emr06_02->emr06_02_02_004 = $emr06_02_02_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr06_02->emr06_02_02_005 = $emr06_02_02_005; //文档标识-号码  
$ws_emr06_02 ->emr06_02_02_006 = empty($emr06_02_02_006)?null : $ws_emr06_02 ->escape('emr06_02_02_006',to_date($emr06_02_02_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr06_02 ->emr06_02_02_007 = empty($emr06_02_02_007)?null : $ws_emr06_02 ->escape('emr06_02_02_007',to_date($emr06_02_02_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr06_02->emr06_02_02_011 = $emr06_02_02_011; //标识号-类别代码  
$ws_emr06_02->emr06_02_02_012 = $emr06_02_02_012; //标识号-号码*  
$ws_emr06_02 ->emr06_02_02_013 = empty($emr06_02_02_013)?null : $ws_emr06_02 ->escape('emr06_02_02_013',to_date($emr06_02_02_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr06_02 ->emr06_02_02_014 = empty($emr06_02_02_014)?null : $ws_emr06_02 ->escape('emr06_02_02_014',to_date($emr06_02_02_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr06_02->emr06_02_02_015 = $emr06_02_02_015; //标识号-提供标识的机构名称  
$ws_emr06_02->emr06_02_02_016 = $emr06_02_02_016; //姓名-标识对象 
$ws_emr06_02->emr06_02_02_017 = $emr06_02_02_017; //姓名-标识对象代码 
$ws_emr06_02->emr06_02_02_018 = $emr06_02_02_018; //姓名*  
$ws_emr06_02->emr06_02_02_021 = $emr06_02_02_021; //性别代码  
$ws_emr06_02->emr06_02_02_022 = $emr06_02_02_022; //年龄（岁）* 
$ws_emr06_02->emr06_02_02_023 = $emr06_02_02_023; //国籍代码  
$ws_emr06_02->emr06_02_02_024 = $emr06_02_02_024; //民族代码  
$ws_emr06_02->emr06_02_02_025 = $emr06_02_02_025; //婚姻状况类别代码 
$ws_emr06_02->emr06_02_02_026 = $emr06_02_02_026; //职业编码系统名称  
$ws_emr06_02->emr06_02_02_027 = $emr06_02_02_027; //职业代码 
$ws_emr06_02->emr06_02_02_028 = $emr06_02_02_028; //文化程度代码  
$ws_emr06_02 ->emr06_02_02_029 = empty($emr06_02_02_029)?null : $ws_emr06_02 ->escape('emr06_02_02_029',to_date($emr06_02_02_029,'YYYY-MM-DD')); //出生日期*  
$ws_emr06_02->emr06_02_02_030 = $emr06_02_02_030; //出生地*  
$ws_emr06_02->emr06_02_02_041 = $emr06_02_02_041; //机构名称 
$ws_emr06_02->emr06_02_02_042 = $emr06_02_02_042; //机构组织机构代码 
$ws_emr06_02->emr06_02_02_043 = $emr06_02_02_043; //机构负责人（法人） 
$ws_emr06_02->emr06_02_02_044 = $emr06_02_02_044; //机构地址 
$ws_emr06_02->emr06_02_02_045 = $emr06_02_02_045; //科室名称 
$ws_emr06_02->emr06_02_02_046 = $emr06_02_02_046; //机构角色 
$ws_emr06_02->emr06_02_02_047 = $emr06_02_02_047; //机构角色代码 
$ws_emr06_02->emr06_02_02_051 = $emr06_02_02_051; //服务者姓名* 
$ws_emr06_02->emr06_02_02_052 = $emr06_02_02_052; //服务者职责（角色） 
$ws_emr06_02->emr06_02_02_053 = $emr06_02_02_053; //服务者职责（角色）代码 
$ws_emr06_02->emr06_02_02_054 = $emr06_02_02_054; //服务者医师资格标志* 
$ws_emr06_02->emr06_02_02_055 = $emr06_02_02_055; //服务者学历 
$ws_emr06_02->emr06_02_02_056 = $emr06_02_02_056; //服务者所学专业* 
$ws_emr06_02->emr06_02_02_057 = $emr06_02_02_057; //服务者专业技术职称* 
$ws_emr06_02->emr06_02_02_058 = $emr06_02_02_058; //服务者职务* 
$ws_emr06_02->emr06_02_02_061 = $emr06_02_02_061; //诊断机构名称 
$ws_emr06_02 ->emr06_02_02_062 = empty($emr06_02_02_062)?null : $ws_emr06_02 ->escape('emr06_02_02_062',to_date($emr06_02_02_062,'YYYY-MM-DD')); //诊断日期 
$ws_emr06_02->emr06_02_02_063 = $emr06_02_02_063; //诊断类别 
$ws_emr06_02->emr06_02_02_064 = $emr06_02_02_064; //诊断类别代码 
$ws_emr06_02->emr06_02_02_065 = $emr06_02_02_065; //诊断顺位（从属关系）代码 
$ws_emr06_02->emr06_02_02_066 = $emr06_02_02_066; //疾病名称 
$ws_emr06_02->emr06_02_02_067 = $emr06_02_02_067; //疾病代码 
$ws_emr06_02->emr06_02_02_068 = $emr06_02_02_068; //诊断依据 
$ws_emr06_02->emr06_02_02_069 = $emr06_02_02_069; //诊断依据代码 
$ws_emr06_02->emr06_02_02_071 = $emr06_02_02_071; //护理等级 
$ws_emr06_02->emr06_02_02_072 = $emr06_02_02_072; //护理类型代码 
$ws_emr06_02->emr06_02_02_073 = $emr06_02_02_073; //护理操作名称 
$ws_emr06_02->emr06_02_02_074 = $emr06_02_02_074; //护理操作项目类目名称 
$ws_emr06_02->emr06_02_02_075 = $emr06_02_02_075; //护理操作结果 
if($ws_emr06_02 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr06_02 ->free_statement();
}
