<?php
/**
电子病历基础模板：住院病案首页数据集EMR08.00电子病历基础模板：住院病案首页数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr08_00_01_001  文档标识-名称 
* @param string $emr08_00_01_002  文档标识-类别代码
* @param string $emr08_00_01_003  文档标识-管理机构名称
* @param string $emr08_00_01_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr08_00_01_005  文档标识-号码 
* @param date $emr08_00_01_006  文档标识-生效日期 
* @param date $emr08_00_01_007  文档标识-失效日期 
* @param string $emr08_00_01_011  姓名-标识对象 
* @param string $emr08_00_01_012  姓名-标识对象代码 
* @param string $emr08_00_01_013  姓名* 
* @param string $emr08_00_01_014  标识号-类别代码 
* @param string $emr08_00_01_015  标识号-号码* 
* @param date $emr08_00_01_016  标识号-生效日期 
* @param date $emr08_00_01_017  标识号-失效日期 
* @param string $emr08_00_01_018  标识号-提供标识的机构名称 
* @param string $emr08_00_01_021  ABO血型
* @param string $emr08_00_01_022  RH血型
* @param date $emr08_00_01_031  出生日期 *
* @param string $emr08_00_01_032  出生地* 
* @param string $emr08_00_01_033  性别代码 
* @param decimal $emr08_00_01_034  年龄（岁）*
* @param string $emr08_00_01_035  国籍代码 
* @param string $emr08_00_01_036  民族代码 
* @param string $emr08_00_01_037  婚姻状况类别代码
* @param string $emr08_00_01_038  职业编码系统名称 
* @param string $emr08_00_01_039  职业代码
* @param string $emr08_00_01_040  文化程度代码 
* @param string $emr08_00_01_051  姓名-标识对象 
* @param string $emr08_00_01_052  姓名-标识对象代码 
* @param string $emr08_00_01_053  姓名 *
* @param string $emr08_00_01_054  标识号-类别代码 
* @param string $emr08_00_01_055  标识号-号码 *
* @param date $emr08_00_01_056  标识号-生效日期 
* @param date $emr08_00_01_057  标识号-失效日期 
* @param string $emr08_00_01_058  标识号-提供标识的机构名称 
* @param string $emr08_00_01_061  标识地址类别的代码 
* @param string $emr08_00_01_062  地址-省（自治区、直辖市）*
* @param string $emr08_00_01_063  地址-市（地区）*
* @param string $emr08_00_01_064  地址-县（区）*
* @param string $emr08_00_01_065  地址-乡（镇、街道办事处）*
* @param string $emr08_00_01_066  地址-村（街、路、弄等）*
* @param string $emr08_00_01_067  地址-门牌号码*
* @param string $emr08_00_01_068  邮政编码 *
* @param string $emr08_00_01_069  行政区划代码 *
* @param string $emr08_00_01_070  工作单位名称 *
* @param string $emr08_00_01_081  联系电话-类别*
* @param string $emr08_00_01_082  联系电话-类别代码*
* @param string $emr08_00_01_083  联系电话-号码*
* @param string $emr08_00_01_084  电子邮件地址*
* @param string $emr08_00_01_091  医疗保险-类别
* @param string $emr08_00_01_092  医疗保险-类别代码
* @param string $emr08_00_01_101  机构名称
* @param string $emr08_00_01_102  机构组织机构代码
* @param string $emr08_00_01_103  机构负责人（法人）
* @param string $emr08_00_01_104  机构地址
* @param string $emr08_00_01_105  科室名称
* @param string $emr08_00_01_106  机构角色
* @param string $emr08_00_01_107  机构角色代码
* @param string $emr08_00_01_111  服务者姓名*
* @param string $emr08_00_01_112  服务者职责（角色）
* @param string $emr08_00_01_113  服务者职责（角色）代码
* @param string $emr08_00_01_114  服务者医师资格标志*
* @param string $emr08_00_01_115  服务者学历*
* @param string $emr08_00_01_116  服务者所学专业*
* @param string $emr08_00_01_117  服务者专业技术职称*
* @param string $emr08_00_01_118  服务者职务*
* @param string $emr08_00_01_121  卫生事件(动作)名称
* @param string $emr08_00_01_122  事件分类代码
* @param string $emr08_00_01_123  事件开始时间
* @param string $emr08_00_01_124  事件结束时间
* @param date $emr08_00_01_125  事件发生地点
* @param date $emr08_00_01_126  事件发生场所
* @param string $emr08_00_01_127  事件参与方
* @param string $emr08_00_01_128  事件发生原因
* @param string $emr08_00_01_129  事件结局
* @param string $emr08_00_01_131  观察-类别
* @param string $emr08_00_01_132  观察-类别代码
* @param string $emr08_00_01_133  观察项目名称
* @param string $emr08_00_01_134  观察-项目代码
* @param string $emr08_00_01_135  观察-结果描述
* @param decimal $emr08_00_01_136  观察-结果(数值)
* @param string $emr08_00_01_137  观察-计量单位
* @param string $emr08_00_01_138  观察-结果代码
* @param string $emr08_00_01_148  诊断机构名称
* @param string $emr08_00_01_149  诊断日期
* @param string $emr08_00_01_150  诊断类别
* @param string $emr08_00_01_151  诊断类别代码
* @param string $emr08_00_01_152  诊断顺位（从属关系）代码
* @param string $emr08_00_01_153  疾病名称
* @param string $emr08_00_01_154  疾病代码
* @param string $emr08_00_01_155  诊断依据
* @param date $emr08_00_01_156  诊断依据代码
* @param string $emr08_00_01_161  操作名称
* @param string $emr08_00_01_162  操作编码体系名称
* @param string $emr08_00_01_163  操作编码
* @param string $emr08_00_01_164  操作部位名称
* @param string $emr08_00_01_165  操作部位编码体系名称
* @param string $emr08_00_01_166  操作部位编码
* @param string $emr08_00_01_167  介入物名称
* @param decimal $emr08_00_01_168  操作方法
* @param dateTime $emr08_00_01_169  操作次数
* @param string $emr08_00_01_170  操作日期/时间
* @param string $emr08_00_01_181  麻醉观察项目类目名称
* @param string $emr08_00_01_182  麻醉观察结果
* @param string $emr08_00_01_191  住院期间输血品种代码
* @param decimal $emr08_00_01_192  住院期间输血量
* @param string $emr08_00_01_193  住院患者输血量计量单位
* @param string $emr08_00_01_194  住院患者输血反应标志
* @param dateTime $emr08_00_01_195  输血日期时间
* @param string $emr08_00_01_196  输血方法
* @param string $emr08_00_01_201  拟做的检查
* @param string $emr08_00_01_202  拟做的医学检验
* @param string $emr08_00_01_203  今后治疗方案
* @param boolean $emr08_00_01_204  随访标志
* @param decimal $emr08_00_01_205  随访间隔（随诊期限）
* @param string $emr08_00_01_206  医嘱
* @param string $emr08_00_01_207  特别注意事项
* @param string $emr08_00_01_211  住院患者治疗结果代码
* @param decimal $emr08_00_01_212  住院患者抢救次数
* @param decimal $emr08_00_01_213  住院患者抢救成功次数
* @param string $emr08_00_01_214  手术切口愈合等级代码
* @param string $emr08_00_01_215  患者去向代码
* @param string $emr08_00_01_221  患者疾病诊断对照
* @param string $emr08_00_01_222  住院患者疾病诊断对照代码
* @param string $emr08_00_01_223  住院患者诊断符合情况-详细描述
* @param string $emr08_00_01_224  住院患者诊断符合情况-代码
* @param string $emr08_00_01_225  住院病例病案质量代码
* @param decimal $emr08_00_01_226  入院后诊断时间（天）
* @param string $emr08_00_01_231  诊疗过程名称
* @param string $emr08_00_01_232  诊疗过程描述
* @param string $emr08_00_01_241  门诊费用-分类
* @param string $emr08_00_01_242  门诊费用-分类代码
* @param decimal $emr08_00_01_243  门诊费用-金额（元/人民币）
* @param string $emr08_00_01_244  门诊费用-支付方式代码
* @param string $emr08_00_01_245  住院费用-分类
* @param string $emr08_00_01_246  住院费用-分类代码
* @param decimal $emr08_00_01_247  住院费用-金额（元/人民币）
* @param string $emr08_00_01_248  住院费用-医疗付款方式代码
* @param decimal $emr08_00_01_249  个人承担费用（元）
* @return boolean
*/
function update_emr08_00($ws_id,$org_id,$doctor_id,$identity_number,$emr08_00_01_001='',$emr08_00_01_002='',$emr08_00_01_003='',$emr08_00_01_004='',$emr08_00_01_005='',$emr08_00_01_006='',$emr08_00_01_007='',$emr08_00_01_011='',$emr08_00_01_012='',$emr08_00_01_013='',$emr08_00_01_014='',$emr08_00_01_015='',$emr08_00_01_016='',$emr08_00_01_017='',$emr08_00_01_018='',$emr08_00_01_021='',$emr08_00_01_022='',$emr08_00_01_031='',$emr08_00_01_032='',$emr08_00_01_033='',$emr08_00_01_034=0,$emr08_00_01_035='',$emr08_00_01_036='',$emr08_00_01_037='',$emr08_00_01_038='',$emr08_00_01_039='',$emr08_00_01_040='',$emr08_00_01_051='',$emr08_00_01_052='',$emr08_00_01_053='',$emr08_00_01_054='',$emr08_00_01_055='',$emr08_00_01_056='',$emr08_00_01_057='',$emr08_00_01_058='',$emr08_00_01_061='',$emr08_00_01_062='',$emr08_00_01_063='',$emr08_00_01_064='',$emr08_00_01_065='',$emr08_00_01_066='',$emr08_00_01_067='',$emr08_00_01_068='',$emr08_00_01_069='',$emr08_00_01_070='',$emr08_00_01_081='',$emr08_00_01_082='',$emr08_00_01_083='',$emr08_00_01_084='',$emr08_00_01_091='',$emr08_00_01_092='',$emr08_00_01_101='',$emr08_00_01_102='',$emr08_00_01_103='',$emr08_00_01_104='',$emr08_00_01_105='',$emr08_00_01_106='',$emr08_00_01_107='',$emr08_00_01_111='',$emr08_00_01_112='',$emr08_00_01_113='',$emr08_00_01_114='',$emr08_00_01_115='',$emr08_00_01_116='',$emr08_00_01_117='',$emr08_00_01_118='',$emr08_00_01_121='',$emr08_00_01_122='',$emr08_00_01_123='',$emr08_00_01_124='',$emr08_00_01_125='',$emr08_00_01_126='',$emr08_00_01_127='',$emr08_00_01_128='',$emr08_00_01_129='',$emr08_00_01_131='',$emr08_00_01_132='',$emr08_00_01_133='',$emr08_00_01_134='',$emr08_00_01_135='',$emr08_00_01_136=0,$emr08_00_01_137='',$emr08_00_01_138='',$emr08_00_01_148='',$emr08_00_01_149='',$emr08_00_01_150='',$emr08_00_01_151='',$emr08_00_01_152='',$emr08_00_01_153='',$emr08_00_01_154='',$emr08_00_01_155='',$emr08_00_01_156='',$emr08_00_01_161='',$emr08_00_01_162='',$emr08_00_01_163='',$emr08_00_01_164='',$emr08_00_01_165='',$emr08_00_01_166='',$emr08_00_01_167='',$emr08_00_01_168=0,$emr08_00_01_169='',$emr08_00_01_170='',$emr08_00_01_181='',$emr08_00_01_182='',$emr08_00_01_191='',$emr08_00_01_192=0,$emr08_00_01_193='',$emr08_00_01_194='',$emr08_00_01_195='',$emr08_00_01_196='',$emr08_00_01_201='',$emr08_00_01_202='',$emr08_00_01_203='',$emr08_00_01_204=false,$emr08_00_01_205=0,$emr08_00_01_206='',$emr08_00_01_207='',$emr08_00_01_211='',$emr08_00_01_212=0,$emr08_00_01_213=0,$emr08_00_01_214='',$emr08_00_01_215='',$emr08_00_01_221='',$emr08_00_01_222='',$emr08_00_01_223='',$emr08_00_01_224='',$emr08_00_01_225='',$emr08_00_01_226=0,$emr08_00_01_231='',$emr08_00_01_232='',$emr08_00_01_241='',$emr08_00_01_242='',$emr08_00_01_243=0,$emr08_00_01_244='',$emr08_00_01_245='',$emr08_00_01_246='',$emr08_00_01_247=0,$emr08_00_01_248='',$emr08_00_01_249=0){
require_once(__SITEROOT.'library/Models/ws_emr08_00.php');
$table_obj="Tws_emr08_00";
$ws_emr08_00=new $table_obj();
$ws_emr08_00 -> ws_id=$ws_id;
$ws_emr08_00 -> uuid=uniqid('',true);
$ws_emr08_00 -> created=time();
$ws_emr08_00 -> org_id=$org_id;
$ws_emr08_00 -> doctor_id=$doctor_id;
$ws_emr08_00 -> identity_number=$identity_number;//身份证号
$ws_emr08_00 -> action='insert';
$ws_emr08_00->emr08_00_01_001 = $emr08_00_01_001; //文档标识-名称  
$ws_emr08_00->emr08_00_01_002 = $emr08_00_01_002; //文档标识-类别代码 
$ws_emr08_00->emr08_00_01_003 = $emr08_00_01_003; //文档标识-管理机构名称 
$ws_emr08_00->emr08_00_01_004 = $emr08_00_01_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr08_00->emr08_00_01_005 = $emr08_00_01_005; //文档标识-号码  
$ws_emr08_00 ->emr08_00_01_006 = empty($emr08_00_01_006)?null : $ws_emr08_00 ->escape('emr08_00_01_006',to_date($emr08_00_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr08_00 ->emr08_00_01_007 = empty($emr08_00_01_007)?null : $ws_emr08_00 ->escape('emr08_00_01_007',to_date($emr08_00_01_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr08_00->emr08_00_01_011 = $emr08_00_01_011; //姓名-标识对象  
$ws_emr08_00->emr08_00_01_012 = $emr08_00_01_012; //姓名-标识对象代码  
$ws_emr08_00->emr08_00_01_013 = $emr08_00_01_013; //姓名*  
$ws_emr08_00->emr08_00_01_014 = $emr08_00_01_014; //标识号-类别代码  
$ws_emr08_00->emr08_00_01_015 = $emr08_00_01_015; //标识号-号码*  
$ws_emr08_00 ->emr08_00_01_016 = empty($emr08_00_01_016)?null : $ws_emr08_00 ->escape('emr08_00_01_016',to_date($emr08_00_01_016,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr08_00 ->emr08_00_01_017 = empty($emr08_00_01_017)?null : $ws_emr08_00 ->escape('emr08_00_01_017',to_date($emr08_00_01_017,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr08_00->emr08_00_01_018 = $emr08_00_01_018; //标识号-提供标识的机构名称  
$ws_emr08_00->emr08_00_01_021 = $emr08_00_01_021; //ABO血型 
$ws_emr08_00->emr08_00_01_022 = $emr08_00_01_022; //RH血型 
$ws_emr08_00 ->emr08_00_01_031 = empty($emr08_00_01_031)?null : $ws_emr08_00 ->escape('emr08_00_01_031',to_date($emr08_00_01_031,'YYYY-MM-DD')); //出生日期 * 
$ws_emr08_00->emr08_00_01_032 = $emr08_00_01_032; //出生地*  
$ws_emr08_00->emr08_00_01_033 = $emr08_00_01_033; //性别代码  
$ws_emr08_00->emr08_00_01_034 = $emr08_00_01_034; //年龄（岁）* 
$ws_emr08_00->emr08_00_01_035 = $emr08_00_01_035; //国籍代码  
$ws_emr08_00->emr08_00_01_036 = $emr08_00_01_036; //民族代码  
$ws_emr08_00->emr08_00_01_037 = $emr08_00_01_037; //婚姻状况类别代码 
$ws_emr08_00->emr08_00_01_038 = $emr08_00_01_038; //职业编码系统名称  
$ws_emr08_00->emr08_00_01_039 = $emr08_00_01_039; //职业代码 
$ws_emr08_00->emr08_00_01_040 = $emr08_00_01_040; //文化程度代码  
$ws_emr08_00->emr08_00_01_051 = $emr08_00_01_051; //姓名-标识对象  
$ws_emr08_00->emr08_00_01_052 = $emr08_00_01_052; //姓名-标识对象代码  
$ws_emr08_00->emr08_00_01_053 = $emr08_00_01_053; //姓名 * 
$ws_emr08_00->emr08_00_01_054 = $emr08_00_01_054; //标识号-类别代码  
$ws_emr08_00->emr08_00_01_055 = $emr08_00_01_055; //标识号-号码 * 
$ws_emr08_00 ->emr08_00_01_056 = empty($emr08_00_01_056)?null : $ws_emr08_00 ->escape('emr08_00_01_056',to_date($emr08_00_01_056,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr08_00 ->emr08_00_01_057 = empty($emr08_00_01_057)?null : $ws_emr08_00 ->escape('emr08_00_01_057',to_date($emr08_00_01_057,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr08_00->emr08_00_01_058 = $emr08_00_01_058; //标识号-提供标识的机构名称  
$ws_emr08_00->emr08_00_01_061 = $emr08_00_01_061; //标识地址类别的代码  
$ws_emr08_00->emr08_00_01_062 = $emr08_00_01_062; //地址-省（自治区、直辖市）* 
$ws_emr08_00->emr08_00_01_063 = $emr08_00_01_063; //地址-市（地区）* 
$ws_emr08_00->emr08_00_01_064 = $emr08_00_01_064; //地址-县（区）* 
$ws_emr08_00->emr08_00_01_065 = $emr08_00_01_065; //地址-乡（镇、街道办事处）* 
$ws_emr08_00->emr08_00_01_066 = $emr08_00_01_066; //地址-村（街、路、弄等）* 
$ws_emr08_00->emr08_00_01_067 = $emr08_00_01_067; //地址-门牌号码* 
$ws_emr08_00->emr08_00_01_068 = $emr08_00_01_068; //邮政编码 * 
$ws_emr08_00->emr08_00_01_069 = $emr08_00_01_069; //行政区划代码 * 
$ws_emr08_00->emr08_00_01_070 = $emr08_00_01_070; //工作单位名称 * 
$ws_emr08_00->emr08_00_01_081 = $emr08_00_01_081; //联系电话-类别* 
$ws_emr08_00->emr08_00_01_082 = $emr08_00_01_082; //联系电话-类别代码* 
$ws_emr08_00->emr08_00_01_083 = $emr08_00_01_083; //联系电话-号码* 
$ws_emr08_00->emr08_00_01_084 = $emr08_00_01_084; //电子邮件地址* 
$ws_emr08_00->emr08_00_01_091 = $emr08_00_01_091; //医疗保险-类别 
$ws_emr08_00->emr08_00_01_092 = $emr08_00_01_092; //医疗保险-类别代码 
$ws_emr08_00->emr08_00_01_101 = $emr08_00_01_101; //机构名称 
$ws_emr08_00->emr08_00_01_102 = $emr08_00_01_102; //机构组织机构代码 
$ws_emr08_00->emr08_00_01_103 = $emr08_00_01_103; //机构负责人（法人） 
$ws_emr08_00->emr08_00_01_104 = $emr08_00_01_104; //机构地址 
$ws_emr08_00->emr08_00_01_105 = $emr08_00_01_105; //科室名称 
$ws_emr08_00->emr08_00_01_106 = $emr08_00_01_106; //机构角色 
$ws_emr08_00->emr08_00_01_107 = $emr08_00_01_107; //机构角色代码 
$ws_emr08_00->emr08_00_01_111 = $emr08_00_01_111; //服务者姓名* 
$ws_emr08_00->emr08_00_01_112 = $emr08_00_01_112; //服务者职责（角色） 
$ws_emr08_00->emr08_00_01_113 = $emr08_00_01_113; //服务者职责（角色）代码 
$ws_emr08_00->emr08_00_01_114 = $emr08_00_01_114; //服务者医师资格标志* 
$ws_emr08_00->emr08_00_01_115 = $emr08_00_01_115; //服务者学历* 
$ws_emr08_00->emr08_00_01_116 = $emr08_00_01_116; //服务者所学专业* 
$ws_emr08_00->emr08_00_01_117 = $emr08_00_01_117; //服务者专业技术职称* 
$ws_emr08_00->emr08_00_01_118 = $emr08_00_01_118; //服务者职务* 
$ws_emr08_00->emr08_00_01_121 = $emr08_00_01_121; //卫生事件(动作)名称 
$ws_emr08_00->emr08_00_01_122 = $emr08_00_01_122; //事件分类代码 
$ws_emr08_00->emr08_00_01_123 = $emr08_00_01_123; //事件开始时间 
$ws_emr08_00->emr08_00_01_124 = $emr08_00_01_124; //事件结束时间 
$ws_emr08_00 ->emr08_00_01_125 = empty($emr08_00_01_125)?null : $ws_emr08_00 ->escape('emr08_00_01_125',to_date($emr08_00_01_125,'YYYY-MM-DD')); //事件发生地点 
$ws_emr08_00 ->emr08_00_01_126 = empty($emr08_00_01_126)?null : $ws_emr08_00 ->escape('emr08_00_01_126',to_date($emr08_00_01_126,'YYYY-MM-DD')); //事件发生场所 
$ws_emr08_00->emr08_00_01_127 = $emr08_00_01_127; //事件参与方 
$ws_emr08_00->emr08_00_01_128 = $emr08_00_01_128; //事件发生原因 
$ws_emr08_00->emr08_00_01_129 = $emr08_00_01_129; //事件结局 
$ws_emr08_00->emr08_00_01_131 = $emr08_00_01_131; //观察-类别 
$ws_emr08_00->emr08_00_01_132 = $emr08_00_01_132; //观察-类别代码 
$ws_emr08_00->emr08_00_01_133 = $emr08_00_01_133; //观察项目名称 
$ws_emr08_00->emr08_00_01_134 = $emr08_00_01_134; //观察-项目代码 
$ws_emr08_00->emr08_00_01_135 = $emr08_00_01_135; //观察-结果描述 
$ws_emr08_00->emr08_00_01_136 = $emr08_00_01_136; //观察-结果(数值) 
$ws_emr08_00->emr08_00_01_137 = $emr08_00_01_137; //观察-计量单位 
$ws_emr08_00->emr08_00_01_138 = $emr08_00_01_138; //观察-结果代码 
$ws_emr08_00->emr08_00_01_148 = $emr08_00_01_148; //诊断机构名称 
$ws_emr08_00->emr08_00_01_149 = $emr08_00_01_149; //诊断日期 
$ws_emr08_00->emr08_00_01_150 = $emr08_00_01_150; //诊断类别 
$ws_emr08_00->emr08_00_01_151 = $emr08_00_01_151; //诊断类别代码 
$ws_emr08_00->emr08_00_01_152 = $emr08_00_01_152; //诊断顺位（从属关系）代码 
$ws_emr08_00->emr08_00_01_153 = $emr08_00_01_153; //疾病名称 
$ws_emr08_00->emr08_00_01_154 = $emr08_00_01_154; //疾病代码 
$ws_emr08_00->emr08_00_01_155 = $emr08_00_01_155; //诊断依据 
$ws_emr08_00 ->emr08_00_01_156 = empty($emr08_00_01_156)?null : $ws_emr08_00 ->escape('emr08_00_01_156',to_date($emr08_00_01_156,'YYYY-MM-DD')); //诊断依据代码 
$ws_emr08_00->emr08_00_01_161 = $emr08_00_01_161; //操作名称 
$ws_emr08_00->emr08_00_01_162 = $emr08_00_01_162; //操作编码体系名称 
$ws_emr08_00->emr08_00_01_163 = $emr08_00_01_163; //操作编码 
$ws_emr08_00->emr08_00_01_164 = $emr08_00_01_164; //操作部位名称 
$ws_emr08_00->emr08_00_01_165 = $emr08_00_01_165; //操作部位编码体系名称 
$ws_emr08_00->emr08_00_01_166 = $emr08_00_01_166; //操作部位编码 
$ws_emr08_00->emr08_00_01_167 = $emr08_00_01_167; //介入物名称 
$ws_emr08_00->emr08_00_01_168 = $emr08_00_01_168; //操作方法 
$ws_emr08_00 ->emr08_00_01_169 = empty($emr08_00_01_169)?null : $ws_emr08_00 ->escape('emr08_00_01_169',to_date($emr08_00_01_169,'YYYY-MM-DD')); //操作次数 
$ws_emr08_00->emr08_00_01_170 = $emr08_00_01_170; //操作日期/时间 
$ws_emr08_00->emr08_00_01_181 = $emr08_00_01_181; //麻醉观察项目类目名称 
$ws_emr08_00->emr08_00_01_182 = $emr08_00_01_182; //麻醉观察结果 
$ws_emr08_00->emr08_00_01_191 = $emr08_00_01_191; //住院期间输血品种代码 
$ws_emr08_00->emr08_00_01_192 = $emr08_00_01_192; //住院期间输血量 
$ws_emr08_00->emr08_00_01_193 = $emr08_00_01_193; //住院患者输血量计量单位 
$ws_emr08_00->emr08_00_01_194 = $emr08_00_01_194; //住院患者输血反应标志 
$ws_emr08_00 ->emr08_00_01_195 = empty($emr08_00_01_195)?null : $ws_emr08_00 ->escape('emr08_00_01_195',to_date($emr08_00_01_195,'YYYY-MM-DD')); //输血日期时间 
$ws_emr08_00->emr08_00_01_196 = $emr08_00_01_196; //输血方法 
$ws_emr08_00->emr08_00_01_201 = $emr08_00_01_201; //拟做的检查 
$ws_emr08_00->emr08_00_01_202 = $emr08_00_01_202; //拟做的医学检验 
$ws_emr08_00->emr08_00_01_203 = $emr08_00_01_203; //今后治疗方案 
$ws_emr08_00->emr08_00_01_204 = $emr08_00_01_204; //随访标志 
$ws_emr08_00->emr08_00_01_205 = $emr08_00_01_205; //随访间隔（随诊期限） 
$ws_emr08_00->emr08_00_01_206 = $emr08_00_01_206; //医嘱 
$ws_emr08_00->emr08_00_01_207 = $emr08_00_01_207; //特别注意事项 
$ws_emr08_00->emr08_00_01_211 = $emr08_00_01_211; //住院患者治疗结果代码 
$ws_emr08_00->emr08_00_01_212 = $emr08_00_01_212; //住院患者抢救次数 
$ws_emr08_00->emr08_00_01_213 = $emr08_00_01_213; //住院患者抢救成功次数 
$ws_emr08_00->emr08_00_01_214 = $emr08_00_01_214; //手术切口愈合等级代码 
$ws_emr08_00->emr08_00_01_215 = $emr08_00_01_215; //患者去向代码 
$ws_emr08_00->emr08_00_01_221 = $emr08_00_01_221; //患者疾病诊断对照 
$ws_emr08_00->emr08_00_01_222 = $emr08_00_01_222; //住院患者疾病诊断对照代码 
$ws_emr08_00->emr08_00_01_223 = $emr08_00_01_223; //住院患者诊断符合情况-详细描述 
$ws_emr08_00->emr08_00_01_224 = $emr08_00_01_224; //住院患者诊断符合情况-代码 
$ws_emr08_00->emr08_00_01_225 = $emr08_00_01_225; //住院病例病案质量代码 
$ws_emr08_00->emr08_00_01_226 = $emr08_00_01_226; //入院后诊断时间（天） 
$ws_emr08_00->emr08_00_01_231 = $emr08_00_01_231; //诊疗过程名称 
$ws_emr08_00->emr08_00_01_232 = $emr08_00_01_232; //诊疗过程描述 
$ws_emr08_00->emr08_00_01_241 = $emr08_00_01_241; //门诊费用-分类 
$ws_emr08_00->emr08_00_01_242 = $emr08_00_01_242; //门诊费用-分类代码 
$ws_emr08_00->emr08_00_01_243 = $emr08_00_01_243; //门诊费用-金额（元/人民币） 
$ws_emr08_00->emr08_00_01_244 = $emr08_00_01_244; //门诊费用-支付方式代码 
$ws_emr08_00->emr08_00_01_245 = $emr08_00_01_245; //住院费用-分类 
$ws_emr08_00->emr08_00_01_246 = $emr08_00_01_246; //住院费用-分类代码 
$ws_emr08_00->emr08_00_01_247 = $emr08_00_01_247; //住院费用-金额（元/人民币） 
$ws_emr08_00->emr08_00_01_248 = $emr08_00_01_248; //住院费用-医疗付款方式代码 
$ws_emr08_00->emr08_00_01_249 = $emr08_00_01_249; //个人承担费用（元） 
if($ws_emr08_00 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr08_00 ->free_statement();
}
