<?php
/**
电子病历基础模板：出院记录数据集EMR12.00电子病历基础模板：出院记录数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr12_00_01_001  文档标识-名称 
* @param string $emr12_00_01_002  文档标识-类别代码
* @param string $emr12_00_01_003  文档标识-管理机构名称
* @param string $emr12_00_01_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr12_00_01_005  文档标识-号码 
* @param date $emr12_00_01_006  文档标识-生效日期 
* @param date $emr12_00_01_007  文档标识-失效日期 
* @param string $emr12_00_01_011  标识号-类别代码 
* @param string $emr12_00_01_012  标识号-号码 
* @param date $emr12_00_01_013  标识号-生效日期 
* @param date $emr12_00_01_014  标识号-失效日期 
* @param string $emr12_00_01_015  标识号-提供标识的机构名称 
* @param string $emr12_00_01_016  姓名-标识对象*
* @param string $emr12_00_01_017  姓名-标识对象代码
* @param string $emr12_00_01_018  姓名* 
* @param string $emr12_00_01_021  性别代码 
* @param decimal $emr12_00_01_022  年龄（岁）*
* @param string $emr12_00_01_023  国籍代码 
* @param string $emr12_00_01_024  民族代码 
* @param string $emr12_00_01_025  婚姻状况类别代码
* @param string $emr12_00_01_026  职业编码系统名称 
* @param string $emr12_00_01_027  职业代码
* @param string $emr12_00_01_028  文化程度代码 
* @param date $emr12_00_01_029  出生日期* 
* @param string $emr12_00_01_030  出生地* 
* @param string $emr12_00_01_041  机构名称
* @param string $emr12_00_01_042  机构组织机构代码
* @param string $emr12_00_01_043  机构负责人（法人）
* @param string $emr12_00_01_044  机构地址
* @param string $emr12_00_01_045  科室名称
* @param string $emr12_00_01_046  机构角色
* @param string $emr12_00_01_047  机构角色代码
* @param string $emr12_00_01_051  服务者姓名*
* @param string $emr12_00_01_052  服务者职责（角色）*
* @param string $emr12_00_01_053  服务者职责（角色）代码
* @param string $emr12_00_01_054  服务者医师资格标志*
* @param string $emr12_00_01_055  服务者学历*
* @param string $emr12_00_01_056  服务者所学专业*
* @param string $emr12_00_01_057  服务者专业技术职称*
* @param string $emr12_00_01_058  服务者职务*
* @param string $emr12_00_01_061  卫生事件(动作)名称
* @param string $emr12_00_01_062  事件分类代码
* @param date $emr12_00_01_063  事件开始时间
* @param date $emr12_00_01_064  事件结束时间
* @param string $emr12_00_01_065  事件发生地点
* @param string $emr12_00_01_066  事件发生场所
* @param string $emr12_00_01_067  事件参与方
* @param string $emr12_00_01_068  事件发生原因
* @param string $emr12_00_01_069  事件结局
* @param string $emr12_00_01_070  观察-类别
* @param string $emr12_00_01_071  观察-类别代码
* @param string $emr12_00_01_072  观察项目名称
* @param string $emr12_00_01_073  观察-项目代码
* @param string $emr12_00_01_074  观察-结果描述
* @param decimal $emr12_00_01_075  观察-结果(数值)
* @param string $emr12_00_01_076  观察-计量单位
* @param string $emr12_00_01_077  观察-结果代码
* @param string $emr12_00_01_081  主诉
* @param string $emr12_00_01_082  症状代码编码体系名称
* @param string $emr12_00_01_083  症状代码
* @param dateTime $emr12_00_01_084  症状开始日期时间
* @param dateTime $emr12_00_01_085  症状停止日期时间
* @param string $emr12_00_01_086  症状观察项目类目名称
* @param string $emr12_00_01_087  症状观察结果
* @param string $emr12_00_01_091  观察-类别
* @param string $emr12_00_01_092  观察-类别代码
* @param string $emr12_00_01_093  观察项目名称
* @param string $emr12_00_01_094  观察-项目代码
* @param string $emr12_00_01_095  观察-结果描述
* @param decimal $emr12_00_01_096  观察-结果(数值)
* @param string $emr12_00_01_097  观察-计量单位
* @param string $emr12_00_01_098  观察-结果代码
* @param string $emr12_00_01_099  体格检查项目类目名称
* @param string $emr12_00_01_100  体格检查观察结果
* @param string $emr12_00_01_111  观察-类别
* @param string $emr12_00_01_112  观察-类别代码
* @param string $emr12_00_01_113  观察项目名称
* @param string $emr12_00_01_114  观察-项目代码
* @param string $emr12_00_01_115  观察-结果描述
* @param decimal $emr12_00_01_116  观察-结果(数值)
* @param string $emr12_00_01_117  观察-计量单位
* @param string $emr12_00_01_118  观察-结果代码
* @param string $emr12_00_01_121  诊断机构名称
* @param date $emr12_00_01_122  诊断日期
* @param string $emr12_00_01_123  诊断类别
* @param string $emr12_00_01_124  诊断类别代码
* @param string $emr12_00_01_125  诊断顺位（从属关系）代码
* @param string $emr12_00_01_126  疾病名称
* @param string $emr12_00_01_127  疾病代码
* @param string $emr12_00_01_128  诊断依据
* @param string $emr12_00_01_129  诊断依据代码
* @param string $emr12_00_01_131  诊疗过程名称
* @param string $emr12_00_01_132  诊疗过程描述
* @param dateTime $emr12_00_01_141  医嘱开嘱日期时间
* @param dateTime $emr12_00_01_142  长期医嘱停嘱日期时间
* @param dateTime $emr12_00_01_143  医嘱执行日期时间
* @param string $emr12_00_01_144  医嘱执行时间类别代码
* @param dateTime $emr12_00_01_145  医嘱取消日期时间
* @param string $emr12_00_01_146  医嘱类别
* @param string $emr12_00_01_147  医嘱内容
* @return boolean
*/
function update_emr12_00($ws_id,$org_id,$doctor_id,$identity_number,$emr12_00_01_001='',$emr12_00_01_002='',$emr12_00_01_003='',$emr12_00_01_004='',$emr12_00_01_005='',$emr12_00_01_006='',$emr12_00_01_007='',$emr12_00_01_011='',$emr12_00_01_012='',$emr12_00_01_013='',$emr12_00_01_014='',$emr12_00_01_015='',$emr12_00_01_016='',$emr12_00_01_017='',$emr12_00_01_018='',$emr12_00_01_021='',$emr12_00_01_022=0,$emr12_00_01_023='',$emr12_00_01_024='',$emr12_00_01_025='',$emr12_00_01_026='',$emr12_00_01_027='',$emr12_00_01_028='',$emr12_00_01_029='',$emr12_00_01_030='',$emr12_00_01_041='',$emr12_00_01_042='',$emr12_00_01_043='',$emr12_00_01_044='',$emr12_00_01_045='',$emr12_00_01_046='',$emr12_00_01_047='',$emr12_00_01_051='',$emr12_00_01_052='',$emr12_00_01_053='',$emr12_00_01_054='',$emr12_00_01_055='',$emr12_00_01_056='',$emr12_00_01_057='',$emr12_00_01_058='',$emr12_00_01_061='',$emr12_00_01_062='',$emr12_00_01_063='',$emr12_00_01_064='',$emr12_00_01_065='',$emr12_00_01_066='',$emr12_00_01_067='',$emr12_00_01_068='',$emr12_00_01_069='',$emr12_00_01_070='',$emr12_00_01_071='',$emr12_00_01_072='',$emr12_00_01_073='',$emr12_00_01_074='',$emr12_00_01_075=0,$emr12_00_01_076='',$emr12_00_01_077='',$emr12_00_01_081='',$emr12_00_01_082='',$emr12_00_01_083='',$emr12_00_01_084='',$emr12_00_01_085='',$emr12_00_01_086='',$emr12_00_01_087='',$emr12_00_01_091='',$emr12_00_01_092='',$emr12_00_01_093='',$emr12_00_01_094='',$emr12_00_01_095='',$emr12_00_01_096=0,$emr12_00_01_097='',$emr12_00_01_098='',$emr12_00_01_099='',$emr12_00_01_100='',$emr12_00_01_111='',$emr12_00_01_112='',$emr12_00_01_113='',$emr12_00_01_114='',$emr12_00_01_115='',$emr12_00_01_116=0,$emr12_00_01_117='',$emr12_00_01_118='',$emr12_00_01_121='',$emr12_00_01_122='',$emr12_00_01_123='',$emr12_00_01_124='',$emr12_00_01_125='',$emr12_00_01_126='',$emr12_00_01_127='',$emr12_00_01_128='',$emr12_00_01_129='',$emr12_00_01_131='',$emr12_00_01_132='',$emr12_00_01_141='',$emr12_00_01_142='',$emr12_00_01_143='',$emr12_00_01_144='',$emr12_00_01_145='',$emr12_00_01_146='',$emr12_00_01_147=''){
require_once(__SITEROOT.'library/Models/ws_emr12_00.php');
$table_obj="Tws_emr12_00";
$ws_emr12_00=new $table_obj();
$ws_emr12_00 -> ws_id=$ws_id;
$ws_emr12_00 -> uuid=uniqid('',true);
$ws_emr12_00 -> created=time();
$ws_emr12_00 -> org_id=$org_id;
$ws_emr12_00 -> doctor_id=$doctor_id;
$ws_emr12_00 -> identity_number=$identity_number;//身份证号
$ws_emr12_00 -> action='insert';
$ws_emr12_00->emr12_00_01_001 = $emr12_00_01_001; //文档标识-名称  
$ws_emr12_00->emr12_00_01_002 = $emr12_00_01_002; //文档标识-类别代码 
$ws_emr12_00->emr12_00_01_003 = $emr12_00_01_003; //文档标识-管理机构名称 
$ws_emr12_00->emr12_00_01_004 = $emr12_00_01_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr12_00->emr12_00_01_005 = $emr12_00_01_005; //文档标识-号码  
$ws_emr12_00 ->emr12_00_01_006 = empty($emr12_00_01_006)?null : $ws_emr12_00 ->escape('emr12_00_01_006',to_date($emr12_00_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr12_00 ->emr12_00_01_007 = empty($emr12_00_01_007)?null : $ws_emr12_00 ->escape('emr12_00_01_007',to_date($emr12_00_01_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr12_00->emr12_00_01_011 = $emr12_00_01_011; //标识号-类别代码  
$ws_emr12_00->emr12_00_01_012 = $emr12_00_01_012; //标识号-号码  
$ws_emr12_00 ->emr12_00_01_013 = empty($emr12_00_01_013)?null : $ws_emr12_00 ->escape('emr12_00_01_013',to_date($emr12_00_01_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr12_00 ->emr12_00_01_014 = empty($emr12_00_01_014)?null : $ws_emr12_00 ->escape('emr12_00_01_014',to_date($emr12_00_01_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr12_00->emr12_00_01_015 = $emr12_00_01_015; //标识号-提供标识的机构名称  
$ws_emr12_00->emr12_00_01_016 = $emr12_00_01_016; //姓名-标识对象* 
$ws_emr12_00->emr12_00_01_017 = $emr12_00_01_017; //姓名-标识对象代码 
$ws_emr12_00->emr12_00_01_018 = $emr12_00_01_018; //姓名*  
$ws_emr12_00->emr12_00_01_021 = $emr12_00_01_021; //性别代码  
$ws_emr12_00->emr12_00_01_022 = $emr12_00_01_022; //年龄（岁）* 
$ws_emr12_00->emr12_00_01_023 = $emr12_00_01_023; //国籍代码  
$ws_emr12_00->emr12_00_01_024 = $emr12_00_01_024; //民族代码  
$ws_emr12_00->emr12_00_01_025 = $emr12_00_01_025; //婚姻状况类别代码 
$ws_emr12_00->emr12_00_01_026 = $emr12_00_01_026; //职业编码系统名称  
$ws_emr12_00->emr12_00_01_027 = $emr12_00_01_027; //职业代码 
$ws_emr12_00->emr12_00_01_028 = $emr12_00_01_028; //文化程度代码  
$ws_emr12_00 ->emr12_00_01_029 = empty($emr12_00_01_029)?null : $ws_emr12_00 ->escape('emr12_00_01_029',to_date($emr12_00_01_029,'YYYY-MM-DD')); //出生日期*  
$ws_emr12_00->emr12_00_01_030 = $emr12_00_01_030; //出生地*  
$ws_emr12_00->emr12_00_01_041 = $emr12_00_01_041; //机构名称 
$ws_emr12_00->emr12_00_01_042 = $emr12_00_01_042; //机构组织机构代码 
$ws_emr12_00->emr12_00_01_043 = $emr12_00_01_043; //机构负责人（法人） 
$ws_emr12_00->emr12_00_01_044 = $emr12_00_01_044; //机构地址 
$ws_emr12_00->emr12_00_01_045 = $emr12_00_01_045; //科室名称 
$ws_emr12_00->emr12_00_01_046 = $emr12_00_01_046; //机构角色 
$ws_emr12_00->emr12_00_01_047 = $emr12_00_01_047; //机构角色代码 
$ws_emr12_00->emr12_00_01_051 = $emr12_00_01_051; //服务者姓名* 
$ws_emr12_00->emr12_00_01_052 = $emr12_00_01_052; //服务者职责（角色）* 
$ws_emr12_00->emr12_00_01_053 = $emr12_00_01_053; //服务者职责（角色）代码 
$ws_emr12_00->emr12_00_01_054 = $emr12_00_01_054; //服务者医师资格标志* 
$ws_emr12_00->emr12_00_01_055 = $emr12_00_01_055; //服务者学历* 
$ws_emr12_00->emr12_00_01_056 = $emr12_00_01_056; //服务者所学专业* 
$ws_emr12_00->emr12_00_01_057 = $emr12_00_01_057; //服务者专业技术职称* 
$ws_emr12_00->emr12_00_01_058 = $emr12_00_01_058; //服务者职务* 
$ws_emr12_00->emr12_00_01_061 = $emr12_00_01_061; //卫生事件(动作)名称 
$ws_emr12_00->emr12_00_01_062 = $emr12_00_01_062; //事件分类代码 
$ws_emr12_00 ->emr12_00_01_063 = empty($emr12_00_01_063)?null : $ws_emr12_00 ->escape('emr12_00_01_063',to_date($emr12_00_01_063,'YYYY-MM-DD')); //事件开始时间 
$ws_emr12_00 ->emr12_00_01_064 = empty($emr12_00_01_064)?null : $ws_emr12_00 ->escape('emr12_00_01_064',to_date($emr12_00_01_064,'YYYY-MM-DD')); //事件结束时间 
$ws_emr12_00->emr12_00_01_065 = $emr12_00_01_065; //事件发生地点 
$ws_emr12_00->emr12_00_01_066 = $emr12_00_01_066; //事件发生场所 
$ws_emr12_00->emr12_00_01_067 = $emr12_00_01_067; //事件参与方 
$ws_emr12_00->emr12_00_01_068 = $emr12_00_01_068; //事件发生原因 
$ws_emr12_00->emr12_00_01_069 = $emr12_00_01_069; //事件结局 
$ws_emr12_00->emr12_00_01_070 = $emr12_00_01_070; //观察-类别 
$ws_emr12_00->emr12_00_01_071 = $emr12_00_01_071; //观察-类别代码 
$ws_emr12_00->emr12_00_01_072 = $emr12_00_01_072; //观察项目名称 
$ws_emr12_00->emr12_00_01_073 = $emr12_00_01_073; //观察-项目代码 
$ws_emr12_00->emr12_00_01_074 = $emr12_00_01_074; //观察-结果描述 
$ws_emr12_00->emr12_00_01_075 = $emr12_00_01_075; //观察-结果(数值) 
$ws_emr12_00->emr12_00_01_076 = $emr12_00_01_076; //观察-计量单位 
$ws_emr12_00->emr12_00_01_077 = $emr12_00_01_077; //观察-结果代码 
$ws_emr12_00->emr12_00_01_081 = $emr12_00_01_081; //主诉 
$ws_emr12_00->emr12_00_01_082 = $emr12_00_01_082; //症状代码编码体系名称 
$ws_emr12_00->emr12_00_01_083 = $emr12_00_01_083; //症状代码 
$ws_emr12_00 ->emr12_00_01_084 = empty($emr12_00_01_084)?null : $ws_emr12_00 ->escape('emr12_00_01_084',to_date($emr12_00_01_084,'YYYY-MM-DD')); //症状开始日期时间 
$ws_emr12_00 ->emr12_00_01_085 = empty($emr12_00_01_085)?null : $ws_emr12_00 ->escape('emr12_00_01_085',to_date($emr12_00_01_085,'YYYY-MM-DD')); //症状停止日期时间 
$ws_emr12_00->emr12_00_01_086 = $emr12_00_01_086; //症状观察项目类目名称 
$ws_emr12_00->emr12_00_01_087 = $emr12_00_01_087; //症状观察结果 
$ws_emr12_00->emr12_00_01_091 = $emr12_00_01_091; //观察-类别 
$ws_emr12_00->emr12_00_01_092 = $emr12_00_01_092; //观察-类别代码 
$ws_emr12_00->emr12_00_01_093 = $emr12_00_01_093; //观察项目名称 
$ws_emr12_00->emr12_00_01_094 = $emr12_00_01_094; //观察-项目代码 
$ws_emr12_00->emr12_00_01_095 = $emr12_00_01_095; //观察-结果描述 
$ws_emr12_00->emr12_00_01_096 = $emr12_00_01_096; //观察-结果(数值) 
$ws_emr12_00->emr12_00_01_097 = $emr12_00_01_097; //观察-计量单位 
$ws_emr12_00->emr12_00_01_098 = $emr12_00_01_098; //观察-结果代码 
$ws_emr12_00->emr12_00_01_099 = $emr12_00_01_099; //体格检查项目类目名称 
$ws_emr12_00->emr12_00_01_100 = $emr12_00_01_100; //体格检查观察结果 
$ws_emr12_00->emr12_00_01_111 = $emr12_00_01_111; //观察-类别 
$ws_emr12_00->emr12_00_01_112 = $emr12_00_01_112; //观察-类别代码 
$ws_emr12_00->emr12_00_01_113 = $emr12_00_01_113; //观察项目名称 
$ws_emr12_00->emr12_00_01_114 = $emr12_00_01_114; //观察-项目代码 
$ws_emr12_00->emr12_00_01_115 = $emr12_00_01_115; //观察-结果描述 
$ws_emr12_00->emr12_00_01_116 = $emr12_00_01_116; //观察-结果(数值) 
$ws_emr12_00->emr12_00_01_117 = $emr12_00_01_117; //观察-计量单位 
$ws_emr12_00->emr12_00_01_118 = $emr12_00_01_118; //观察-结果代码 
$ws_emr12_00->emr12_00_01_121 = $emr12_00_01_121; //诊断机构名称 
$ws_emr12_00 ->emr12_00_01_122 = empty($emr12_00_01_122)?null : $ws_emr12_00 ->escape('emr12_00_01_122',to_date($emr12_00_01_122,'YYYY-MM-DD')); //诊断日期 
$ws_emr12_00->emr12_00_01_123 = $emr12_00_01_123; //诊断类别 
$ws_emr12_00->emr12_00_01_124 = $emr12_00_01_124; //诊断类别代码 
$ws_emr12_00->emr12_00_01_125 = $emr12_00_01_125; //诊断顺位（从属关系）代码 
$ws_emr12_00->emr12_00_01_126 = $emr12_00_01_126; //疾病名称 
$ws_emr12_00->emr12_00_01_127 = $emr12_00_01_127; //疾病代码 
$ws_emr12_00->emr12_00_01_128 = $emr12_00_01_128; //诊断依据 
$ws_emr12_00->emr12_00_01_129 = $emr12_00_01_129; //诊断依据代码 
$ws_emr12_00->emr12_00_01_131 = $emr12_00_01_131; //诊疗过程名称 
$ws_emr12_00->emr12_00_01_132 = $emr12_00_01_132; //诊疗过程描述 
$ws_emr12_00 ->emr12_00_01_141 = empty($emr12_00_01_141)?null : $ws_emr12_00 ->escape('emr12_00_01_141',to_date($emr12_00_01_141,'YYYY-MM-DD')); //医嘱开嘱日期时间 
$ws_emr12_00 ->emr12_00_01_142 = empty($emr12_00_01_142)?null : $ws_emr12_00 ->escape('emr12_00_01_142',to_date($emr12_00_01_142,'YYYY-MM-DD')); //长期医嘱停嘱日期时间 
$ws_emr12_00 ->emr12_00_01_143 = empty($emr12_00_01_143)?null : $ws_emr12_00 ->escape('emr12_00_01_143',to_date($emr12_00_01_143,'YYYY-MM-DD')); //医嘱执行日期时间 
$ws_emr12_00->emr12_00_01_144 = $emr12_00_01_144; //医嘱执行时间类别代码 
$ws_emr12_00 ->emr12_00_01_145 = empty($emr12_00_01_145)?null : $ws_emr12_00 ->escape('emr12_00_01_145',to_date($emr12_00_01_145,'YYYY-MM-DD')); //医嘱取消日期时间 
$ws_emr12_00->emr12_00_01_146 = $emr12_00_01_146; //医嘱类别 
$ws_emr12_00->emr12_00_01_147 = $emr12_00_01_147; //医嘱内容 
if($ws_emr12_00 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr12_00 ->free_statement();
}
