<?php
/**
电子病历基础模板：住院病程记录数据集（二）EMR10.02电子病历基础模板：住院病程记录数据集（二）
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr10_00_08_001  文档标识-名称 
* @param string $emr10_00_08_002  文档标识-类别代码
* @param string $emr10_00_08_003  文档标识-管理机构名称
* @param string $emr10_00_08_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr10_00_08_005  文档标识-号码* 
* @param date $emr10_00_08_006  文档标识-生效日期 
* @param date $emr10_00_08_007  文档标识-失效日期 
* @param string $emr10_00_08_011  标识号-类别代码 
* @param date $emr10_00_08_013  标识号-生效日期 
* @param date $emr10_00_08_014  标识号-失效日期 
* @param string $emr10_00_08_015  标识号-提供标识的机构名称 
* @param string $emr10_00_08_016  姓名-标识对象
* @param string $emr10_00_08_017  姓名-标识对象代码
* @param string $emr10_00_08_018  姓名 *
* @param string $emr10_00_08_021  性别代码 
* @param decimal $emr10_00_08_022  年龄（岁）*
* @param string $emr10_00_08_023  国籍代码 
* @param string $emr10_00_08_024  民族代码 
* @param string $emr10_00_08_025  婚姻状况类别代码
* @param string $emr10_00_08_026  职业编码系统名称 
* @param string $emr10_00_08_027  职业代码
* @param string $emr10_00_08_028  文化程度代码 
* @param date $emr10_00_08_029  出生日期* 
* @param string $emr10_00_08_030  出生地* 
* @param string $emr10_00_08_041  服务者姓名*
* @param string $emr10_00_08_042  服务者职责（角色）
* @param string $emr10_00_08_043  服务者职责（角色）代码
* @param string $emr10_00_08_044  服务者医师资格标志*
* @param string $emr10_00_08_045  服务者学历*
* @param string $emr10_00_08_046  服务者所学专业*
* @param string $emr10_00_08_047  服务者专业技术职称*
* @param string $emr10_00_08_048  服务者职务*
* @param string $emr10_00_08_051  主诉
* @param string $emr10_00_08_052  症状代码编码体系名称
* @param string $emr10_00_08_053  症状代码
* @param dateTime $emr10_00_08_054  症状开始日期时间
* @param dateTime $emr10_00_08_055  症状停止日期时间
* @param string $emr10_00_08_056  症状观察项目类目名称
* @param string $emr10_00_08_057  症状观察结果
* @param string $emr10_00_08_061  观察-类别
* @param string $emr10_00_08_062  观察-类别代码
* @param string $emr10_00_08_063  观察项目名称
* @param string $emr10_00_08_064  观察-项目代码
* @param string $emr10_00_08_065  观察-结果描述
* @param decimal $emr10_00_08_066  观察-结果(数值)
* @param string $emr10_00_08_067  观察-计量单位
* @param string $emr10_00_08_068  观察-结果代码
* @param string $emr10_00_08_069  体格检查项目类目名称
* @param string $emr10_00_08_070  体格检查观察结果
* @param string $emr10_00_08_081  观察-类别
* @param string $emr10_00_08_082  观察-类别代码
* @param string $emr10_00_08_083  观察项目名称
* @param string $emr10_00_08_084  观察-项目代码
* @param string $emr10_00_08_085  观察-结果描述
* @param decimal $emr10_00_08_086  观察-结果(数值)
* @param string $emr10_00_08_087  观察-计量单位
* @param string $emr10_00_08_088  观察-结果代码
* @param string $emr10_00_08_089  检查部位
* @param string $emr10_00_08_090  检查部位代码
* @param string $emr10_00_08_101  检查报告单—机构（科室）
* @param string $emr10_00_08_102  检查报告单—编号
* @param string $emr10_00_08_103  检查报告结果-客观所见
* @param string $emr10_00_08_104  检查报告结果-主观提示
* @param date $emr10_00_08_105  检查日期
* @param date $emr10_00_08_106  检查报告日期
* @param string $emr10_00_08_107  检查报告备注
* @param string $emr10_00_08_111  观察-类别
* @param string $emr10_00_08_112  观察-类别代码
* @param string $emr10_00_08_113  观察项目名称
* @param string $emr10_00_08_114  观察-项目代码
* @param string $emr10_00_08_115  观察-结果描述
* @param decimal $emr10_00_08_116  观察-结果(数值)
* @param string $emr10_00_08_117  观察-计量单位
* @param string $emr10_00_08_118  观察-结果代码
* @param string $emr10_00_08_121  检验报告单—机构（科室）
* @param string $emr10_00_08_122  检验报告单—编号
* @param string $emr10_00_08_123  检验报告结果-客观所见
* @param string $emr10_00_08_124  检验报告结果-主观提示
* @param date $emr10_00_08_125  检验日期
* @param date $emr10_00_08_126  检验报告日期
* @param string $emr10_00_08_127  检验报告备注
* @param string $emr10_00_08_131  诊断机构名称
* @param date $emr10_00_08_132  诊断日期
* @param string $emr10_00_08_133  诊断类别
* @param string $emr10_00_08_134  诊断类别代码
* @param string $emr10_00_08_135  诊断顺位（从属关系）代码
* @param string $emr10_00_08_136  疾病名称
* @param string $emr10_00_08_137  疾病代码
* @param string $emr10_00_08_138  诊断依据
* @param string $emr10_00_08_139  诊断依据代码
* @param string $emr10_00_08_141  手术/操作-名称
* @param string $emr10_00_08_142  手术/操作-代码
* @param string $emr10_00_08_143  手术/操作-目标部位名称
* @param string $emr10_00_08_144  操作部位编码体系名称
* @param string $emr10_00_08_145  操作部位编码
* @param string $emr10_00_08_146  介入物名称
* @param string $emr10_00_08_147  操作方法
* @param decimal $emr10_00_08_148  操作次数
* @param dateTime $emr10_00_08_149  操作日期/时间
* @param string $emr10_00_08_150  操作编码体系名称
* @param string $emr10_00_08_161  药物用法
* @param string $emr10_00_08_162  药物使用-频率
* @param string $emr10_00_08_163  药物使用-剂量单位
* @param decimal $emr10_00_08_164  药物使用-次剂量
* @param decimal $emr10_00_08_165  药物使用-总剂量
* @param string $emr10_00_08_166  药物使用-途径代码
* @param string $emr10_00_08_167  药物名称
* @param string $emr10_00_08_168  药物剂型代码
* @param string $emr10_00_08_169  中药类别代码
* @param string $emr10_00_08_170  药物类型
* @param string $emr10_00_08_171  药物名称代码
* @param string $emr10_00_08_181  拟做的检查
* @param string $emr10_00_08_182  拟做的医学检验
* @param string $emr10_00_08_183  今后治疗方案
* @param boolean $emr10_00_08_184  随访标志
* @param decimal $emr10_00_08_185  随访间隔（随诊期限）
* @param string $emr10_00_08_186  医嘱
* @param string $emr10_00_08_187  特别注意事项
* @param string $emr10_00_08_191  诊疗过程名称
* @param string $emr10_00_08_192  诊疗过程描述
* @return boolean
*/
function update_emr10_02($ws_id,$org_id,$doctor_id,$identity_number,$emr10_00_08_001='',$emr10_00_08_002='',$emr10_00_08_003='',$emr10_00_08_004='',$emr10_00_08_005='',$emr10_00_08_006='',$emr10_00_08_007='',$emr10_00_08_011='',$emr10_00_08_013='',$emr10_00_08_014='',$emr10_00_08_015='',$emr10_00_08_016='',$emr10_00_08_017='',$emr10_00_08_018='',$emr10_00_08_021='',$emr10_00_08_022=0,$emr10_00_08_023='',$emr10_00_08_024='',$emr10_00_08_025='',$emr10_00_08_026='',$emr10_00_08_027='',$emr10_00_08_028='',$emr10_00_08_029='',$emr10_00_08_030='',$emr10_00_08_041='',$emr10_00_08_042='',$emr10_00_08_043='',$emr10_00_08_044='',$emr10_00_08_045='',$emr10_00_08_046='',$emr10_00_08_047='',$emr10_00_08_048='',$emr10_00_08_051='',$emr10_00_08_052='',$emr10_00_08_053='',$emr10_00_08_054='',$emr10_00_08_055='',$emr10_00_08_056='',$emr10_00_08_057='',$emr10_00_08_061='',$emr10_00_08_062='',$emr10_00_08_063='',$emr10_00_08_064='',$emr10_00_08_065='',$emr10_00_08_066=0,$emr10_00_08_067='',$emr10_00_08_068='',$emr10_00_08_069='',$emr10_00_08_070='',$emr10_00_08_081='',$emr10_00_08_082='',$emr10_00_08_083='',$emr10_00_08_084='',$emr10_00_08_085='',$emr10_00_08_086=0,$emr10_00_08_087='',$emr10_00_08_088='',$emr10_00_08_089='',$emr10_00_08_090='',$emr10_00_08_101='',$emr10_00_08_102='',$emr10_00_08_103='',$emr10_00_08_104='',$emr10_00_08_105='',$emr10_00_08_106='',$emr10_00_08_107='',$emr10_00_08_111='',$emr10_00_08_112='',$emr10_00_08_113='',$emr10_00_08_114='',$emr10_00_08_115='',$emr10_00_08_116=0,$emr10_00_08_117='',$emr10_00_08_118='',$emr10_00_08_121='',$emr10_00_08_122='',$emr10_00_08_123='',$emr10_00_08_124='',$emr10_00_08_125='',$emr10_00_08_126='',$emr10_00_08_127='',$emr10_00_08_131='',$emr10_00_08_132='',$emr10_00_08_133='',$emr10_00_08_134='',$emr10_00_08_135='',$emr10_00_08_136='',$emr10_00_08_137='',$emr10_00_08_138='',$emr10_00_08_139='',$emr10_00_08_141='',$emr10_00_08_142='',$emr10_00_08_143='',$emr10_00_08_144='',$emr10_00_08_145='',$emr10_00_08_146='',$emr10_00_08_147='',$emr10_00_08_148=0,$emr10_00_08_149='',$emr10_00_08_150='',$emr10_00_08_161='',$emr10_00_08_162='',$emr10_00_08_163='',$emr10_00_08_164=0,$emr10_00_08_165=0,$emr10_00_08_166='',$emr10_00_08_167='',$emr10_00_08_168='',$emr10_00_08_169='',$emr10_00_08_170='',$emr10_00_08_171='',$emr10_00_08_181='',$emr10_00_08_182='',$emr10_00_08_183='',$emr10_00_08_184=false,$emr10_00_08_185=0,$emr10_00_08_186='',$emr10_00_08_187='',$emr10_00_08_191='',$emr10_00_08_192=''){
require_once(__SITEROOT.'library/Models/ws_emr10_02.php');
$table_obj="Tws_emr10_02";
$ws_emr10_02=new $table_obj();
$ws_emr10_02 -> ws_id=$ws_id;
$ws_emr10_02 -> uuid=uniqid('',true);
$ws_emr10_02 -> created=time();
$ws_emr10_02 -> org_id=$org_id;
$ws_emr10_02 -> doctor_id=$doctor_id;
$ws_emr10_02 -> identity_number=$identity_number;//身份证号
$ws_emr10_02 -> action='insert';
$ws_emr10_02->emr10_00_08_001 = $emr10_00_08_001; //文档标识-名称  
$ws_emr10_02->emr10_00_08_002 = $emr10_00_08_002; //文档标识-类别代码 
$ws_emr10_02->emr10_00_08_003 = $emr10_00_08_003; //文档标识-管理机构名称 
$ws_emr10_02->emr10_00_08_004 = $emr10_00_08_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr10_02->emr10_00_08_005 = $emr10_00_08_005; //文档标识-号码*  
$ws_emr10_02 ->emr10_00_08_006 = empty($emr10_00_08_006)?null : $ws_emr10_02 ->escape('emr10_00_08_006',to_date($emr10_00_08_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr10_02 ->emr10_00_08_007 = empty($emr10_00_08_007)?null : $ws_emr10_02 ->escape('emr10_00_08_007',to_date($emr10_00_08_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr10_02->emr10_00_08_011 = $emr10_00_08_011; //标识号-类别代码  
$ws_emr10_02 ->emr10_00_08_013 = empty($emr10_00_08_013)?null : $ws_emr10_02 ->escape('emr10_00_08_013',to_date($emr10_00_08_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr10_02 ->emr10_00_08_014 = empty($emr10_00_08_014)?null : $ws_emr10_02 ->escape('emr10_00_08_014',to_date($emr10_00_08_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr10_02->emr10_00_08_015 = $emr10_00_08_015; //标识号-提供标识的机构名称  
$ws_emr10_02->emr10_00_08_016 = $emr10_00_08_016; //姓名-标识对象 
$ws_emr10_02->emr10_00_08_017 = $emr10_00_08_017; //姓名-标识对象代码 
$ws_emr10_02->emr10_00_08_018 = $emr10_00_08_018; //姓名 * 
$ws_emr10_02->emr10_00_08_021 = $emr10_00_08_021; //性别代码  
$ws_emr10_02->emr10_00_08_022 = $emr10_00_08_022; //年龄（岁）* 
$ws_emr10_02->emr10_00_08_023 = $emr10_00_08_023; //国籍代码  
$ws_emr10_02->emr10_00_08_024 = $emr10_00_08_024; //民族代码  
$ws_emr10_02->emr10_00_08_025 = $emr10_00_08_025; //婚姻状况类别代码 
$ws_emr10_02->emr10_00_08_026 = $emr10_00_08_026; //职业编码系统名称  
$ws_emr10_02->emr10_00_08_027 = $emr10_00_08_027; //职业代码 
$ws_emr10_02->emr10_00_08_028 = $emr10_00_08_028; //文化程度代码  
$ws_emr10_02 ->emr10_00_08_029 = empty($emr10_00_08_029)?null : $ws_emr10_02 ->escape('emr10_00_08_029',to_date($emr10_00_08_029,'YYYY-MM-DD')); //出生日期*  
$ws_emr10_02->emr10_00_08_030 = $emr10_00_08_030; //出生地*  
$ws_emr10_02->emr10_00_08_041 = $emr10_00_08_041; //服务者姓名* 
$ws_emr10_02->emr10_00_08_042 = $emr10_00_08_042; //服务者职责（角色） 
$ws_emr10_02->emr10_00_08_043 = $emr10_00_08_043; //服务者职责（角色）代码 
$ws_emr10_02->emr10_00_08_044 = $emr10_00_08_044; //服务者医师资格标志* 
$ws_emr10_02->emr10_00_08_045 = $emr10_00_08_045; //服务者学历* 
$ws_emr10_02->emr10_00_08_046 = $emr10_00_08_046; //服务者所学专业* 
$ws_emr10_02->emr10_00_08_047 = $emr10_00_08_047; //服务者专业技术职称* 
$ws_emr10_02->emr10_00_08_048 = $emr10_00_08_048; //服务者职务* 
$ws_emr10_02->emr10_00_08_051 = $emr10_00_08_051; //主诉 
$ws_emr10_02->emr10_00_08_052 = $emr10_00_08_052; //症状代码编码体系名称 
$ws_emr10_02->emr10_00_08_053 = $emr10_00_08_053; //症状代码 
$ws_emr10_02 ->emr10_00_08_054 = empty($emr10_00_08_054)?null : $ws_emr10_02 ->escape('emr10_00_08_054',to_date($emr10_00_08_054,'YYYY-MM-DD')); //症状开始日期时间 
$ws_emr10_02 ->emr10_00_08_055 = empty($emr10_00_08_055)?null : $ws_emr10_02 ->escape('emr10_00_08_055',to_date($emr10_00_08_055,'YYYY-MM-DD')); //症状停止日期时间 
$ws_emr10_02->emr10_00_08_056 = $emr10_00_08_056; //症状观察项目类目名称 
$ws_emr10_02->emr10_00_08_057 = $emr10_00_08_057; //症状观察结果 
$ws_emr10_02->emr10_00_08_061 = $emr10_00_08_061; //观察-类别 
$ws_emr10_02->emr10_00_08_062 = $emr10_00_08_062; //观察-类别代码 
$ws_emr10_02->emr10_00_08_063 = $emr10_00_08_063; //观察项目名称 
$ws_emr10_02->emr10_00_08_064 = $emr10_00_08_064; //观察-项目代码 
$ws_emr10_02->emr10_00_08_065 = $emr10_00_08_065; //观察-结果描述 
$ws_emr10_02->emr10_00_08_066 = $emr10_00_08_066; //观察-结果(数值) 
$ws_emr10_02->emr10_00_08_067 = $emr10_00_08_067; //观察-计量单位 
$ws_emr10_02->emr10_00_08_068 = $emr10_00_08_068; //观察-结果代码 
$ws_emr10_02->emr10_00_08_069 = $emr10_00_08_069; //体格检查项目类目名称 
$ws_emr10_02->emr10_00_08_070 = $emr10_00_08_070; //体格检查观察结果 
$ws_emr10_02->emr10_00_08_081 = $emr10_00_08_081; //观察-类别 
$ws_emr10_02->emr10_00_08_082 = $emr10_00_08_082; //观察-类别代码 
$ws_emr10_02->emr10_00_08_083 = $emr10_00_08_083; //观察项目名称 
$ws_emr10_02->emr10_00_08_084 = $emr10_00_08_084; //观察-项目代码 
$ws_emr10_02->emr10_00_08_085 = $emr10_00_08_085; //观察-结果描述 
$ws_emr10_02->emr10_00_08_086 = $emr10_00_08_086; //观察-结果(数值) 
$ws_emr10_02->emr10_00_08_087 = $emr10_00_08_087; //观察-计量单位 
$ws_emr10_02->emr10_00_08_088 = $emr10_00_08_088; //观察-结果代码 
$ws_emr10_02->emr10_00_08_089 = $emr10_00_08_089; //检查部位 
$ws_emr10_02->emr10_00_08_090 = $emr10_00_08_090; //检查部位代码 
$ws_emr10_02->emr10_00_08_101 = $emr10_00_08_101; //检查报告单—机构（科室） 
$ws_emr10_02->emr10_00_08_102 = $emr10_00_08_102; //检查报告单—编号 
$ws_emr10_02->emr10_00_08_103 = $emr10_00_08_103; //检查报告结果-客观所见 
$ws_emr10_02->emr10_00_08_104 = $emr10_00_08_104; //检查报告结果-主观提示 
$ws_emr10_02 ->emr10_00_08_105 = empty($emr10_00_08_105)?null : $ws_emr10_02 ->escape('emr10_00_08_105',to_date($emr10_00_08_105,'YYYY-MM-DD')); //检查日期 
$ws_emr10_02 ->emr10_00_08_106 = empty($emr10_00_08_106)?null : $ws_emr10_02 ->escape('emr10_00_08_106',to_date($emr10_00_08_106,'YYYY-MM-DD')); //检查报告日期 
$ws_emr10_02->emr10_00_08_107 = $emr10_00_08_107; //检查报告备注 
$ws_emr10_02->emr10_00_08_111 = $emr10_00_08_111; //观察-类别 
$ws_emr10_02->emr10_00_08_112 = $emr10_00_08_112; //观察-类别代码 
$ws_emr10_02->emr10_00_08_113 = $emr10_00_08_113; //观察项目名称 
$ws_emr10_02->emr10_00_08_114 = $emr10_00_08_114; //观察-项目代码 
$ws_emr10_02->emr10_00_08_115 = $emr10_00_08_115; //观察-结果描述 
$ws_emr10_02->emr10_00_08_116 = $emr10_00_08_116; //观察-结果(数值) 
$ws_emr10_02->emr10_00_08_117 = $emr10_00_08_117; //观察-计量单位 
$ws_emr10_02->emr10_00_08_118 = $emr10_00_08_118; //观察-结果代码 
$ws_emr10_02->emr10_00_08_121 = $emr10_00_08_121; //检验报告单—机构（科室） 
$ws_emr10_02->emr10_00_08_122 = $emr10_00_08_122; //检验报告单—编号 
$ws_emr10_02->emr10_00_08_123 = $emr10_00_08_123; //检验报告结果-客观所见 
$ws_emr10_02->emr10_00_08_124 = $emr10_00_08_124; //检验报告结果-主观提示 
$ws_emr10_02 ->emr10_00_08_125 = empty($emr10_00_08_125)?null : $ws_emr10_02 ->escape('emr10_00_08_125',to_date($emr10_00_08_125,'YYYY-MM-DD')); //检验日期 
$ws_emr10_02 ->emr10_00_08_126 = empty($emr10_00_08_126)?null : $ws_emr10_02 ->escape('emr10_00_08_126',to_date($emr10_00_08_126,'YYYY-MM-DD')); //检验报告日期 
$ws_emr10_02->emr10_00_08_127 = $emr10_00_08_127; //检验报告备注 
$ws_emr10_02->emr10_00_08_131 = $emr10_00_08_131; //诊断机构名称 
$ws_emr10_02 ->emr10_00_08_132 = empty($emr10_00_08_132)?null : $ws_emr10_02 ->escape('emr10_00_08_132',to_date($emr10_00_08_132,'YYYY-MM-DD')); //诊断日期 
$ws_emr10_02->emr10_00_08_133 = $emr10_00_08_133; //诊断类别 
$ws_emr10_02->emr10_00_08_134 = $emr10_00_08_134; //诊断类别代码 
$ws_emr10_02->emr10_00_08_135 = $emr10_00_08_135; //诊断顺位（从属关系）代码 
$ws_emr10_02->emr10_00_08_136 = $emr10_00_08_136; //疾病名称 
$ws_emr10_02->emr10_00_08_137 = $emr10_00_08_137; //疾病代码 
$ws_emr10_02->emr10_00_08_138 = $emr10_00_08_138; //诊断依据 
$ws_emr10_02->emr10_00_08_139 = $emr10_00_08_139; //诊断依据代码 
$ws_emr10_02->emr10_00_08_141 = $emr10_00_08_141; //手术/操作-名称 
$ws_emr10_02->emr10_00_08_142 = $emr10_00_08_142; //手术/操作-代码 
$ws_emr10_02->emr10_00_08_143 = $emr10_00_08_143; //手术/操作-目标部位名称 
$ws_emr10_02->emr10_00_08_144 = $emr10_00_08_144; //操作部位编码体系名称 
$ws_emr10_02->emr10_00_08_145 = $emr10_00_08_145; //操作部位编码 
$ws_emr10_02->emr10_00_08_146 = $emr10_00_08_146; //介入物名称 
$ws_emr10_02->emr10_00_08_147 = $emr10_00_08_147; //操作方法 
$ws_emr10_02->emr10_00_08_148 = $emr10_00_08_148; //操作次数 
$ws_emr10_02 ->emr10_00_08_149 = empty($emr10_00_08_149)?null : $ws_emr10_02 ->escape('emr10_00_08_149',to_date($emr10_00_08_149,'YYYY-MM-DD')); //操作日期/时间 
$ws_emr10_02->emr10_00_08_150 = $emr10_00_08_150; //操作编码体系名称 
$ws_emr10_02->emr10_00_08_161 = $emr10_00_08_161; //药物用法 
$ws_emr10_02->emr10_00_08_162 = $emr10_00_08_162; //药物使用-频率 
$ws_emr10_02->emr10_00_08_163 = $emr10_00_08_163; //药物使用-剂量单位 
$ws_emr10_02->emr10_00_08_164 = $emr10_00_08_164; //药物使用-次剂量 
$ws_emr10_02->emr10_00_08_165 = $emr10_00_08_165; //药物使用-总剂量 
$ws_emr10_02->emr10_00_08_166 = $emr10_00_08_166; //药物使用-途径代码 
$ws_emr10_02->emr10_00_08_167 = $emr10_00_08_167; //药物名称 
$ws_emr10_02->emr10_00_08_168 = $emr10_00_08_168; //药物剂型代码 
$ws_emr10_02->emr10_00_08_169 = $emr10_00_08_169; //中药类别代码 
$ws_emr10_02->emr10_00_08_170 = $emr10_00_08_170; //药物类型 
$ws_emr10_02->emr10_00_08_171 = $emr10_00_08_171; //药物名称代码 
$ws_emr10_02->emr10_00_08_181 = $emr10_00_08_181; //拟做的检查 
$ws_emr10_02->emr10_00_08_182 = $emr10_00_08_182; //拟做的医学检验 
$ws_emr10_02->emr10_00_08_183 = $emr10_00_08_183; //今后治疗方案 
$ws_emr10_02->emr10_00_08_184 = $emr10_00_08_184; //随访标志 
$ws_emr10_02->emr10_00_08_185 = $emr10_00_08_185; //随访间隔（随诊期限） 
$ws_emr10_02->emr10_00_08_186 = $emr10_00_08_186; //医嘱 
$ws_emr10_02->emr10_00_08_187 = $emr10_00_08_187; //特别注意事项 
$ws_emr10_02->emr10_00_08_191 = $emr10_00_08_191; //诊疗过程名称 
$ws_emr10_02->emr10_00_08_192 = $emr10_00_08_192; //诊疗过程描述 
if($ws_emr10_02 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr10_02 ->free_statement();
}
