<?php
/**
电子病历基础模板：知情告知信息数据集EMR07.00电子病历基础模板：知情告知信息数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr07_00_01_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr07_00_01_005  文档标识-号码 
* @param date $emr07_00_01_006  文档标识-生效日期 
* @param date $emr07_00_01_007  文档标识-失效日期 
* @param string $emr07_00_01_011  标识号-类别代码 
* @param string $emr07_00_01_012  标识号-号码* 
* @param date $emr07_00_01_013  标识号-生效日期 
* @param date $emr07_00_01_014  标识号-失效日期 
* @param string $emr07_00_01_015  标识号-提供标识的机构名称 
* @param string $emr07_00_01_016  姓名-标识对象
* @param string $emr07_00_01_017  姓名-标识对象代码
* @param string $emr07_00_01_018  姓名 *
* @param string $emr07_00_01_021  性别代码 
* @param decimal $emr07_00_01_022  年龄（岁）*
* @param string $emr07_00_01_023  国籍代码 
* @param string $emr07_00_01_024  民族代码 
* @param string $emr07_00_01_025  婚姻状况类别代码
* @param string $emr07_00_01_026  职业编码系统名称 
* @param string $emr07_00_01_027  职业代码
* @param string $emr07_00_01_028  文化程度代码 
* @param date $emr07_00_01_029  出生日期* 
* @param string $emr07_00_01_030  出生地* 
* @param string $emr07_00_01_041  标识号-类别代码 
* @param string $emr07_00_01_042  标识号-号码* 
* @param date $emr07_00_01_043  标识号-生效日期 
* @param date $emr07_00_01_044  标识号-失效日期 
* @param string $emr07_00_01_045  标识号-提供标识的机构名称 
* @param string $emr07_00_01_046  姓名-标识对象
* @param string $emr07_00_01_047  姓名-标识对象代码
* @param string $emr07_00_01_048  姓名* 
* @param string $emr07_00_01_051  工作单位名称* 
* @param string $emr07_00_01_052  标识地址类别的代码 
* @param string $emr07_00_01_053  地址-省（自治区、直辖市）*
* @param string $emr07_00_01_054  地址-市（地区）*
* @param string $emr07_00_01_055  地址-县（区）*
* @param string $emr07_00_01_056  地址-乡（镇、街道办事处）*
* @param string $emr07_00_01_057  地址-村（街、路、弄等）*
* @param string $emr07_00_01_058  地址-门牌号码*
* @param string $emr07_00_01_059  邮政编码 
* @param string $emr07_00_01_060  行政区划代码 
* @param string $emr07_00_01_071  联系电话-类别
* @param string $emr07_00_01_072  联系电话-类别代码
* @param string $emr07_00_01_073  联系电话-号码*
* @param string $emr07_00_01_074  电子邮件地址*
* @param string $emr07_00_01_081  机构名称
* @param string $emr07_00_01_082  机构组织机构代码
* @param string $emr07_00_01_083  机构负责人（法人）
* @param string $emr07_00_01_084  机构地址
* @param string $emr07_00_01_085  科室名称
* @param string $emr07_00_01_086  机构角色
* @param string $emr07_00_01_087  机构角色代码
* @param string $emr07_00_01_091  服务者姓名*
* @param string $emr07_00_01_092  服务者职责（角色）
* @param string $emr07_00_01_093  服务者职责（角色）代码
* @param string $emr07_00_01_094  服务者医师资格标志*
* @param string $emr07_00_01_095  服务者学历*
* @param string $emr07_00_01_096  服务者所学专业*
* @param string $emr07_00_01_097  服务者专业技术职称*
* @param string $emr07_00_01_098  服务者职务*
* @param string $emr07_00_01_101  诊断机构名称
* @param date $emr07_00_01_102  诊断日期
* @param string $emr07_00_01_103  诊断类别
* @param string $emr07_00_01_104  诊断类别代码
* @param string $emr07_00_01_105  诊断顺位（从属关系）代码
* @param string $emr07_00_01_106  疾病名称
* @param string $emr07_00_01_107  疾病代码
* @param string $emr07_00_01_108  诊断依据
* @param string $emr07_00_01_109  诊断依据代码
* @param string $emr07_00_01_111  拟做的检查
* @param string $emr07_00_01_112  拟做的医学检验
* @param string $emr07_00_01_113  今后治疗方案
* @param boolean $emr07_00_01_114  随访标志
* @param decimal $emr07_00_01_115  随访间隔（随诊期限）
* @param string $emr07_00_01_116  医嘱
* @param string $emr07_00_01_117  特别注意事项
* @param string $emr07_00_01_122  患者知情同意记录结果
* @param string $emr07_00_01_131  诊疗过程名称
* @param string $emr07_00_01_132  诊疗过程描述
* @param string $emr07_00_01_001  文档标识-名称 
* @param string $emr07_00_01_002  文档标识-类别代码
* @param string $emr07_00_01_003  文档标识-管理机构名称
* @return boolean
*/
function update_emr07_00($ws_id,$org_id,$doctor_id,$identity_number,$emr07_00_01_004='',$emr07_00_01_005='',$emr07_00_01_006='',$emr07_00_01_007='',$emr07_00_01_011='',$emr07_00_01_012='',$emr07_00_01_013='',$emr07_00_01_014='',$emr07_00_01_015='',$emr07_00_01_016='',$emr07_00_01_017='',$emr07_00_01_018='',$emr07_00_01_021='',$emr07_00_01_022=0,$emr07_00_01_023='',$emr07_00_01_024='',$emr07_00_01_025='',$emr07_00_01_026='',$emr07_00_01_027='',$emr07_00_01_028='',$emr07_00_01_029='',$emr07_00_01_030='',$emr07_00_01_041='',$emr07_00_01_042='',$emr07_00_01_043='',$emr07_00_01_044='',$emr07_00_01_045='',$emr07_00_01_046='',$emr07_00_01_047='',$emr07_00_01_048='',$emr07_00_01_051='',$emr07_00_01_052='',$emr07_00_01_053='',$emr07_00_01_054='',$emr07_00_01_055='',$emr07_00_01_056='',$emr07_00_01_057='',$emr07_00_01_058='',$emr07_00_01_059='',$emr07_00_01_060='',$emr07_00_01_071='',$emr07_00_01_072='',$emr07_00_01_073='',$emr07_00_01_074='',$emr07_00_01_081='',$emr07_00_01_082='',$emr07_00_01_083='',$emr07_00_01_084='',$emr07_00_01_085='',$emr07_00_01_086='',$emr07_00_01_087='',$emr07_00_01_091='',$emr07_00_01_092='',$emr07_00_01_093='',$emr07_00_01_094='',$emr07_00_01_095='',$emr07_00_01_096='',$emr07_00_01_097='',$emr07_00_01_098='',$emr07_00_01_101='',$emr07_00_01_102='',$emr07_00_01_103='',$emr07_00_01_104='',$emr07_00_01_105='',$emr07_00_01_106='',$emr07_00_01_107='',$emr07_00_01_108='',$emr07_00_01_109='',$emr07_00_01_111='',$emr07_00_01_112='',$emr07_00_01_113='',$emr07_00_01_114=false,$emr07_00_01_115=0,$emr07_00_01_116='',$emr07_00_01_117='',$emr07_00_01_122='',$emr07_00_01_131='',$emr07_00_01_132='',$emr07_00_01_001='',$emr07_00_01_002='',$emr07_00_01_003=''){
require_once(__SITEROOT.'library/Models/ws_emr07_00.php');
$table_obj="Tws_emr07_00";
$ws_emr07_00=new $table_obj();
$ws_emr07_00 -> ws_id=$ws_id;
$ws_emr07_00 -> uuid=uniqid('',true);
$ws_emr07_00 -> created=time();
$ws_emr07_00 -> org_id=$org_id;
$ws_emr07_00 -> doctor_id=$doctor_id;
$ws_emr07_00 -> identity_number=$identity_number;//身份证号
$ws_emr07_00 -> action='insert';
$ws_emr07_00->emr07_00_01_004 = $emr07_00_01_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr07_00->emr07_00_01_005 = $emr07_00_01_005; //文档标识-号码  
$ws_emr07_00 ->emr07_00_01_006 = empty($emr07_00_01_006)?null : $ws_emr07_00 ->escape('emr07_00_01_006',to_date($emr07_00_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr07_00 ->emr07_00_01_007 = empty($emr07_00_01_007)?null : $ws_emr07_00 ->escape('emr07_00_01_007',to_date($emr07_00_01_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr07_00->emr07_00_01_011 = $emr07_00_01_011; //标识号-类别代码  
$ws_emr07_00->emr07_00_01_012 = $emr07_00_01_012; //标识号-号码*  
$ws_emr07_00 ->emr07_00_01_013 = empty($emr07_00_01_013)?null : $ws_emr07_00 ->escape('emr07_00_01_013',to_date($emr07_00_01_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr07_00 ->emr07_00_01_014 = empty($emr07_00_01_014)?null : $ws_emr07_00 ->escape('emr07_00_01_014',to_date($emr07_00_01_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr07_00->emr07_00_01_015 = $emr07_00_01_015; //标识号-提供标识的机构名称  
$ws_emr07_00->emr07_00_01_016 = $emr07_00_01_016; //姓名-标识对象 
$ws_emr07_00->emr07_00_01_017 = $emr07_00_01_017; //姓名-标识对象代码 
$ws_emr07_00->emr07_00_01_018 = $emr07_00_01_018; //姓名 * 
$ws_emr07_00->emr07_00_01_021 = $emr07_00_01_021; //性别代码  
$ws_emr07_00->emr07_00_01_022 = $emr07_00_01_022; //年龄（岁）* 
$ws_emr07_00->emr07_00_01_023 = $emr07_00_01_023; //国籍代码  
$ws_emr07_00->emr07_00_01_024 = $emr07_00_01_024; //民族代码  
$ws_emr07_00->emr07_00_01_025 = $emr07_00_01_025; //婚姻状况类别代码 
$ws_emr07_00->emr07_00_01_026 = $emr07_00_01_026; //职业编码系统名称  
$ws_emr07_00->emr07_00_01_027 = $emr07_00_01_027; //职业代码 
$ws_emr07_00->emr07_00_01_028 = $emr07_00_01_028; //文化程度代码  
$ws_emr07_00 ->emr07_00_01_029 = empty($emr07_00_01_029)?null : $ws_emr07_00 ->escape('emr07_00_01_029',to_date($emr07_00_01_029,'YYYY-MM-DD')); //出生日期*  
$ws_emr07_00->emr07_00_01_030 = $emr07_00_01_030; //出生地*  
$ws_emr07_00->emr07_00_01_041 = $emr07_00_01_041; //标识号-类别代码  
$ws_emr07_00->emr07_00_01_042 = $emr07_00_01_042; //标识号-号码*  
$ws_emr07_00 ->emr07_00_01_043 = empty($emr07_00_01_043)?null : $ws_emr07_00 ->escape('emr07_00_01_043',to_date($emr07_00_01_043,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr07_00 ->emr07_00_01_044 = empty($emr07_00_01_044)?null : $ws_emr07_00 ->escape('emr07_00_01_044',to_date($emr07_00_01_044,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr07_00->emr07_00_01_045 = $emr07_00_01_045; //标识号-提供标识的机构名称  
$ws_emr07_00->emr07_00_01_046 = $emr07_00_01_046; //姓名-标识对象 
$ws_emr07_00->emr07_00_01_047 = $emr07_00_01_047; //姓名-标识对象代码 
$ws_emr07_00->emr07_00_01_048 = $emr07_00_01_048; //姓名*  
$ws_emr07_00->emr07_00_01_051 = $emr07_00_01_051; //工作单位名称*  
$ws_emr07_00->emr07_00_01_052 = $emr07_00_01_052; //标识地址类别的代码  
$ws_emr07_00->emr07_00_01_053 = $emr07_00_01_053; //地址-省（自治区、直辖市）* 
$ws_emr07_00->emr07_00_01_054 = $emr07_00_01_054; //地址-市（地区）* 
$ws_emr07_00->emr07_00_01_055 = $emr07_00_01_055; //地址-县（区）* 
$ws_emr07_00->emr07_00_01_056 = $emr07_00_01_056; //地址-乡（镇、街道办事处）* 
$ws_emr07_00->emr07_00_01_057 = $emr07_00_01_057; //地址-村（街、路、弄等）* 
$ws_emr07_00->emr07_00_01_058 = $emr07_00_01_058; //地址-门牌号码* 
$ws_emr07_00->emr07_00_01_059 = $emr07_00_01_059; //邮政编码  
$ws_emr07_00->emr07_00_01_060 = $emr07_00_01_060; //行政区划代码  
$ws_emr07_00->emr07_00_01_071 = $emr07_00_01_071; //联系电话-类别 
$ws_emr07_00->emr07_00_01_072 = $emr07_00_01_072; //联系电话-类别代码 
$ws_emr07_00->emr07_00_01_073 = $emr07_00_01_073; //联系电话-号码* 
$ws_emr07_00->emr07_00_01_074 = $emr07_00_01_074; //电子邮件地址* 
$ws_emr07_00->emr07_00_01_081 = $emr07_00_01_081; //机构名称 
$ws_emr07_00->emr07_00_01_082 = $emr07_00_01_082; //机构组织机构代码 
$ws_emr07_00->emr07_00_01_083 = $emr07_00_01_083; //机构负责人（法人） 
$ws_emr07_00->emr07_00_01_084 = $emr07_00_01_084; //机构地址 
$ws_emr07_00->emr07_00_01_085 = $emr07_00_01_085; //科室名称 
$ws_emr07_00->emr07_00_01_086 = $emr07_00_01_086; //机构角色 
$ws_emr07_00->emr07_00_01_087 = $emr07_00_01_087; //机构角色代码 
$ws_emr07_00->emr07_00_01_091 = $emr07_00_01_091; //服务者姓名* 
$ws_emr07_00->emr07_00_01_092 = $emr07_00_01_092; //服务者职责（角色） 
$ws_emr07_00->emr07_00_01_093 = $emr07_00_01_093; //服务者职责（角色）代码 
$ws_emr07_00->emr07_00_01_094 = $emr07_00_01_094; //服务者医师资格标志* 
$ws_emr07_00->emr07_00_01_095 = $emr07_00_01_095; //服务者学历* 
$ws_emr07_00->emr07_00_01_096 = $emr07_00_01_096; //服务者所学专业* 
$ws_emr07_00->emr07_00_01_097 = $emr07_00_01_097; //服务者专业技术职称* 
$ws_emr07_00->emr07_00_01_098 = $emr07_00_01_098; //服务者职务* 
$ws_emr07_00->emr07_00_01_101 = $emr07_00_01_101; //诊断机构名称 
$ws_emr07_00 ->emr07_00_01_102 = empty($emr07_00_01_102)?null : $ws_emr07_00 ->escape('emr07_00_01_102',to_date($emr07_00_01_102,'YYYY-MM-DD')); //诊断日期 
$ws_emr07_00->emr07_00_01_103 = $emr07_00_01_103; //诊断类别 
$ws_emr07_00->emr07_00_01_104 = $emr07_00_01_104; //诊断类别代码 
$ws_emr07_00->emr07_00_01_105 = $emr07_00_01_105; //诊断顺位（从属关系）代码 
$ws_emr07_00->emr07_00_01_106 = $emr07_00_01_106; //疾病名称 
$ws_emr07_00->emr07_00_01_107 = $emr07_00_01_107; //疾病代码 
$ws_emr07_00->emr07_00_01_108 = $emr07_00_01_108; //诊断依据 
$ws_emr07_00->emr07_00_01_109 = $emr07_00_01_109; //诊断依据代码 
$ws_emr07_00->emr07_00_01_111 = $emr07_00_01_111; //拟做的检查 
$ws_emr07_00->emr07_00_01_112 = $emr07_00_01_112; //拟做的医学检验 
$ws_emr07_00->emr07_00_01_113 = $emr07_00_01_113; //今后治疗方案 
$ws_emr07_00->emr07_00_01_114 = $emr07_00_01_114; //随访标志 
$ws_emr07_00->emr07_00_01_115 = $emr07_00_01_115; //随访间隔（随诊期限） 
$ws_emr07_00->emr07_00_01_116 = $emr07_00_01_116; //医嘱 
$ws_emr07_00->emr07_00_01_117 = $emr07_00_01_117; //特别注意事项 
$ws_emr07_00->emr07_00_01_122 = $emr07_00_01_122; //患者知情同意记录结果 
$ws_emr07_00->emr07_00_01_131 = $emr07_00_01_131; //诊疗过程名称 
$ws_emr07_00->emr07_00_01_132 = $emr07_00_01_132; //诊疗过程描述 
$ws_emr07_00->emr07_00_01_001 = $emr07_00_01_001; //文档标识-名称  
$ws_emr07_00->emr07_00_01_002 = $emr07_00_01_002; //文档标识-类别代码 
$ws_emr07_00->emr07_00_01_003 = $emr07_00_01_003; //文档标识-管理机构名称 
if($ws_emr07_00 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr07_00 ->free_statement();
}
