<?php
/**
电子病历基础模板：门(急)诊处方数据集EMR03.00电子病历基础模板：门(急)诊处方数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr03_00_01_055  地址-县（区）*
* @param string $emr03_00_01_056  地址-乡（镇、街道办事处）*
* @param string $emr03_00_01_057  地址-村（街、路、弄等）*
* @param string $emr03_00_01_058  地址-门牌号码*
* @param string $emr03_00_01_059  邮政编码*
* @param string $emr03_00_01_060  行政区划代码 
* @param string $emr03_00_01_071  联系电话-类别
* @param string $emr03_00_01_072  联系电话-类别代码
* @param string $emr03_00_01_073  联系电话-号码*
* @param string $emr03_00_01_074  电子邮件地址*
* @param string $emr03_00_01_075  医疗保险-类别
* @param string $emr03_00_01_076  医疗保险-类别代码
* @param string $emr03_00_01_081  机构名称
* @param string $emr03_00_01_082  机构组织机构代码
* @param string $emr03_00_01_083  机构负责人（法人）
* @param string $emr03_00_01_084  机构地址
* @param string $emr03_00_01_085  科室名称
* @param string $emr03_00_01_086  机构角色
* @param string $emr03_00_01_087  机构角色代码
* @param string $emr03_00_01_091  服务者姓名*
* @param string $emr03_00_01_092  服务者职责（角色）
* @param string $emr03_00_01_093  服务者职责（角色）代码
* @param string $emr03_00_01_094  服务者医师资格标志*
* @param string $emr03_00_01_095  服务者学历*
* @param string $emr03_00_01_096  服务者所学专业*
* @param string $emr03_00_01_097  服务者专业技术职称*
* @param string $emr03_00_01_098  服务者职务*
* @param string $emr03_00_01_101  卫生事件(动作)名称
* @param string $emr03_00_01_102  事件分类代码
* @param string $emr03_00_01_103  事件开始时间
* @param string $emr03_00_01_104  事件结束时间
* @param date $emr03_00_01_105  事件发生地点
* @param date $emr03_00_01_106  事件发生场所
* @param string $emr03_00_01_107  事件参与方
* @param string $emr03_00_01_108  事件发生原因
* @param string $emr03_00_01_109  事件结局
* @param string $emr03_00_01_121  观察-类别
* @param string $emr03_00_01_122  观察-类别代码
* @param string $emr03_00_01_123  观察项目名称
* @param string $emr03_00_01_124  观察-项目代码
* @param string $emr03_00_01_125  观察-结果描述
* @param decimal $emr03_00_01_126  观察-结果(数值)
* @param string $emr03_00_01_127  观察-计量单位
* @param string $emr03_00_01_128  观察-结果代码
* @param string $emr03_00_01_129  体格检查项目类目名称
* @param string $emr03_00_01_130  体格检查观察结果
* @param string $emr03_00_01_141  诊断机构名称
* @param date $emr03_00_01_142  诊断日期
* @param string $emr03_00_01_143  诊断类别
* @param string $emr03_00_01_144  诊断类别代码
* @param string $emr03_00_01_145  诊断顺位（从属关系）代码
* @param string $emr03_00_01_146  疾病名称
* @param string $emr03_00_01_147  疾病代码
* @param string $emr03_00_01_148  诊断依据
* @param string $emr03_00_01_149  诊断依据代码
* @param string $emr03_00_01_151  药物用法
* @param string $emr03_00_01_152  药物使用-频率
* @param string $emr03_00_01_153  药物使用-剂量单位
* @param decimal $emr03_00_01_154  药物使用-次剂量
* @param decimal $emr03_00_01_155  药物使用-总剂量
* @param string $emr03_00_01_156  药物使用-途径代码
* @param string $emr03_00_01_157  药物名称
* @param string $emr03_00_01_158  药物剂型代码
* @param string $emr03_00_01_159  中药类别代码
* @param string $emr03_00_01_160  药物类型
* @param string $emr03_00_01_161  药物名称代码
* @param string $emr03_00_01_171  诊疗过程名称
* @param string $emr03_00_01_172  诊疗过程描述
* @param string $emr03_00_01_001  文档标识-名称 
* @param string $emr03_00_01_002  文档标识-类别代码
* @param string $emr03_00_01_003  文档标识-管理机构名称
* @param string $emr03_00_01_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr03_00_01_005  文档标识-号码 
* @param date $emr03_00_01_006  文档标识-生效日期 
* @param date $emr03_00_01_007  文档标识-失效日期 
* @param string $emr03_00_01_011  标识号-类别代码 
* @param string $emr03_00_01_012  标识号-号码 
* @param date $emr03_00_01_013  标识号-生效日期 
* @param date $emr03_00_01_014  标识号-失效日期 
* @param string $emr03_00_01_015  标识号-提供标识的机构名称 
* @param string $emr03_00_01_016  姓名-标识对象
* @param string $emr03_00_01_017  姓名-标识对象代码
* @param string $emr03_00_01_018  姓名* 
* @param string $emr03_00_01_021  性别代码 
* @param decimal $emr03_00_01_022  年龄（岁）*
* @param string $emr03_00_01_023  国籍代码 
* @param string $emr03_00_01_024  民族代码 
* @param string $emr03_00_01_025  婚姻状况类别代码
* @param string $emr03_00_01_026  职业编码系统名称 
* @param string $emr03_00_01_027  职业代码
* @param string $emr03_00_01_028  文化程度代码 
* @param date $emr03_00_01_029  出生日期* 
* @param string $emr03_00_01_030  出生地* 
* @param string $emr03_00_01_041  标识号-类别代码 
* @param string $emr03_00_01_042  标识号-号码 
* @param date $emr03_00_01_043  标识号-生效日期 
* @param date $emr03_00_01_044  标识号-失效日期 
* @param string $emr03_00_01_045  标识号-提供标识的机构名称 
* @param string $emr03_00_01_046  姓名-标识对象
* @param string $emr03_00_01_047  姓名-标识对象代码
* @param string $emr03_00_01_048  姓名 *
* @param string $emr03_00_01_051  工作单位名称* 
* @param string $emr03_00_01_052  标识地址类别的代码 
* @param string $emr03_00_01_053  地址-省（自治区、直辖市）*
* @param string $emr03_00_01_054  地址-市（地区）*
* @return boolean
*/
function update_emr03_00($ws_id,$org_id,$doctor_id,$identity_number,$emr03_00_01_055='',$emr03_00_01_056='',$emr03_00_01_057='',$emr03_00_01_058='',$emr03_00_01_059='',$emr03_00_01_060='',$emr03_00_01_071='',$emr03_00_01_072='',$emr03_00_01_073='',$emr03_00_01_074='',$emr03_00_01_075='',$emr03_00_01_076='',$emr03_00_01_081='',$emr03_00_01_082='',$emr03_00_01_083='',$emr03_00_01_084='',$emr03_00_01_085='',$emr03_00_01_086='',$emr03_00_01_087='',$emr03_00_01_091='',$emr03_00_01_092='',$emr03_00_01_093='',$emr03_00_01_094='',$emr03_00_01_095='',$emr03_00_01_096='',$emr03_00_01_097='',$emr03_00_01_098='',$emr03_00_01_101='',$emr03_00_01_102='',$emr03_00_01_103='',$emr03_00_01_104='',$emr03_00_01_105='',$emr03_00_01_106='',$emr03_00_01_107='',$emr03_00_01_108='',$emr03_00_01_109='',$emr03_00_01_121='',$emr03_00_01_122='',$emr03_00_01_123='',$emr03_00_01_124='',$emr03_00_01_125='',$emr03_00_01_126=0,$emr03_00_01_127='',$emr03_00_01_128='',$emr03_00_01_129='',$emr03_00_01_130='',$emr03_00_01_141='',$emr03_00_01_142='',$emr03_00_01_143='',$emr03_00_01_144='',$emr03_00_01_145='',$emr03_00_01_146='',$emr03_00_01_147='',$emr03_00_01_148='',$emr03_00_01_149='',$emr03_00_01_151='',$emr03_00_01_152='',$emr03_00_01_153='',$emr03_00_01_154=0,$emr03_00_01_155=0,$emr03_00_01_156='',$emr03_00_01_157='',$emr03_00_01_158='',$emr03_00_01_159='',$emr03_00_01_160='',$emr03_00_01_161='',$emr03_00_01_171='',$emr03_00_01_172='',$emr03_00_01_001='',$emr03_00_01_002='',$emr03_00_01_003='',$emr03_00_01_004='',$emr03_00_01_005='',$emr03_00_01_006='',$emr03_00_01_007='',$emr03_00_01_011='',$emr03_00_01_012='',$emr03_00_01_013='',$emr03_00_01_014='',$emr03_00_01_015='',$emr03_00_01_016='',$emr03_00_01_017='',$emr03_00_01_018='',$emr03_00_01_021='',$emr03_00_01_022=0,$emr03_00_01_023='',$emr03_00_01_024='',$emr03_00_01_025='',$emr03_00_01_026='',$emr03_00_01_027='',$emr03_00_01_028='',$emr03_00_01_029='',$emr03_00_01_030='',$emr03_00_01_041='',$emr03_00_01_042='',$emr03_00_01_043='',$emr03_00_01_044='',$emr03_00_01_045='',$emr03_00_01_046='',$emr03_00_01_047='',$emr03_00_01_048='',$emr03_00_01_051='',$emr03_00_01_052='',$emr03_00_01_053='',$emr03_00_01_054=''){
require_once(__SITEROOT.'library/Models/ws_emr03_00.php');
$table_obj="Tws_emr03_00";
$ws_emr03_00=new $table_obj();
$ws_emr03_00 -> ws_id=$ws_id;
$ws_emr03_00 -> uuid=uniqid('',true);
$ws_emr03_00 -> created=time();
$ws_emr03_00 -> org_id=$org_id;
$ws_emr03_00 -> doctor_id=$doctor_id;
$ws_emr03_00 -> identity_number=$identity_number;//身份证号
$ws_emr03_00 -> action='insert';
$ws_emr03_00->emr03_00_01_055 = $emr03_00_01_055; //地址-县（区）* 
$ws_emr03_00->emr03_00_01_056 = $emr03_00_01_056; //地址-乡（镇、街道办事处）* 
$ws_emr03_00->emr03_00_01_057 = $emr03_00_01_057; //地址-村（街、路、弄等）* 
$ws_emr03_00->emr03_00_01_058 = $emr03_00_01_058; //地址-门牌号码* 
$ws_emr03_00->emr03_00_01_059 = $emr03_00_01_059; //邮政编码* 
$ws_emr03_00->emr03_00_01_060 = $emr03_00_01_060; //行政区划代码  
$ws_emr03_00->emr03_00_01_071 = $emr03_00_01_071; //联系电话-类别 
$ws_emr03_00->emr03_00_01_072 = $emr03_00_01_072; //联系电话-类别代码 
$ws_emr03_00->emr03_00_01_073 = $emr03_00_01_073; //联系电话-号码* 
$ws_emr03_00->emr03_00_01_074 = $emr03_00_01_074; //电子邮件地址* 
$ws_emr03_00->emr03_00_01_075 = $emr03_00_01_075; //医疗保险-类别 
$ws_emr03_00->emr03_00_01_076 = $emr03_00_01_076; //医疗保险-类别代码 
$ws_emr03_00->emr03_00_01_081 = $emr03_00_01_081; //机构名称 
$ws_emr03_00->emr03_00_01_082 = $emr03_00_01_082; //机构组织机构代码 
$ws_emr03_00->emr03_00_01_083 = $emr03_00_01_083; //机构负责人（法人） 
$ws_emr03_00->emr03_00_01_084 = $emr03_00_01_084; //机构地址 
$ws_emr03_00->emr03_00_01_085 = $emr03_00_01_085; //科室名称 
$ws_emr03_00->emr03_00_01_086 = $emr03_00_01_086; //机构角色 
$ws_emr03_00->emr03_00_01_087 = $emr03_00_01_087; //机构角色代码 
$ws_emr03_00->emr03_00_01_091 = $emr03_00_01_091; //服务者姓名* 
$ws_emr03_00->emr03_00_01_092 = $emr03_00_01_092; //服务者职责（角色） 
$ws_emr03_00->emr03_00_01_093 = $emr03_00_01_093; //服务者职责（角色）代码 
$ws_emr03_00->emr03_00_01_094 = $emr03_00_01_094; //服务者医师资格标志* 
$ws_emr03_00->emr03_00_01_095 = $emr03_00_01_095; //服务者学历* 
$ws_emr03_00->emr03_00_01_096 = $emr03_00_01_096; //服务者所学专业* 
$ws_emr03_00->emr03_00_01_097 = $emr03_00_01_097; //服务者专业技术职称* 
$ws_emr03_00->emr03_00_01_098 = $emr03_00_01_098; //服务者职务* 
$ws_emr03_00->emr03_00_01_101 = $emr03_00_01_101; //卫生事件(动作)名称 
$ws_emr03_00->emr03_00_01_102 = $emr03_00_01_102; //事件分类代码 
$ws_emr03_00->emr03_00_01_103 = $emr03_00_01_103; //事件开始时间 
$ws_emr03_00->emr03_00_01_104 = $emr03_00_01_104; //事件结束时间 
$ws_emr03_00 ->emr03_00_01_105 = empty($emr03_00_01_105)?null : $ws_emr03_00 ->escape('emr03_00_01_105',to_date($emr03_00_01_105,'YYYY-MM-DD')); //事件发生地点 
$ws_emr03_00 ->emr03_00_01_106 = empty($emr03_00_01_106)?null : $ws_emr03_00 ->escape('emr03_00_01_106',to_date($emr03_00_01_106,'YYYY-MM-DD')); //事件发生场所 
$ws_emr03_00->emr03_00_01_107 = $emr03_00_01_107; //事件参与方 
$ws_emr03_00->emr03_00_01_108 = $emr03_00_01_108; //事件发生原因 
$ws_emr03_00->emr03_00_01_109 = $emr03_00_01_109; //事件结局 
$ws_emr03_00->emr03_00_01_121 = $emr03_00_01_121; //观察-类别 
$ws_emr03_00->emr03_00_01_122 = $emr03_00_01_122; //观察-类别代码 
$ws_emr03_00->emr03_00_01_123 = $emr03_00_01_123; //观察项目名称 
$ws_emr03_00->emr03_00_01_124 = $emr03_00_01_124; //观察-项目代码 
$ws_emr03_00->emr03_00_01_125 = $emr03_00_01_125; //观察-结果描述 
$ws_emr03_00->emr03_00_01_126 = $emr03_00_01_126; //观察-结果(数值) 
$ws_emr03_00->emr03_00_01_127 = $emr03_00_01_127; //观察-计量单位 
$ws_emr03_00->emr03_00_01_128 = $emr03_00_01_128; //观察-结果代码 
$ws_emr03_00->emr03_00_01_129 = $emr03_00_01_129; //体格检查项目类目名称 
$ws_emr03_00->emr03_00_01_130 = $emr03_00_01_130; //体格检查观察结果 
$ws_emr03_00->emr03_00_01_141 = $emr03_00_01_141; //诊断机构名称 
$ws_emr03_00 ->emr03_00_01_142 = empty($emr03_00_01_142)?null : $ws_emr03_00 ->escape('emr03_00_01_142',to_date($emr03_00_01_142,'YYYY-MM-DD')); //诊断日期 
$ws_emr03_00->emr03_00_01_143 = $emr03_00_01_143; //诊断类别 
$ws_emr03_00->emr03_00_01_144 = $emr03_00_01_144; //诊断类别代码 
$ws_emr03_00->emr03_00_01_145 = $emr03_00_01_145; //诊断顺位（从属关系）代码 
$ws_emr03_00->emr03_00_01_146 = $emr03_00_01_146; //疾病名称 
$ws_emr03_00->emr03_00_01_147 = $emr03_00_01_147; //疾病代码 
$ws_emr03_00->emr03_00_01_148 = $emr03_00_01_148; //诊断依据 
$ws_emr03_00->emr03_00_01_149 = $emr03_00_01_149; //诊断依据代码 
$ws_emr03_00->emr03_00_01_151 = $emr03_00_01_151; //药物用法 
$ws_emr03_00->emr03_00_01_152 = $emr03_00_01_152; //药物使用-频率 
$ws_emr03_00->emr03_00_01_153 = $emr03_00_01_153; //药物使用-剂量单位 
$ws_emr03_00->emr03_00_01_154 = $emr03_00_01_154; //药物使用-次剂量 
$ws_emr03_00->emr03_00_01_155 = $emr03_00_01_155; //药物使用-总剂量 
$ws_emr03_00->emr03_00_01_156 = $emr03_00_01_156; //药物使用-途径代码 
$ws_emr03_00->emr03_00_01_157 = $emr03_00_01_157; //药物名称 
$ws_emr03_00->emr03_00_01_158 = $emr03_00_01_158; //药物剂型代码 
$ws_emr03_00->emr03_00_01_159 = $emr03_00_01_159; //中药类别代码 
$ws_emr03_00->emr03_00_01_160 = $emr03_00_01_160; //药物类型 
$ws_emr03_00->emr03_00_01_161 = $emr03_00_01_161; //药物名称代码 
$ws_emr03_00->emr03_00_01_171 = $emr03_00_01_171; //诊疗过程名称 
$ws_emr03_00->emr03_00_01_172 = $emr03_00_01_172; //诊疗过程描述 
$ws_emr03_00->emr03_00_01_001 = $emr03_00_01_001; //文档标识-名称  
$ws_emr03_00->emr03_00_01_002 = $emr03_00_01_002; //文档标识-类别代码 
$ws_emr03_00->emr03_00_01_003 = $emr03_00_01_003; //文档标识-管理机构名称 
$ws_emr03_00->emr03_00_01_004 = $emr03_00_01_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr03_00->emr03_00_01_005 = $emr03_00_01_005; //文档标识-号码  
$ws_emr03_00 ->emr03_00_01_006 = empty($emr03_00_01_006)?null : $ws_emr03_00 ->escape('emr03_00_01_006',to_date($emr03_00_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr03_00 ->emr03_00_01_007 = empty($emr03_00_01_007)?null : $ws_emr03_00 ->escape('emr03_00_01_007',to_date($emr03_00_01_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr03_00->emr03_00_01_011 = $emr03_00_01_011; //标识号-类别代码  
$ws_emr03_00->emr03_00_01_012 = $emr03_00_01_012; //标识号-号码  
$ws_emr03_00 ->emr03_00_01_013 = empty($emr03_00_01_013)?null : $ws_emr03_00 ->escape('emr03_00_01_013',to_date($emr03_00_01_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr03_00 ->emr03_00_01_014 = empty($emr03_00_01_014)?null : $ws_emr03_00 ->escape('emr03_00_01_014',to_date($emr03_00_01_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr03_00->emr03_00_01_015 = $emr03_00_01_015; //标识号-提供标识的机构名称  
$ws_emr03_00->emr03_00_01_016 = $emr03_00_01_016; //姓名-标识对象 
$ws_emr03_00->emr03_00_01_017 = $emr03_00_01_017; //姓名-标识对象代码 
$ws_emr03_00->emr03_00_01_018 = $emr03_00_01_018; //姓名*  
$ws_emr03_00->emr03_00_01_021 = $emr03_00_01_021; //性别代码  
$ws_emr03_00->emr03_00_01_022 = $emr03_00_01_022; //年龄（岁）* 
$ws_emr03_00->emr03_00_01_023 = $emr03_00_01_023; //国籍代码  
$ws_emr03_00->emr03_00_01_024 = $emr03_00_01_024; //民族代码  
$ws_emr03_00->emr03_00_01_025 = $emr03_00_01_025; //婚姻状况类别代码 
$ws_emr03_00->emr03_00_01_026 = $emr03_00_01_026; //职业编码系统名称  
$ws_emr03_00->emr03_00_01_027 = $emr03_00_01_027; //职业代码 
$ws_emr03_00->emr03_00_01_028 = $emr03_00_01_028; //文化程度代码  
$ws_emr03_00 ->emr03_00_01_029 = empty($emr03_00_01_029)?null : $ws_emr03_00 ->escape('emr03_00_01_029',to_date($emr03_00_01_029,'YYYY-MM-DD')); //出生日期*  
$ws_emr03_00->emr03_00_01_030 = $emr03_00_01_030; //出生地*  
$ws_emr03_00->emr03_00_01_041 = $emr03_00_01_041; //标识号-类别代码  
$ws_emr03_00->emr03_00_01_042 = $emr03_00_01_042; //标识号-号码  
$ws_emr03_00 ->emr03_00_01_043 = empty($emr03_00_01_043)?null : $ws_emr03_00 ->escape('emr03_00_01_043',to_date($emr03_00_01_043,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr03_00 ->emr03_00_01_044 = empty($emr03_00_01_044)?null : $ws_emr03_00 ->escape('emr03_00_01_044',to_date($emr03_00_01_044,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr03_00->emr03_00_01_045 = $emr03_00_01_045; //标识号-提供标识的机构名称  
$ws_emr03_00->emr03_00_01_046 = $emr03_00_01_046; //姓名-标识对象 
$ws_emr03_00->emr03_00_01_047 = $emr03_00_01_047; //姓名-标识对象代码 
$ws_emr03_00->emr03_00_01_048 = $emr03_00_01_048; //姓名 * 
$ws_emr03_00->emr03_00_01_051 = $emr03_00_01_051; //工作单位名称*  
$ws_emr03_00->emr03_00_01_052 = $emr03_00_01_052; //标识地址类别的代码  
$ws_emr03_00->emr03_00_01_053 = $emr03_00_01_053; //地址-省（自治区、直辖市）* 
$ws_emr03_00->emr03_00_01_054 = $emr03_00_01_054; //地址-市（地区）* 
if($ws_emr03_00 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr03_00 ->free_statement();
}
