<?php
/**
电子病历基础模板：护理-护理操作记录数据集EMR06.01电子病历基础模板：护理-护理操作记录数据集
* @param string $ws_id 
* @param string $org_id 机构id
* @param string $doctor_id  医生id
* @param string $identity_number  身份证号
* @param string $emr06_01_01_001  文档标识-名称 
* @param string $emr06_01_01_002  文档标识-类别代码
* @param string $emr06_01_01_003  文档标识-管理机构名称
* @param string $emr06_01_01_004  文档标识-管理机构组织机构代码（法人代码）
* @param string $emr06_01_01_005  文档标识-号码 
* @param date $emr06_01_01_006  文档标识-生效日期 
* @param date $emr06_01_01_007  文档标识-失效日期 
* @param string $emr06_01_01_011  标识号-类别代码 
* @param string $emr06_01_01_012  标识号-号码 
* @param date $emr06_01_01_013  标识号-生效日期 
* @param date $emr06_01_01_014  标识号-失效日期 
* @param string $emr06_01_01_015  标识号-提供标识的机构名称 
* @param string $emr06_01_01_016  姓名-标识对象
* @param string $emr06_01_01_017  姓名-标识对象代码
* @param string $emr06_01_01_018  姓名 *
* @param string $emr06_01_01_021  机构名称
* @param string $emr06_01_01_022  机构组织机构代码
* @param string $emr06_01_01_023  机构负责人（法人）
* @param string $emr06_01_01_024  机构地址
* @param string $emr06_01_01_025  科室名称
* @param string $emr06_01_01_026  机构角色
* @param string $emr06_01_01_027  机构角色代码
* @param string $emr06_01_01_031  服务者姓名*
* @param string $emr06_01_01_032  服务者职责（角色）*
* @param string $emr06_01_01_033  服务者职责（角色）代码
* @param string $emr06_01_01_034  服务者医师资格标志*
* @param string $emr06_01_01_035  服务者学历*
* @param string $emr06_01_01_036  服务者所学专业*
* @param string $emr06_01_01_037  服务者专业技术职称*
* @param string $emr06_01_01_038  服务者职务*
* @param string $emr06_01_01_041  卫生事件(动作)名称
* @param string $emr06_01_01_042  事件分类代码
* @param date $emr06_01_01_043  事件开始时间
* @param date $emr06_01_01_044  事件结束时间
* @param string $emr06_01_01_045  事件发生地点
* @param string $emr06_01_01_046  事件发生场所
* @param string $emr06_01_01_047  事件参与方
* @param string $emr06_01_01_048  事件发生原因
* @param string $emr06_01_01_049  事件结局
* @param string $emr06_01_01_050  观察-类别
* @param string $emr06_01_01_051  观察-类别代码
* @param string $emr06_01_01_052  观察项目名称
* @param string $emr06_01_01_053  观察-项目代码
* @param string $emr06_01_01_054  观察-结果描述
* @param decimal $emr06_01_01_055  观察-结果(数值)
* @param string $emr06_01_01_056  观察-计量单位
* @param string $emr06_01_01_057  观察-结果代码
* @param string $emr06_01_01_061  一般状态检查描述
* @param string $emr06_01_01_062  一般状态检查体征代码
* @param string $emr06_01_01_063  一般状态检查项目名称
* @param string $emr06_01_01_064  一般状态检查项目类目名称
* @param string $emr06_01_01_065  一般状态检查结果
* @param string $emr06_01_01_066  皮肤检查描述
* @param string $emr06_01_01_067  皮肤检查体征代码
* @param string $emr06_01_01_068  皮肤检查项目名称
* @param string $emr06_01_01_069  皮肤检查项目类目名称
* @param string $emr06_01_01_070  皮肤检查结果
* @param string $emr06_01_01_081  诊断机构名称
* @param date $emr06_01_01_082  诊断日期
* @param string $emr06_01_01_083  诊断类别
* @param string $emr06_01_01_084  诊断类别代码
* @param string $emr06_01_01_085  诊断顺位（从属关系）代码
* @param string $emr06_01_01_086  疾病名称
* @param string $emr06_01_01_087  疾病代码
* @param string $emr06_01_01_088  诊断依据
* @param string $emr06_01_01_089  诊断依据代码
* @param string $emr06_01_01_091  手术/操作-名称
* @param string $emr06_01_01_092  手术/操作-代码
* @param string $emr06_01_01_093  手术/操作-目标部位名称
* @param string $emr06_01_01_094  操作部位编码体系名称
* @param string $emr06_01_01_095  操作部位编码
* @param string $emr06_01_01_096  介入物名称
* @param string $emr06_01_01_097  操作方法
* @param decimal $emr06_01_01_098  操作次数
* @param dateTime $emr06_01_01_099  操作日期/时间
* @param string $emr06_01_01_100  操作编码体系名称
* @param string $emr06_01_01_111  药物用法
* @param string $emr06_01_01_112  药物使用-频率
* @param string $emr06_01_01_113  药物使用-剂量单位
* @param decimal $emr06_01_01_114  药物使用-次剂量
* @param decimal $emr06_01_01_115  药物使用-总剂量
* @param string $emr06_01_01_116  药物使用-途径代码
* @param string $emr06_01_01_117  药物名称
* @param string $emr06_01_01_118  药物剂型代码
* @param string $emr06_01_01_119  中药类别代码
* @param string $emr06_01_01_120  药物类型
* @param string $emr06_01_01_121  药物名称代码
* @param string $emr06_01_01_131  护理等级
* @param string $emr06_01_01_132  护理类型代码
* @param string $emr06_01_01_133  护理操作名称
* @param string $emr06_01_01_134  护理操作项目类目名称
* @param string $emr06_01_01_135  护理操作结果
* @return boolean
*/
function update_emr06_01($ws_id,$org_id,$doctor_id,$identity_number,$emr06_01_01_001='',$emr06_01_01_002='',$emr06_01_01_003='',$emr06_01_01_004='',$emr06_01_01_005='',$emr06_01_01_006='',$emr06_01_01_007='',$emr06_01_01_011='',$emr06_01_01_012='',$emr06_01_01_013='',$emr06_01_01_014='',$emr06_01_01_015='',$emr06_01_01_016='',$emr06_01_01_017='',$emr06_01_01_018='',$emr06_01_01_021='',$emr06_01_01_022='',$emr06_01_01_023='',$emr06_01_01_024='',$emr06_01_01_025='',$emr06_01_01_026='',$emr06_01_01_027='',$emr06_01_01_031='',$emr06_01_01_032='',$emr06_01_01_033='',$emr06_01_01_034='',$emr06_01_01_035='',$emr06_01_01_036='',$emr06_01_01_037='',$emr06_01_01_038='',$emr06_01_01_041='',$emr06_01_01_042='',$emr06_01_01_043='',$emr06_01_01_044='',$emr06_01_01_045='',$emr06_01_01_046='',$emr06_01_01_047='',$emr06_01_01_048='',$emr06_01_01_049='',$emr06_01_01_050='',$emr06_01_01_051='',$emr06_01_01_052='',$emr06_01_01_053='',$emr06_01_01_054='',$emr06_01_01_055=0,$emr06_01_01_056='',$emr06_01_01_057='',$emr06_01_01_061='',$emr06_01_01_062='',$emr06_01_01_063='',$emr06_01_01_064='',$emr06_01_01_065='',$emr06_01_01_066='',$emr06_01_01_067='',$emr06_01_01_068='',$emr06_01_01_069='',$emr06_01_01_070='',$emr06_01_01_081='',$emr06_01_01_082='',$emr06_01_01_083='',$emr06_01_01_084='',$emr06_01_01_085='',$emr06_01_01_086='',$emr06_01_01_087='',$emr06_01_01_088='',$emr06_01_01_089='',$emr06_01_01_091='',$emr06_01_01_092='',$emr06_01_01_093='',$emr06_01_01_094='',$emr06_01_01_095='',$emr06_01_01_096='',$emr06_01_01_097='',$emr06_01_01_098=0,$emr06_01_01_099='',$emr06_01_01_100='',$emr06_01_01_111='',$emr06_01_01_112='',$emr06_01_01_113='',$emr06_01_01_114=0,$emr06_01_01_115=0,$emr06_01_01_116='',$emr06_01_01_117='',$emr06_01_01_118='',$emr06_01_01_119='',$emr06_01_01_120='',$emr06_01_01_121='',$emr06_01_01_131='',$emr06_01_01_132='',$emr06_01_01_133='',$emr06_01_01_134='',$emr06_01_01_135=''){
require_once(__SITEROOT.'library/Models/ws_emr06_01.php');
$table_obj="Tws_emr06_01";
$ws_emr06_01=new $table_obj();
$ws_emr06_01 -> ws_id=$ws_id;
$ws_emr06_01 -> uuid=uniqid('',true);
$ws_emr06_01 -> created=time();
$ws_emr06_01 -> org_id=$org_id;
$ws_emr06_01 -> doctor_id=$doctor_id;
$ws_emr06_01 -> identity_number=$identity_number;//身份证号
$ws_emr06_01 -> action='insert';
$ws_emr06_01->emr06_01_01_001 = $emr06_01_01_001; //文档标识-名称  
$ws_emr06_01->emr06_01_01_002 = $emr06_01_01_002; //文档标识-类别代码 
$ws_emr06_01->emr06_01_01_003 = $emr06_01_01_003; //文档标识-管理机构名称 
$ws_emr06_01->emr06_01_01_004 = $emr06_01_01_004; //文档标识-管理机构组织机构代码（法人代码） 
$ws_emr06_01->emr06_01_01_005 = $emr06_01_01_005; //文档标识-号码  
$ws_emr06_01 ->emr06_01_01_006 = empty($emr06_01_01_006)?null : $ws_emr06_01 ->escape('emr06_01_01_006',to_date($emr06_01_01_006,'YYYY-MM-DD')); //文档标识-生效日期  
$ws_emr06_01 ->emr06_01_01_007 = empty($emr06_01_01_007)?null : $ws_emr06_01 ->escape('emr06_01_01_007',to_date($emr06_01_01_007,'YYYY-MM-DD')); //文档标识-失效日期  
$ws_emr06_01->emr06_01_01_011 = $emr06_01_01_011; //标识号-类别代码  
$ws_emr06_01->emr06_01_01_012 = $emr06_01_01_012; //标识号-号码  
$ws_emr06_01 ->emr06_01_01_013 = empty($emr06_01_01_013)?null : $ws_emr06_01 ->escape('emr06_01_01_013',to_date($emr06_01_01_013,'YYYY-MM-DD')); //标识号-生效日期  
$ws_emr06_01 ->emr06_01_01_014 = empty($emr06_01_01_014)?null : $ws_emr06_01 ->escape('emr06_01_01_014',to_date($emr06_01_01_014,'YYYY-MM-DD')); //标识号-失效日期  
$ws_emr06_01->emr06_01_01_015 = $emr06_01_01_015; //标识号-提供标识的机构名称  
$ws_emr06_01->emr06_01_01_016 = $emr06_01_01_016; //姓名-标识对象 
$ws_emr06_01->emr06_01_01_017 = $emr06_01_01_017; //姓名-标识对象代码 
$ws_emr06_01->emr06_01_01_018 = $emr06_01_01_018; //姓名 * 
$ws_emr06_01->emr06_01_01_021 = $emr06_01_01_021; //机构名称 
$ws_emr06_01->emr06_01_01_022 = $emr06_01_01_022; //机构组织机构代码 
$ws_emr06_01->emr06_01_01_023 = $emr06_01_01_023; //机构负责人（法人） 
$ws_emr06_01->emr06_01_01_024 = $emr06_01_01_024; //机构地址 
$ws_emr06_01->emr06_01_01_025 = $emr06_01_01_025; //科室名称 
$ws_emr06_01->emr06_01_01_026 = $emr06_01_01_026; //机构角色 
$ws_emr06_01->emr06_01_01_027 = $emr06_01_01_027; //机构角色代码 
$ws_emr06_01->emr06_01_01_031 = $emr06_01_01_031; //服务者姓名* 
$ws_emr06_01->emr06_01_01_032 = $emr06_01_01_032; //服务者职责（角色）* 
$ws_emr06_01->emr06_01_01_033 = $emr06_01_01_033; //服务者职责（角色）代码 
$ws_emr06_01->emr06_01_01_034 = $emr06_01_01_034; //服务者医师资格标志* 
$ws_emr06_01->emr06_01_01_035 = $emr06_01_01_035; //服务者学历* 
$ws_emr06_01->emr06_01_01_036 = $emr06_01_01_036; //服务者所学专业* 
$ws_emr06_01->emr06_01_01_037 = $emr06_01_01_037; //服务者专业技术职称* 
$ws_emr06_01->emr06_01_01_038 = $emr06_01_01_038; //服务者职务* 
$ws_emr06_01->emr06_01_01_041 = $emr06_01_01_041; //卫生事件(动作)名称 
$ws_emr06_01->emr06_01_01_042 = $emr06_01_01_042; //事件分类代码 
$ws_emr06_01 ->emr06_01_01_043 = empty($emr06_01_01_043)?null : $ws_emr06_01 ->escape('emr06_01_01_043',to_date($emr06_01_01_043,'YYYY-MM-DD')); //事件开始时间 
$ws_emr06_01 ->emr06_01_01_044 = empty($emr06_01_01_044)?null : $ws_emr06_01 ->escape('emr06_01_01_044',to_date($emr06_01_01_044,'YYYY-MM-DD')); //事件结束时间 
$ws_emr06_01->emr06_01_01_045 = $emr06_01_01_045; //事件发生地点 
$ws_emr06_01->emr06_01_01_046 = $emr06_01_01_046; //事件发生场所 
$ws_emr06_01->emr06_01_01_047 = $emr06_01_01_047; //事件参与方 
$ws_emr06_01->emr06_01_01_048 = $emr06_01_01_048; //事件发生原因 
$ws_emr06_01->emr06_01_01_049 = $emr06_01_01_049; //事件结局 
$ws_emr06_01->emr06_01_01_050 = $emr06_01_01_050; //观察-类别 
$ws_emr06_01->emr06_01_01_051 = $emr06_01_01_051; //观察-类别代码 
$ws_emr06_01->emr06_01_01_052 = $emr06_01_01_052; //观察项目名称 
$ws_emr06_01->emr06_01_01_053 = $emr06_01_01_053; //观察-项目代码 
$ws_emr06_01->emr06_01_01_054 = $emr06_01_01_054; //观察-结果描述 
$ws_emr06_01->emr06_01_01_055 = $emr06_01_01_055; //观察-结果(数值) 
$ws_emr06_01->emr06_01_01_056 = $emr06_01_01_056; //观察-计量单位 
$ws_emr06_01->emr06_01_01_057 = $emr06_01_01_057; //观察-结果代码 
$ws_emr06_01->emr06_01_01_061 = $emr06_01_01_061; //一般状态检查描述 
$ws_emr06_01->emr06_01_01_062 = $emr06_01_01_062; //一般状态检查体征代码 
$ws_emr06_01->emr06_01_01_063 = $emr06_01_01_063; //一般状态检查项目名称 
$ws_emr06_01->emr06_01_01_064 = $emr06_01_01_064; //一般状态检查项目类目名称 
$ws_emr06_01->emr06_01_01_065 = $emr06_01_01_065; //一般状态检查结果 
$ws_emr06_01->emr06_01_01_066 = $emr06_01_01_066; //皮肤检查描述 
$ws_emr06_01->emr06_01_01_067 = $emr06_01_01_067; //皮肤检查体征代码 
$ws_emr06_01->emr06_01_01_068 = $emr06_01_01_068; //皮肤检查项目名称 
$ws_emr06_01->emr06_01_01_069 = $emr06_01_01_069; //皮肤检查项目类目名称 
$ws_emr06_01->emr06_01_01_070 = $emr06_01_01_070; //皮肤检查结果 
$ws_emr06_01->emr06_01_01_081 = $emr06_01_01_081; //诊断机构名称 
$ws_emr06_01 ->emr06_01_01_082 = empty($emr06_01_01_082)?null : $ws_emr06_01 ->escape('emr06_01_01_082',to_date($emr06_01_01_082,'YYYY-MM-DD')); //诊断日期 
$ws_emr06_01->emr06_01_01_083 = $emr06_01_01_083; //诊断类别 
$ws_emr06_01->emr06_01_01_084 = $emr06_01_01_084; //诊断类别代码 
$ws_emr06_01->emr06_01_01_085 = $emr06_01_01_085; //诊断顺位（从属关系）代码 
$ws_emr06_01->emr06_01_01_086 = $emr06_01_01_086; //疾病名称 
$ws_emr06_01->emr06_01_01_087 = $emr06_01_01_087; //疾病代码 
$ws_emr06_01->emr06_01_01_088 = $emr06_01_01_088; //诊断依据 
$ws_emr06_01->emr06_01_01_089 = $emr06_01_01_089; //诊断依据代码 
$ws_emr06_01->emr06_01_01_091 = $emr06_01_01_091; //手术/操作-名称 
$ws_emr06_01->emr06_01_01_092 = $emr06_01_01_092; //手术/操作-代码 
$ws_emr06_01->emr06_01_01_093 = $emr06_01_01_093; //手术/操作-目标部位名称 
$ws_emr06_01->emr06_01_01_094 = $emr06_01_01_094; //操作部位编码体系名称 
$ws_emr06_01->emr06_01_01_095 = $emr06_01_01_095; //操作部位编码 
$ws_emr06_01->emr06_01_01_096 = $emr06_01_01_096; //介入物名称 
$ws_emr06_01->emr06_01_01_097 = $emr06_01_01_097; //操作方法 
$ws_emr06_01->emr06_01_01_098 = $emr06_01_01_098; //操作次数 
$ws_emr06_01 ->emr06_01_01_099 = empty($emr06_01_01_099)?null : $ws_emr06_01 ->escape('emr06_01_01_099',to_date($emr06_01_01_099,'YYYY-MM-DD')); //操作日期/时间 
$ws_emr06_01->emr06_01_01_100 = $emr06_01_01_100; //操作编码体系名称 
$ws_emr06_01->emr06_01_01_111 = $emr06_01_01_111; //药物用法 
$ws_emr06_01->emr06_01_01_112 = $emr06_01_01_112; //药物使用-频率 
$ws_emr06_01->emr06_01_01_113 = $emr06_01_01_113; //药物使用-剂量单位 
$ws_emr06_01->emr06_01_01_114 = $emr06_01_01_114; //药物使用-次剂量 
$ws_emr06_01->emr06_01_01_115 = $emr06_01_01_115; //药物使用-总剂量 
$ws_emr06_01->emr06_01_01_116 = $emr06_01_01_116; //药物使用-途径代码 
$ws_emr06_01->emr06_01_01_117 = $emr06_01_01_117; //药物名称 
$ws_emr06_01->emr06_01_01_118 = $emr06_01_01_118; //药物剂型代码 
$ws_emr06_01->emr06_01_01_119 = $emr06_01_01_119; //中药类别代码 
$ws_emr06_01->emr06_01_01_120 = $emr06_01_01_120; //药物类型 
$ws_emr06_01->emr06_01_01_121 = $emr06_01_01_121; //药物名称代码 
$ws_emr06_01->emr06_01_01_131 = $emr06_01_01_131; //护理等级 
$ws_emr06_01->emr06_01_01_132 = $emr06_01_01_132; //护理类型代码 
$ws_emr06_01->emr06_01_01_133 = $emr06_01_01_133; //护理操作名称 
$ws_emr06_01->emr06_01_01_134 = $emr06_01_01_134; //护理操作项目类目名称 
$ws_emr06_01->emr06_01_01_135 = $emr06_01_01_135; //护理操作结果 
if($ws_emr06_01 ->insert()){
	return true;
}else{
	return false;
}
$ws_emr06_01 ->free_statement();
}
